{"Colombia": {"country-iso": "CO", "name": "Colombia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>If you're visiting for tourism and plan to stay for 90 days or less, you generally won't need a visa to enter Colombia.<br>Immigration officers can refuse your entry, even if you meet the criteria for visa-free entry. They may ask you to show proof of return or onward travel.<br>For other situations, you'll need to get a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Colombia for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you're travelling through the US, you must meet US entry or transit requirements.<br>Check your visa requirements with your nearest embassy or consulate of the United States before you travel."}, "Hong Kong": {"country-iso": "HK", "name": "Hong Kong", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Hong Kong is a Special Administrative Region (SAR) of China. This means it has separate immigration regulations from those of the People's Republic of China.<br>Tourist visas<br>You generally will be granted a 90 day tourist visa on arrival if you're both:<br>Other visas<br>In all other cases, you'll need a visa.<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and quarantine rules, contact:<br>the Hong Kong Economic and Trade Office in Sydney<br>the Hong Kong Special Administrative Region Immigration Department<br>If you plan to travel between Hong Kong and mainland China, you'll need a visa.<br>If you plan to return to China after visiting Hong Kong, get a multiple-entry visa for China. If you don't get this visa, you'll need a new visa to re-enter China. Get your visa before leaving Australia.<br>If you enter the Shenzhen Special Economic Zone, you can apply for a visa at the border of Shenzhen and Hong Kong.<br>If you've recently changed your passport, but your Chinese visa is still in the old passport, take both passports with you. Officials may ask you to present your previous passport and Chinese visa.<br>If you can't produce your previous visa, border officials may deny you a visa on arrival to Shenzhen.<br>China travel advice"}, "Bangladesh": {"country-iso": "BD", "name": "Bangladesh", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to enter Bangladesh. Arrange it before you arrive.<br>Entry and exit conditions can change at short notice. Contact the Bangladesh High Commission for details about visas, currency, customs and quarantine rules."}, "Sweden": {"country-iso": "SE", "name": "Sweden", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Sweden is part of the Schengen area. You can enter Sweden without a visa in some situations.<br>Check local news for border conditions. You can also ask transport providers.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy of Sweden for details about visas, currency, customs and quarantine rules."}, "Papua New Guinea": {"country-iso": "PG", "name": "Papua New Guinea", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>You need a visa to enter PNG.<br>Australians can apply for tourist visas on arrival or through the PNG eVisa portal. There have been reports of fraudulent websites targeting foreign nationals applying for eVisas to PNG. If applying for an eVisa, use the official PNG Immigration and Citizenship Authority website.  It's illegal to work in PNG on a tourist visa.<br>or through the PNG eVisa portal. There have been reports of fraudulent websites targeting foreign nationals applying for eVisas to PNG. If applying for an eVisa, use the official PNG Immigration and Citizenship Authority website.<br>If you breach PNG immigration laws, you can be:<br>Entry and exit conditions can change. Contact an embassy or consulate of Papua New Guinea for details about visas, currency, customs and quarantine rules.<br>You can't bring fruit or vegetables into PNG due to quarantine restrictions."}, "Sri Lanka": {"country-iso": "LK", "name": "Sri Lanka", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa, in the form of an Electronic Travel Authority (ETA).<br>Depending on your ETA category, you may be charged a processing fee.<br>Select the correct visa category for your situation.<br>If you engage in activities that breach your visa conditions, authorities could detain or deport you.<br>Entry and exit conditions can change. Contact the High Commission of Sri Lanka for details about visas, currency, customs and quarantine rules.<br>Pay close attention to the date your visa expires. You could receive a large fine if you overstay your visa.<br>If you're travelling from a country with yellow fever you need to present evidence that you've received the relevant immunisations.<br>You need a yellow fever vaccination certificate even if you've only transited through an affected country. This rule applies for the 9 days before you enter Sri Lanka. Babies under 1 year old are exempt.<br>Find out about returning to Australia after exposure to yellow fever.<br>Sri Lanka Ministry of Foreign Affairs"}, "Jordan": {"country-iso": "JO", "name": "Jordan", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to visit Jordan.<br>If you're a tourist, you can get a single-entry visa that's valid for 30 days.  You can get these on arrival at airports. They're also available at the Sheikh Hussein or North Border crossing at the border between Jordan and Israel.<br>The purchase of a Jordan Pass pre-arrival waives visa fees of JD40 (if staying a minimum of 3 nights) as well as providing access to 36 tourist sites across the country.<br>Entry visas are not available at:<br>the Wadi Araba crossing between Aqaba, Jordan and Eilat, Israel<br>the Allenby and King Hussein Bridge on the border between Jordan and Israel<br>You need to arrange a visa in advance if:<br>you plan to stay for more than a month<br>you're going to Jordan to do something other than be a tourist, such as work or study<br>you're entering Jordan at the border crossings at Wadi Araba or the Allenby and King Hussein Bridge<br>Entry and exit conditions can change at short notice. Contact the nearest embassy of Jordan for details about visas, currency, customs and quarantine rules."}, "Japan": {"country-iso": "JP", "name": "Japan", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You don't need a visa if you're visiting for less than 90 days:<br>To qualify, you need to show you have:<br>If Japanese immigration believes you intend to look for work, they could refuse you entry for up to 5 years. You can't appeal the decision.<br>When you arrive, you must declare if you have a criminal record. If you have a criminal record, immigration may refuse you entry. Before travelling, contact the nearest embassy or consulate of Japan to check if you need a visa.<br>Some employment agents may tell you it's OK to work in Japan without the correct visa. However, if you work in Japan on a tourist visa, authorities could prosecute you.<br>Entry and exit conditions<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and quarantine rules, contact an embassy or consulate of Japan.<br>The Embassy of Japan in Canberra has information for visa applicants."}, "Afghanistan": {"country-iso": "AF", "name": "Afghanistan", "advisory-text": "Do not travel", "visa-info": "<br>Entry and exit conditions can change at short notice. Contact the Embassy of Afghanistan for details about visas, currency, customs and quarantine rules.<br>If you're planning to travel to Afghanistan via Pakistan, make sure you:<br>This will help you avoid difficulties when you leave.<br>It's difficult to get visas or renew passports when you're in Afghanistan."}, "Burkina Faso": {"country-iso": "BF", "name": "Burkina Faso", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visitor visas<br>If you decide to travel to Burkina Faso despite our advice, be aware that entry and exit conditions can change at short notice.<br>Contact an embassy or consulate of Burkina Faso for details about visas, currency, customs and quarantine rules."}, "Samoa": {"country-iso": "WS", "name": "Samoa", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You can apply for a 90 day Vistitor Permit on arrival using the passenger arrival card if you:<br>For other situations and for Business Visitor Permits, see the Ministry of Prime Minister and Cabinet website.<br>Entry and exit conditions can change. Contact a high commission of Samoa for details about visas, currency, customs and quarantine rules.<br>If you've visited an Ebola-affected country within 21 days of arriving in Samoa, you may be stopped by officials. You may be quarantined or deported, even if don't have a fever or Ebola-like symptoms."}, "South Africa": {"country-iso": "ZA", "name": "South Africa", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You don't need a visa if you're visiting South Africa for tourism purposes for up to 90 days. In other cases, you'll need a visa.<br>Leaving and re-entering South Africa won't automatically give you another 90 days.<br>Check South Africa's immigration rules about:"}, "Chile": {"country-iso": "CL", "name": "Chile", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>If you're visiting Chile for tourism for 90 days or less, you can get a visa on arrival.<br>In other circumstances, you'll need to apply for your visa through an embassy or consulate of Chile.<br>If you regularly travel for business, the APEC Business Travel Card provides streamlined entry to several regional countries.<br>You need a valid visa to depart Chile.<br>You can apply to extend your visa at:\nChilean Immigration Office\nSan Antonio 580\nSantiago \nCall:  (+56 2) 2550 2469<br>If you overstay your visa, go to the Migration Department of the Ministry of the Interior and Public Security. You may face a fine.<br>If your Tourist Card is lost or stolen, get a new one at any International Police (PDI) Office or at Santiago's international airport.<br>Entry and exit conditions can change. Contact the Embassy or Consulate of Chile for details about visas, currency, customs and quarantine rules.<br>You can't stay on Easter Island (Isla de Pascua / Rapa Nui) for more than 30 consecutive days.<br>Travel via the United States<br>If you're travelling through the US, you must meet strict US entry and transit requirements. This include transit through Hawaii or another US point of entry.<br>Check your visa requirements with a US embassy or consulate well in advance of your travel.<br>Other requirements<br>Australian tourists arriving at Santiago International Airport must pay a USD 117`reciprocity fee' by credit card, EFTPOS or in US dollars.<br>Travel with children<br>If you're travelling with children aged younger than 18, you may need to show the original, and provide a copy, of the child's birth certificate, particularly if the parent and child don't share a family name.<br>A child aged under 18 years who isn't accompanied by 1 or both parents must carry 3 copies of:<br>You also need a Spanish translation of the documents notarised no more than 3 months before travelling at either:<br>You can use the same document for entry and exit.<br>A child aged under 18 years born overseas to Chilean parents can enter Chile on an Australian passport and remain for up to 90 days as a tourist.<br>For stays longer than 90 days, the child must obtain a Chilean passport.<br><br>See Local laws"}, "Spain": {"country-iso": "ES", "name": "Spain", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Spain is a part of the Schengen area, along with many other European countries. This allows you to enter without a visa in some cases.<br>You'll need a visa if:<br>Entry and exit conditions can change at short notice. Contact the nearest Embassy or Consulate of Spain for details about visas, currency, customs and quarantine rules."}, "Saudi Arabia": {"country-iso": "SA", "name": "Saudi Arabia", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Entry visa<br>You need a visa to enter Saudi Arabia.<br>Online visas are now available for Australian citizens. You can apply for an e-visa at: https://visa.visitsaudi.com/<br>If you're taking part in either the Hajj or Umrah pilgrimage, special visa conditions may apply. Only Muslims are allowed to enter Makkah (Mecca) and Madinah.<br>Only Muslims are allowed to enter Makkah (Mecca) and Madinah.<br>Entering by a land entry port (for example the King Fahd Causeway from Bahrain) on a business/visit visa that is annotated “via air’’ may not be allowed   (noting that this may be written in Arabic). Carefully read and understand the restrictions of your Saudi business/visit visa.<br>Entering by a land entry port (for example the King Fahd Causeway from Bahrain) on a business/visit visa that is annotated “via air’’ may not be allowed<br><br>(noting that this may be written in Arabic)<br>. Carefully read and understand the restrictions of your Saudi business/visit visa.<br>If you’re transiting through Saudi Arabia, you may need a transit visa.<br>If you overstay your visa, you'll face:<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Saudi Arabia for details about visas, currency, customs and quarantine rules.<br>Exit visas<br>Visitors on a single or multiple-entry business visa don't need an exit permit to leave Saudi Arabia.<br>If you hold a work or residency permit, you'll need to get an exit/re-entry or final exit permit from the Saudi Ministry of Interior. You must do this through your sponsor.<br>The Saudi Government doesn't recognise dual nationality for its citizens. Authorities will seize extra passports if they find them.<br>If you're a dual national (e.g Australian/UK nationals), and you are travelling with both passports, you can only leave Saudi Arabia with the passport you used to enter.<br>See Local laws<br>Travel bans<br>Authorities may place Australians under a travel ban. This means that you won't be able to leave the country if you're a visitor or resident permit (iqama) holder and you're involved in a dispute about:<br>Authorities are strict with travel bans. They can take months or even years to resolve.<br>Only Saudi Arabian authorities and sponsors can remove travel bans. Saudi sponsors have considerable power in dispute negotiations.<br>Private Saudi citizens may also initiate travel bans against expats.<br>The government may issue travel bans on people who:<br>Travel bans on women and children<br>Children living in Saudi Arabia as part of a Saudi household need permission from a male relative to leave Saudi Arabia.<br>Saudi authorities have introduced fees for dependants that apply to iqama holders.<br>If you're an expat with outstanding fees for dependants, you may have to pay the fees before you can:<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter Saudi Arabia if you're travelling from an area with a risk of yellow fever.<br>Polio outbreaks<br>Travellers under the age of 15 arriving from countries with polio outbreaks must provide proof of up-to-date polio vaccination.<br>Travel to Israel<br>You may be refused entry if your passport or luggage has evidence of travel to Israel, such as:<br>Women travellers<br>If you are a woman travelling to Saudi Arabia to live and work in the country, you may wish to arrange to be met by your work sponsor when you first arrive.  If you’re not met by your sponsor, you may experience delays before you’re allowed to:<br>enter the country<br>continue on to another flight<br>Work visa<br>It's illegal to work for anyone other than your current sponsor or employer.<br>If you do, you may be punished with:<br>Hajj<br>If you're a non-resident, authorities may restrict your entry to Jeddah, Madinah and Taif during Hajj time.<br>More than 3 million pilgrims perform the Hajj each year.<br>In 2020, the Hajj pilgrimage in Makkah (Mecca) is expected to fall between 28 July and 2 August."}, "Israel and the Palestinian Territories": {"country-iso": "IL", "name": "Israel and the Palestinian Territories", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>If you're travelling to Israel as a tourist for less than 3 months, you generally won't need a visa.<br>For longer stays, you'll need to arrange a visa before you travel.<br>Entry and exit conditions can change at short notice. For details about visas, security checks, currency, customs and quarantine regulations:<br>check the Israel Government Portal<br>contact the nearest embassy or consulate of Israel"}, "Djibouti": {"country-iso": "DJ", "name": "Djibouti", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>You need a visa to visit Djibouti. Check the official e-visa portal for information.<br>Entry and exit conditions can change at short notice. Contact the Embassy of Djibouti in Tokyo for details about visas, currency, customs and quarantine rules.<br><br>Other requirements<br>You may need a valid yellow fever vaccination certificate to enter Djibouti, especially if you're arriving from a country where yellow fever is common.<br>Countries with a risk of yellow fever (PDF 74KB)"}, "Ethiopia": {"country-iso": "ET", "name": "Ethiopia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You can only get a visitor visa on arrival if you enter Ethiopia via Bole International Airport in Addis Ababa. All other travellers must get a visa in advance.<br>For a business visa, you may need approval from the Ethiopian Department of Immigration and Nationality Affairs before applying to an embassy.<br>Embassy of the Federal Democratic Republic of Ethiopia<br>Visa conditions<br>Check your visa's expiry date. If you overstay your visa, there is a daily fine.<br>Entry and exit requirements can change at short notice. Contact the Ethiopian embassy for details about visas, currency, customs and quarantine rules."}, "Nepal": {"country-iso": "NP", "name": "Nepal", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to enter Nepal.<br>You can get a tourist visa when you arrive. A single-entry visa can be for 15, 30 or 90 days.<br>You need to pay a fee at Tribhuvan International Airport. You can pay it in major currencies. Land borders only accept US dollars.<br>Children aged under 10 years need a visa but aren't charged a fee.<br>In other situations, you need to get a visa before you travel.<br>Maximum stays<br>The maximum stay in Nepal on a tourist visa is 150 days per calendar year. This is regardless of the number of entries made or visa extensions received.<br>You may be able to extend your visa by applying to Nepal's Department of Immigration in Kathmandu.<br>Expired visas<br>You must have a valid visa in your passport to leave Nepal.<br>If your visa has expired, extend it at the Department of Immigration before you leave.<br>If you overstay your visa, authorities can detain you until you pay a fine. The amount of the fine is based on the number of days you overstayed.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Zimbabwe": {"country-iso": "ZW", "name": "Zimbabwe", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas and permits<br>You need a visa to enter Zimbabwe.<br>Most travellers, including tourists, can get either a 30-day visa on arrival or a KAZA UniVisa.<br>To extend a visa on arrival, apply online through the Department of Immigration or in person at its office. Allow enough time for an extension review.<br>You can also apply for a double-entry tourist visa, which is valid for 30 days from each date of entry.<br>A KAZA UniVisa allows multiple entries in a 30-day period:<br>between Zimbabwe and Zambia<br>to Botswana for day trips<br>You can get a KAZA UniVisa at:<br>Harare, Bulawayo and Victoria Falls airports<br>Victoria Falls land border (Zambia)<br>Kazungula land border (Zambia/Botswana)<br>A KAZA UniVisa can't be extended. Its availability can change at short notice.<br>Other visas and permits<br>You must apply for a permit, before arriving in Zimbabwe, to:<br>live<br>work<br>study<br>invest<br>do business<br>The Zimbabwe Chief Immigration Officer must approve the permit.<br>Be careful using local migration agents. It's better to get visas and work permits yourself.<br>To arrange a visa or work permit, apply:<br>on the Department of Immigration website<br>through your sponsor<br>at your nearest Zimbabwean Department of Immigration office<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Zimbabwe for details about visas, currency, customs and quarantine rules.<br>You could be jailed if you overstay your visa.<br>Your options for leaving Zimbabwe may be limited if security deteriorates quickly. Keep your documents up to date. You'll need a valid passport, visa, and vehicle police clearance if leaving via a land border."}, "Singapore": {"country-iso": "SG", "name": "Singapore", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You don't need a tourist or business visa to stay up to 90 days.<br>For work or study, you'll need to apply for a visa before you travel. Check work visa information with the Ministry of Manpower.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Singapore for details about visas, currency, customs and quarantine rules.<br>At immigration, you may have to show:<br>At the airport check-in counter, you may need to show the credit or debit card used to buy your ticket. If you don't, airline officials may not let you board. Contact your airline for details.<br>You need to scan your thumbprints each time you arrive and depart Singapore. Children aged younger than 6 years don't need to.<br>If you register your thumbprints on BioScreen at the immigration counter on arrival, you can use the self-clearance system for departure.<br>Medication<br>If you're carrying medication that's controlled in Singapore, you'll need an import permit to show on arrival. See Health"}, "Myanmar": {"country-iso": "MM", "name": "Myanmar", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to enter Myanmar. Entering without a visa can result in a prison sentence.<br>Entering without a visa can result in a prison sentence.<br>Visa applications<br>Apply for a visa at your closest Myanmar embassy before you travel.<br>If you're travelling for tourism or business, you can apply for an e-Visa online.<br>Apply for an e-Visa through the Ministry of Labour, Immigration and Population website. Print out the e-Visa approval letter for your arrival.<br>Print out the e-Visa approval letter for your arrival.<br>Use an e-Visa to enter Myanmar at:<br>Naypyidaw<br>You can't use e-Visas at seaports. Cruise passengers must arrange visas in advance.<br>Be aware of unauthorised websites that claim to offer e-Visas. Some websites will provide a genuine visa for an extra fee, but some others are fake.<br>Australians citizens can apply for a tourist visa on arrival at Yangon, Mandalay and Naypyitaw airports. Australians who were born in Myanmar are not eligible for visa on arrival.<br>Be careful about using links in emails or other websites to access the official site. To avoid a scam, use official Myanmar Government services to arrange your visa.<br>Visa offences<br>The local government strictly controls travel to parts of Myanmar, including through visa conditions. Authorities have deported or detained Australians for visa offences.<br>If you overstay your visa, authorities won't let you leave until you pay a fine. You might also be:<br>If you break other visa conditions, authorities could arrest or deport you.<br>Meet your visa conditions at all times.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Madagascar": {"country-iso": "MG", "name": "Madagascar", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa<br>You need a visa to enter Madagascar.<br>Get a tourist visa on arrival if you have proof of onward travel and you are planning to stay for a maximum period of 90 days.<br>In other situations, you'll need to apply for a visa before you travel.<br>Entry and exit conditions can change at short notice. Check with the nearest embassy or consulate of Madagascar for details about visas, currency, customs and quarantine rules."}, "Botswana": {"country-iso": "BW", "name": "Botswana", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You can get a tourist visa on arrival for stays of up to 90 days.<br>Botswana accepts Australian emergency passports. But, if you need to enter Botswana on an emergency passport, get a visa beforehand. You can't get one on arrival.<br>Apply at the nearest embassy or consulate of Botswana.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Bolivia": {"country-iso": "BO", "name": "Bolivia", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visa-free short stays<br>If you're visiting for less than 90 days, you don't need a visitor visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and other travel requirements.<br>Travel via the United States<br>If you're travelling through the US you must meet US entry or transit requirements.<br>Check your visa requirements with a US embassy or consulate well in advance of your travel.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Bolivia. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Travel with dual-national children<br>Unless travelling with both parents, dual nationals under the age of 18 years must:<br>Bolivian Immigration Service \nAvenida Camacho entre Calles Loayza y Bueno\nLa Paz, Bolivia\nPhone: (+591 2) 211 0960"}, "Mozambique": {"country-iso": "MZ", "name": "Mozambique", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>You'll need a visa to enter Mozambique.<br>You may be eligible for a visa when you arrive. However, some  travellers have had trouble getting a visa on arrival.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Tanzania": {"country-iso": "TZ", "name": "Tanzania", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>Tanzania is introducing an online visa application form. You need a visa to enter Tanzania.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Tanzania for details about visas, currency, customs and quarantine rules and the online visa application form.<br>Tanzania is very strict with enforcing visa rules.<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter Tanzania. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever."}, "Central African Republic": {"country-iso": "CF", "name": "Central African Republic", "advisory-text": "Do not travel", "visa-info": "<br>The Consulate-General of France in Sydney may be able to help you get your visas for the CAR.<br>Yellow fever<br>You may need a valid yellow fever vaccination certificate to enter the CAR.<br>To protect yourself and to avoid entry issues, get vaccinated for yellow fever before you travel. See Health<br>Find out about returning to Australia after exposure to yellow fever (Department of Health)."}, "Burundi": {"country-iso": "BI", "name": "Burundi", "advisory-text": "Do not travel", "visa-info": "<br>Visitor visas<br>If you plan to enter Burundi despite our advice, you'll need to get a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Burundi for details about visas, currency, customs and quarantine rules.<br>Burundi doesn't have diplomatic representation in Australia. The nearest embassy of Burundi is in Tokyo."}, "Maldives": {"country-iso": "MV", "name": "Maldives", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You can apply for a 30-day visa on arrival if:<br>your passport is valid for at least 6 months from date of entry<br>you have a valid ticket to depart the Maldives<br>you have enough funds to cover your stay, at least US$150 per day<br>you have a booking in a resort or hotel<br>In other situations, you need to get a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact the Department of Immigration and Emigration of the Republic of Maldives for details about visas, currency, customs and quarantine rules."}, "Zambia": {"country-iso": "ZM", "name": "Zambia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>You'll need a visa to enter Zambia.<br>If you're visiting for fewer than 90 days, you can get a 30-day 'KAZA visa' when you arrive. You can get a KAZA visa if you enter via:<br>Lusaka or Livingstone international airports<br>Livingstone land border with Zimbabwe<br>Kazungula land border with Botswana<br>You can use the KAZA visa:<br>to travel between Zambia and Zimbabwe<br>for day trips into Botswana<br>In other cases, you'll need to get a visa before you travel.<br>You're allowed two 30-day extensions on entry visas.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Permits and departure levy<br>If you plan to stay for more than 90 days, you'll need a National Registration Card.<br>To work in Zambia, including as a volunteer, you'll need a work permit. For more details please see Zambian Department of Immigration.<br>To work in Zambia, including as a volunteer, you'll need a work permit. For more details please see<br>.<br>To live in Zambia, you'll need a residence permit. For more details please see Zambia Immigration Zambian Department of Immigration.<br>To live in Zambia, you'll need a residence permit. For more details please see Zambia Immigration<br>If you don't comply with these or other immigration rules, authorities may detain you.<br>Some Zambian immigration agents may issue fake documents. Make proper checks before and after using a local agent to get a visa or permit.<br>If you fly within or out of Zambia, you'll need to pay the National Airports Corporation levy. The levy isn't often included in airline tickets. You'll have to pay the levy in US dollars or Zambian Kwacha.<br>Zambian Department of Immigration"}, "Eritrea": {"country-iso": "ER", "name": "Eritrea", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visa conditions<br>You'll need a visa to enter Eritrea.<br>Entry and exit requirements can change at short notice. Contact the nearest embassy of Eritrea for details about visas, currency, customs and quarantine rules."}, "Somalia": {"country-iso": "SO", "name": "Somalia", "advisory-text": "Do not travel", "visa-info": "<br>Visa conditions<br><br>Entry and exit requirements can change. Contact a consulate-general of Somalia for details about visas, currency, customs and quarantine rules.<br>Visa validity<br>Consulates-general and other diplomatic missions of Somalia have connections with the central government. However, the central government's authority isn't recognised everywhere.<br>Visas might not be valid in areas where the central government's authority is challenged.<br>Permanent Representative of the Somali Republic to the United Nations\n425 East 61st Street, Suite 702\nNew York, 10021, United States\nPhone: (+212) 688 9410/5046\nFax: (+212) 759 0651"}, "Fiji": {"country-iso": "FJ", "name": "Fiji", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Tourist visas<br>You don't need a tourist visa for Fiji. If your stay is less than 4 months, authorities will issue a visa when you arrive.<br>To get a visa on arrival, you must show proof of booked accommodation and a return ticket.<br>Other visas<br>You may need a visa if you travel for other reasons.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Fiji for details about visas, currency, customs and quarantine rules.<br>Fiji High Commission in Australia<br>Fiji Department of Immigration"}, "Ecuador": {"country-iso": "EC", "name": "Ecuador", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free short stays and visitor visas<br>Australian passport holders can stay in Ecuador for up to 90 days without a visa.<br>If you want to stay longer, you'll need a visa. If you overstay without a visa, you may be fined and barred from future visits.<br>Visa and other entry and exit conditions can change at short notice. This includes currency, customs and quarantine rules. Contact an embassy or consulate of Ecuador for details.<br>Travel to the Galapagos Islands<br>You can visit the Galapagos Islands for tourism for up to 60 days.<br>For visits other than tourism, you must get a visa or special permission from the local authority. You must do this before you arrive in Ecuador.<br>Travel via the United States<br>If you travel through the US, you must also meet US entry or transit requirements.<br>Check your visa requirements with an embassy or consulate of the United States. Do this well before you travel.<br>Travel advice for the US<br>Other requirements<br>Get your passport stamped on entry by land or sea. If it isn't stamped, you could face deportation or delays leaving Ecuador.<br>Children younger than 18 who travel alone or with 1 parent may need to present:<br>a letter of consent from non-travelling parents<br>a copy of their birth certificate<br>Both documents must be:<br>translated into Spanish<br>notarised by the Embassy of Ecuador in Australia<br>Advice for people travelling with children<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Ecuador. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Yellow fever risk and certification requirements"}, "Seychelles": {"country-iso": "SC", "name": "Seychelles", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You won't need a visa to enter the Seychelles as a tourist. You will receive a visitor's permit on arrival which can be extended to a maximum period of 6 months.<br>You may need to provide proof of your hotel booking when you arrive.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy for details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter the Seychelles if you're coming from a country with yellow fever."}, "Lesotho": {"country-iso": "LS", "name": "Lesotho", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>Tourists can visit Lesotho for up to 14 days without a visa.<br>For other visits, you'll need to apply for a visa in advance.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Mauritius": {"country-iso": "MU", "name": "Mauritius", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>If you're staying less than 60 days a 'free of charge' visa will be provided to you on arrival. For other types of visits, you'll need to apply for a visa prior to your travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Namibia": {"country-iso": "NA", "name": "Namibia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Tourists can visit for up to 3 months without a visa.<br>For other situations, you'll need to get a visa in advance.<br>Entry and exit conditions can change at short notice. Contact a consulate-general of Namibia or the Ministry of Home Affairs and Immigration for details about visas, currency, customs and quarantine rules.<br>Make sure the correct visa and entry period is stamped in your passport, even if you're transiting.<br>Check your visa before leaving the immigration counter.<br>You may be detained or fined if you don't follow visa or immigration requirements.<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter Namibia if you're arriving from a country where yellow fever occurs.<br>Other formalities<br>To prevent the spread of Ebola virus disease (EVD), passengers travelling from EVD-affected countries are screened on arrival.<br>Travel via South Africa<br>If you're travelling through South Africa, you must meet South African entry and transit requirements.<br>Travel with children<br>Children who aren't accompanied by one or both parents must carry:<br>The affidavit must be less than 3 months old and include:<br>If you don't have valid documents, authorities may deport you or stop you boarding your flight.<br>Check your documents meet these requirements with the nearest Namibian High Commission or Consulate."}, "Venezuela": {"country-iso": "VE", "name": "Venezuela", "advisory-text": "Do not travel", "visa-info": "<br>Visa-free travel for short stays<br>If you decide to travel to Venezuela despite our advice, you won't need a visa for tourist visits of less than 90 days. However, you'll need:<br>a passport valid for at least 6 months<br>proof of return or onward travel<br>You can be detained or deported if you don't comply with your visa conditions.<br>Ensure your visa status is up to date by contacting the Venezuelan migration department (Spanish).<br>Entry and exit conditions can change. Contact the nearest Venezuelan embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you're transiting via the USA, you must meet US entry and transit rules.<br>Check your visa requirements with the nearest US embassy or consulate well in advance of travel.<br>Travel advice for the US"}, "South Sudan": {"country-iso": "SS", "name": "South Sudan", "advisory-text": "Do not travel", "visa-info": "<br>Visa requirements<br>If, despite our advice, you plan to travel to South Sudan, you need to get a visa issued in advance. You won't be allowed to enter the country without one.<br>Entry and exit conditions can change at short notice. Contact the nearest South Sudanese embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter South Sudan.<br><br>Find out about returning to Australia after exposure to yellow fever."}, "Brunei Darussalam": {"country-iso": "BN", "name": "Brunei Darussalam", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Every country or territory decides who can enter or exit through its borders.<br>Make sure you meet all entry and exit conditions. If you don't, the Australian Government can’t help you.<br>Visa and other Entry and exit conditions can change at short notice. Contact the nearest Brunei High Commission or Brunei Ministry of Foreign Affairs for details about visas, currency, customs and quarantine rules.<br>You can get tourist visas on arrival for up to 30 days<br>You need to pay the visa fee in cash in either Brunei or Singapore dollars.<br>There's a money changer at the airport before the immigration control point. However, there are no ATMs or banking facilities.<br>Immigration regulations are strictly enforced and overstaying can attract physical punishments.<br>Check the entry stamp in your passport to confirm how long you can stay.<br>Monitor your immigration status and visa expiry date.<br>Brunei Department of Immigration and National Registration<br>Ministry of Foreign Affairs"}, "Uganda": {"country-iso": "UG", "name": "Uganda", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>You need a visa to visit Uganda.<br>The East African Community's EAC Tourist Visa allows travellers multiple entries to Kenya, Rwanda and Uganda for 90 days. Another option is to apply for a visa from the Government of Uganda. Apply for the EAC Tourist Visa or a Ugandan visa by using Uganda's online visa application.<br>The East African Community's EAC Tourist Visa allows travellers multiple entries to Kenya, Rwanda and Uganda for 90 days. Another option is to apply for a visa from the Government of Uganda. Apply for the EAC Tourist Visa or a Ugandan visa by using Uganda's<br>online visa application<br>.<br>Entry and exit conditions can change at short notice. Contact the nearest high commission or consulate for details about visas, currency, customs and quarantine rules.<br>Entry and exit conditions can change at short notice. Contact the nearest<br>high commission or consulate<br>for details about visas, currency, customs and quarantine rules.<br>You may need a valid yellow fever vaccination certificate to enter Uganda. Some airlines may want to see a certificate when you leave.<br>Find out about returning to Australia after exposure to yellow fever."}, "Rwanda": {"country-iso": "RW", "name": "Rwanda", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa<br>Get a 30-day tourist visa when you arrive. You'll have to pay a fee.<br>Entry and exit conditions can change at short notice. Contact the High Commission of Rwanda in Singapore for details about visas, currency, customs and quarantine rules.<br>You'll need a valid yellow fever vaccination certificate if you're arriving from a country with a risk of yellow fever."}, "Vietnam": {"country-iso": "VN", "name": "Vietnam", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>To enter Vietnam, you must have either:<br>Learn more about visa requirement (Vietnamese).<br>Apply for an e-visa through the Vietnamese Government's e-visa portal.<br>You can also apply for a tourist visa through the Vietnamese embassy’s website.<br>Costs and processes differ between these 2 websites.<br>Make sure you enter your details correctly when applying or you may have to pay a second fee when you arrive.<br>Print a copy of your application and bring it with you.<br>For stays longer than 30 days, apply for a visa directly from the embassy or consulate of Vietnam.<br>Complete the visa application form (Vietnamese) online.<br>Print it and take it to the nearest embassy or consulate of Vietnam.<br>If you arrive in Vietnam with a written approval letter for a visa to be issued on arrival, you need to pay the fee in cash.<br>If your visa expires or is no longer valid, you'll face delays and fines when leaving.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Vietnam for details about visas, currency, customs and quarantine rules.<br>Visa scams<br>Travellers have been scammed by private online visa services and travel agents.<br>Only apply for your visa through the Government of Vietnam’s official website or offices.<br>Vietnamese spouse or parent visas<br>If your spouse or parent is a Vietnamese national, you can apply for a visa exemption certificate.<br>The certificate is valid for 5 years and allows multiple entries into Vietnam for up to 6 months.<br>Changes to visa status and visa extensions<br>You can't change the status of your entry visa to any other visa type in Vietnam. For example, you can't change a tourist or spouse visa to a working visa.<br>To get a visa extension from the Vietnamese immigration authorities, your passport must have at least 6 months of validity left at the time of application. This includes extensions for overstaying your visa.<br>This requirement is subject to change.<br>Check with the nearest embassy or consulate of Vietnam for details."}, "United States of America": {"country-iso": "US", "name": "United States of America", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>The US has strict entry requirements for both tourists and transit passengers. US Customs and Border Protection officers won't let you enter if you don't comply.<br>If you're visiting for less than 90 days, you may be eligible to:<br>Otherwise, you'll need to get a visitor visa before you travel.<br>Visa and other entry and exit conditions can change at short notice, including currency, customs and quarantine rules. Contact an embassy or consulate of the United States for the latest details.<br>Visa-free travel for short stays<br>If you plan to visit for less than 90 days, you may be able to travel under the VWP. This includes travel to the US Virgin Islands and Puerto Rico.<br>You can’t enter the US under the VWP if you have:<br>Before travelling under the VWP, you must apply and be pre-approved via the ESTA.<br>US authorities recommend that you apply as soon as you know you'll be travelling. ESTA approvals can take at least 72 hours.<br>ESTAs are valid for 2 years and for multiple entries.<br>You’ll need to apply for a new ESTA if:<br>If there are differences between your ESTA, passport or ticket information, you could be:<br>If your ESTA application is denied, you’ll need to apply for a visitor visa from a US embassy or consulate.<br>US authorities generally won’t tell you why an ESTA application was rejected. You can't appeal the decision.<br>If you provide false or incorrect information on an ESTA, you may be permanently barred from travel to the US.<br>Visitor visas<br>If your ESTA application is denied or you're not eligible to travel under the VWP, or you intend to stay for more than 90 days, you’ll need to apply for a visa from a US embassy or consulate.<br>Depending on your reason for travel, you can apply for either:<br>There's a visa for every travel purpose.<br>Arrival and departure record (Form I-94)<br>When you arrive, US authorities will decide the date by which you must leave the country. This date may not be the same as the expiry date of your ESTA or visitor visa.<br>A US Customs and Border Protection official should:<br>Your I-94 is evidence of your legal status in the US. It shows the date when you must leave the country.<br>You can check your I-94 with the US Customs and Border Protection each time you enter the US.<br>If you stay past your I-94 expiry date, you can be detained, deported and barred from re-entering the US.<br>To extend your stay in the US, lodge a request with US Citizenship and Immigration Services (USCIS) on Form I-539 before your I-94 expires.<br>You can't extend or renew your I-94 by travelling to Canada, Mexico or the Caribbean for 30 days or less and then re-entering the US.<br>If you travel to Canada, Mexico or the Caribbean and return to the US while your I-94 is still valid, you'll be readmitted for the amount of time left on it.<br>If your I-94 has recently expired and US authorities think the purpose of your trip was only to extend your stay in the US, they can:<br>If you're issued a paper I-94 when you arrive at a land border, give it to the airline, cruise line or US Customs and Border Protection officials when you leave the US."}, "Uzbekistan": {"country-iso": "UZ", "name": "Uzbekistan", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>From 1 February 2019, Australians can enter Uzbekistan under a new visa-free arrangement. It covers single-entry stays of up to 30 days.<br>You'll still need a visa if you're staying for more than 30 days or need multiple entries.<br>Uzbek Ministry of Foreign Affairs<br>Visa rules<br>Entry and exit conditions can change at short notice. Contact the Embassy of Uzbekistan in Singapore (accredited to Australia) for details about visas and other travel requirements.<br>Uzbek visas specify validity, number of entries, and length of stay. Check your visa details when you get it.<br>The length of stay on your visa may differ from the length you asked for in your application.<br>Authorities may fine, detain or deport you if you:<br>arrive in the country before the visa validity period<br>overstay your visa"}, "Thailand": {"country-iso": "TH", "name": "Thailand", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Australian tourists can get a visa exemption for:<br>For longer stays, or if you're travelling other than for tourism, you'll need to apply for a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Thailand for details about visas, currency, customs and quarantine rules.<br>Visas overstays<br>If you overstay your visa, you'll need to pay a fine before you can leave. You can also be:<br>Thai authorities can blacklist you, which means you can never return to Thailand.<br>Penalties for not paying the fine include long prison sentences. Conditions at Immigration Detention Centres are harsh."}, "Uruguay": {"country-iso": "UY", "name": "Uruguay", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>Australian tourists can enter Uruguay without a visa for up to 90 days.<br>Entry and exit conditions can change. Contact the nearest embassy or consulate of Uruguay for details about visas, currency, customs and other travel requirements.<br>Travelling with children<br>Authorities may need to see a letter of consent if the child is:<br>aged under 18 years<br>travelling alone<br>travelling with 1 parent<br>Parents who aren't travelling with the child must sign the letter.<br>Contact the nearest embassy or consulate of Uruguay well before you travel for advice.<br>Advice for people travelling with children<br>Yellow fever vaccination<br>You don't have to be vaccinated for yellow fever to enter or exit Uruguay. However, it's needed for other countries in the region.<br>Find out about returning to Australia after exposure to yellow fever.<br>Countries with a risk of yellow fever (PDF 74KB)<br>Travel via the United States<br>If you're travelling through the US, you must meet US entry and transit rules.<br>Check your visa needs with the nearest embassy or consulate of the United States well before you travel.<br>Travel advice for the US"}, "Macau": {"country-iso": "MO", "name": "Macau", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>If you're visiting for tourism for less than 30 days, you generally won't need a visa. In other situations, you will.<br>Macau is a Special Administrative Region (SAR) of the People's Republic of China. It has separate visa and entry administration to Hong Kong and mainland China.<br>If you need a visa, apply for it through your nearest PRC embassy or consulate.<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and quarantine rules, contact or visit:<br>Macau Immigration Service<br>Macau Tourism"}, "North Korea (Democratic People's Republic of Korea)": {"country-iso": "KP", "name": "North Korea (Democratic People's Republic of Korea)", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>You need a visa for all types of travel to the North Korea.<br>If you arrive without a valid visa, you may be:<br>detained<br>arrested<br>fined<br>denied entry<br>There is no longer a North Korean embassy or consulate in Australia. This means you need to travel to another country, such as China, to get your visa for North Korea.<br>You may need to provide recent international travel itineraries to apply for a visa. You may also have to show these when you arrive in North Korea.<br>Other visas<br>Business travellers generally need:<br>sponsorship by a North Korean organisation<br>permission from the North Korean Ministry of Foreign Affairs<br>Professional journalists must apply for special permission to visit. Authorities won't let journalists enter the country on a tourist visa.<br>Entry and exit conditions change regularly. Contact the Embassy of the Democratic People's Republic of Korea in Indonesia for details about visas, currency, customs and quarantine rules."}, "Eswatini": {"country-iso": "SZ", "name": "Eswatini", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Tourists can enter Eswatini for up to 30 days without a visa.<br>For other types of visits, you'll need to get a visa in advance.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Eswatini Ministry of Home Affairs<br>Eswatini High Commission in South Africa"}, "Tajikistan": {"country-iso": "TJ", "name": "Tajikistan", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to visit Tajikistan, you can get this visa at either an embassy or consulate of Tajikistan or on arrival at the Dushanbe International Airport.<br>In both cases you must submit a visa application form online before you travel:<br>Ensure you have the correct visa type. If you plan to visit relatives or friends, you'll need to apply for a Private (XC1) visa. This is different from a Tourist (T) visa.<br>Tourist visas are valid for up to 45 days. You can't extend or replace your tourist visa. Make sure you leave the country before your visa expires.<br>Entry and exit conditions can change at short notice. For details about visas, customs and quarantine rules, contact:<br>If you are travel on any visa other than tourist (T) and staying in Tajikistan for more than 3 working days. You must register with the Passport Registration Service of the Ministry of Interior of Tajikistan.<br>Hotels will only register you for the duration of your hotel stay. If you change accommodation you will need to register again.<br>Travellers visiting Tajikistan for more than 90 days must do a health test.<br>You need a permit to visit GBAO.<br>Tajik embassies and consulates issue this permit. The permit is subject to the security situation in the neighbouring regions.<br>Apply at the Ministry of Foreign Affairs or Passport-Registration Service of the Ministry of Interior of Tajikistan.<br>Tajikistan's borders can close without notice.<br>Some border crossings may only be open to locals.<br>Ask local authorities which border crossings are open and if you can use them."}, "Malaysia": {"country-iso": "MY", "name": "Malaysia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Australian passport holders can get a 90-day tourism visa on arrival.<br>Arrange a visa before you travel if you're visiting for:<br>business<br>volunteer work<br>study<br>research<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>If you breach your visa conditions or overstay your visa, authorities may fine, detain or deport you.<br>Always check the correct dates are on the visa stamp placed in your passport.<br>Follow immigration rules, including your visa conditions."}, "United Arab Emirates": {"country-iso": "AE", "name": "United Arab Emirates", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Entry and exit conditions can change at short notice. Contact the nearest UAE Embassy or Consulate-General for details about visas, entry permits, currency, customs and quarantine rules.<br>You can get a free 30-day visitor visa when you arrive. You can extend this at a UAE immigration office for another 30 days. An extension costs AED600.<br>If you're visiting the UAE for business, you must apply for a different visa.<br>If you're travelling to the UAE on a diplomatic and official passport, you must have a visa before travelling."}, "Kenya": {"country-iso": "KE", "name": "Kenya", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to travel to Kenya. Kenya has an e-visa portal for tourists and other visitors.<br>Entry and exit requirements can change at short notice. Contact the Kenyan High Commission for details about visas, currency, customs and quarantine rules."}, "South Korea (Republic of Korea)": {"country-iso": "KR", "name": "South Korea (Republic of Korea)", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>For visits up to 90 days, you can get a visa when you arrive. If you're staying longer, you need a visa before you arrive.<br>Entry and exit conditions change regularly. Contact the nearest embassy or consulate of the Republic of Korea for details about visas, currency, customs and quarantine rules."}, "Bahrain": {"country-iso": "BH", "name": "Bahrain", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Every country or territory decides who can enter or exit through its border.<br>Make sure you meet all entry and exit conditions. If you don't, the Australian Government can't help you.<br>Entry and exit rules can change at short notice. Contact the Bahrain Ministry of Foreign Affairs for details about visas, currency, customs and quarantine rules.<br>You need a visa to enter Bahrain which can be obtained on-line.<br>There's no Bahraini embassy in Australia. The nearest embassy of Bahrain is in Jakarta, Indonesia."}, "Taiwan": {"country-iso": "TW", "name": "Taiwan", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You won't need a visa for Taiwan if you meet all these conditions:<br>In other situations, you'll need to get a visa before you travel.<br>Australians can use Taiwan's e-Gate service. To register for e-Gate, visit the e-Gate Enrolment Counters at the airport, located next to the e-Gate lanes at passport control. The registration is valid until six months prior to your passport's expiry date, until you renew your passport, or until you obtain an Alien Resident Card (ARC) in Taiwan. You will need then to register each trip online to use the gates. More information is available at https://egate.immigration.gov.tw/egate-frontend/aus<br>Working holiday makers (WHM) must apply for the WHM visa before arriving. WHM visas are also valid as a work permit.<br>Entry and exit conditions can change. Contact the Taipei Economic and Cultural Office (TECO) for details about visas, currency, customs and quarantine rules."}, "Laos": {"country-iso": "LA", "name": "Laos", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You need a visa to enter Laos.<br>If you're visiting Laos for tourism, you can get a 30-day tourist visa when you arrive at:<br>Check the full list of border checkpoints to confirm if visa on arrival is available where you plan to enter the country.<br>To apply, you need:<br>In other situations, you need to apply for a visa from an embassy of Laos before you travel.<br>If you're entering Laos through Wattay International Airport or by crossing the First Lao-Thai Friendship Bridge, you can apply for a visa online beforehand at Lao Official Online eVisa.<br>Lao immigration authorities will stop issuing on-arrival visas from the below border checkpoints from the following dates:<br>31 December 2019<br>31 March 2020<br>30 June 2020<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Some travellers go by road to Thailand to renew their Laos visa. Thailand limits this practice. Thailand will only grant 2 land entries per person per year.<br>This restriction doesn't apply to travellers who arrive through international airports.<br>Department of Immigration of Laos"}, "Belize": {"country-iso": "BZ", "name": "Belize", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visas<br>You need a visa to enter Belize.<br>If you're visiting as a tourist, you can get a tourist visa on arrival. This visa is valid for 1 month. To be eligible you must have:<br>If you stay more than 30 days in Belize, the local immigration office must re-stamp your passport. You must pay a fee.<br>If you're not visiting as a tourist, you need to apply for a visa before you arrive.<br>Entry and exit conditions can change. Contact the Consulate of Belize for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you're travelling through the US to Belize, you must also meet US entry or transit requirements.<br>Other requirements<br>The cost of your airline ticket usually includes an entry tax. You must pay a departure tax in cash.<br>You may need extra documents if only one parent or guardian is travelling with a child. Contact the Consulate of Belize to confirm this.<br>Yellow fever vaccination<br>All travellers over 1 year arriving or transiting countries with a risk of yellow fever need a valid yellow fever vaccination certificate to enter Belize. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever."}, "Democratic Republic of the Congo": {"country-iso": "CG", "name": "Democratic Republic of the Congo", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visa conditions<br>You'll need a visa before you enter the DRC. You can't get one on arrival.<br>Entry and exit conditions can change at short notice. You can contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>The closest embassy of the DRC (French/English/Japanese) is in Tokyo."}, "Switzerland": {"country-iso": "CH", "name": "Switzerland", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Switzerland is part of the Schengen area.<br>You can enter Switzerland without a visa if:<br>In other circumstances, you'll need a visa.<br>Make sure you get a clear entry stamp in your passport on arrival.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Switzerland for details about visas, currency, customs and quarantine rules."}, "Cuba": {"country-iso": "CU", "name": "Cuba", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You need a visa to enter Cuba.<br>If your visit is for tourism, you can get a 'tourist card' through:<br>The tourist card includes a tourist visa.<br>In other situations, you need to apply for a visa.<br>Entry and exit conditions change can at short notice. Contact an embassy or consulate of Cuba for details about visas, currency, customs and quarantine rules.<br>Other formalities<br>You must show proof of comprehensive travel insurance to enter.<br>You need to purchase extra insurance from Asistur, the Cuban insurance provider if you:<br>The list of duty-free items that you can take into Cuba is limited. If customs authorities consider any item is not for personal use, they can seize it. Equipment that draws heavily on electricity or uses satellite technology can also be confiscated.<br>Contact the nearest embassy or consulate of Cuba for details about official requirements for minors travelling without their parents.<br>A departure tax is included in the cost of your airline ticket."}, "Tunisia": {"country-iso": "TN", "name": "Tunisia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>If you're visiting Tunisia for 90 days or less, you may be eligible for a visa exemption.<br>For other types of travel, obtain a visa before you arrive.<br>Entry and exit conditions can change at short notice. You can contact the Embassy of Tunisia for the latest details."}, "Nicaragua": {"country-iso": "NI", "name": "Nicaragua", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist card (CA-4 visa)<br>You'll need to purchase a tourist card at the airport. This permits you to visit Nicaragua for up to 90 days.<br>Nicaragua is a member country to the Central American Border Control Agreement (CA-4), along with:<br>With a CA-4 tourist visa, you can travel freely by land between member countries within the 90-day period.<br>Your tourist card is dated from the first point of entry in any member country.<br>You can apply to extend the CA-4 visa before it expires at Nicaraguan Immigration (Spanish).<br>If you overstay the visa without an extension, you may be:<br>If you're not a tourist or you plan to stay longer, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the Nicaraguan Embassy in Japan for details about visas, currency, customs and quarantine rules."}, "Cambodia": {"country-iso": "KH", "name": "Cambodia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You need a visa to visit Cambodia.<br>If you're travelling to Cambodia for tourism, you can apply for an e-visa online. Do this through the Cambodian Ministry of Foreign Affairs and International Cooperation.<br>E-visas are only valid for entry through:<br>Tourist visas are available on arrival.<br>Tourist visas are valid for 30 days. For longer stays, or if you're not travelling for tourism, you need to get a visa through an embassy or consulate of Cambodia.<br>Day trips aren't allowed, except when travelling via Phnom Penh International Airport.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Cambodia for details about visas, currency, customs and quarantine rules."}, "Canada": {"country-iso": "CA", "name": "Canada", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>Australian passport holders must apply for an electronic travel authorisation (eTA) before travelling to Canada by air.<br>Australian passport holders must apply for<br>If you  arrive by car, bus, train, or boat you don’t need an ETA or a visitor visa, but you do need to bring the right travel documents.<br>If you overstay your visa, you may be detained or arrested.<br>If you have a criminal record, including a drink-driving conviction, you may not be allowed into Canada. Check Government of Canada for details.<br>Entry and exit conditions can change. Contact a Canadian embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you're travelling through the US, you must meet US entry and transit requirements. Check with an embassy or consulate of the United States.<br>Travel with children<br>If you're travelling with children or pets or bringing goods into Canada, you may need documentation. Check with the Canada Border Services Agency (CBSA).<br>Your child should carry a consent letter from non-travelling parents or guardians if they're travelling:<br>CBSA may question the child or accompanying adult about their status."}, "Timor-Leste": {"country-iso": "TL", "name": "Timor-Leste", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You can get a 30-day visa when you arrive, if you're both:<br>visiting as a tourist, and<br>arriving via Nicolau Lobato International Airport or Dili Seaport<br>You have to pay for a visa on arrival in US dollars. There are no money exchange facilities at the airport.<br>If you enter at another location or by land, you need to get a visa before you arrive.<br>If you can give a valid reason for extending your stay past 30 days, immigration authorities may let you extend your visa.<br>Apply to the Immigration Department at Vila Verde in Dili to extend your visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate or Timor-Leste Immigration for details about visas, currency, customs and quarantine rules."}, "Russia": {"country-iso": "RU", "name": "Russia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to enter Russia unless you're travelling on certain commercial cruise ships.<br>You can't get a visa on arrival.<br>If you arrive in Russia without a valid visa, authorities will fine, detain and deport you at your own expense. They may bar you from re-entering Russia.<br>Make sure you apply for the correct visa type, such as 'tourist' and 'visitor' visas.<br>If your visa type doesn't match the purpose of your visit, authorities may:<br>You may need to provide biometric fingerprints as part of the visa application process.<br>After you get your Russian visa, check your passport details are correct, including:<br>If there are errors, return your passport to the Russian Embassy or Consulate for correction.<br>It's impossible to amend visa details once you're in Russia.<br>Cruises<br>You may be eligible for visa-free entry if you arrive by a commercial cruise ship:<br>Visa-free entry lets you you leave the ship for short periods as part of an officially recognised tour.<br>Discuss your travel plans with your cruise operator before you travel to check if you need a visa.<br>If you transit through Russia on the way to a third country, check transit visa requirements.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Cyprus": {"country-iso": "CY", "name": "Cyprus", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>You don't need a tourist visa to visit Cyprus for stays of up to 90 days in a 6-month period.<br>If you plan to stay longer, you need to apply for a visa. An application can be made in-country.<br>If you overstay your visa, officials may charge you with breaching immigration rules.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Ministry of Foreign Affairs (Cyprus)<br>Ministry of Interior (Cyprus)"}, "Portugal": {"country-iso": "PT", "name": "Portugal", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Portugal is part of the Schengen area. This allows you to enter Portugal without a visa in some circumstances.<br>In other situations, you'll need a visa.<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and other travel requirements, contact:"}, "El Salvador": {"country-iso": "SV", "name": "El Salvador", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist card (CA-4 visa)<br>You'll need to purchase a tourist card at the airport. This permits you to visit El Salvador for up to 90 days.<br>El Salvador is a member country to the Central American Border Control Agreement (CA-4), along with:<br>Guatemala<br>Honduras<br>Nicaragua<br>With a CA-4 tourist visa, you can travel freely by land between member countries within the 90-day period.<br>Your tourist card is dated from the first point of entry in any member country.<br>You can apply to extend the CA-4 visa before it expires at Centro de Gobierno in San Salvador. Call (+503) 2221 2111.<br>If you overstay the visa without an extension, you may be:<br>fined<br>forced to leave<br>unable to enter other CA-4 member countries<br>If you're not a tourist or you plan to stay longer, you'll need a visa.<br>Entry and exit conditions can change. Contact the embassy or consulate of El Salvador for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you’re travelling through the US, you must also meet US entry or transit requirements.<br>Travel advice for the US<br>Travel via Canada<br>If you're travelling via Canada, you'll need an eTA (Electronic Travel Authorisation) for Canada.<br>Travel advice for Canada<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter El Salvador. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Countries with a risk of yellow fever (PDF 74KB)<br>Travel with children<br>If you're travelling with children, you may need to show proof of your legal relationship. This could be as a parent, custodian or someone with access rights.<br>A child travelling on a Salvadoran passport without 1 or both parents must have written consent from the absent parents to leave the country. A Salvadoran notary must sign these documents."}, "Peru": {"country-iso": "PE", "name": "Peru", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visas<br>Tourists don't need a visa. You can get a permit to stay for up to 6 months when you arrive.<br><br>In other situations, you'll need to apply for a visa through an embassy or consulate of Peru.<br>Entry and exit conditions can change at short notice. You can contact the nearest embassy or consulate of Peru for the latest details. They'll tell you about visas, currency, customs and other travel requirements.<br>Entry stamp<br>You must get an entry stamp in your passport when you arrive. This is the case even at land borders where immigration offices are hard to find or not always open.<br>If you don't get an entry stamp on entry, you'll need to apply for one from the National Superintendent of Immigration in Lima immediately. This process could take several weeks.<br>If officials decide not give you an entry stamp, you'll have to apply for an expulsion order before being allowed to leave. This could also take several weeks. You may be fined and barred from entering Peru for up to 5 years.<br><br>Only cross the border at official checkpoints. Make sure you get an exit stamp from the country you're leaving.<br><br>Travel via the United States<br>If you're travelling through the US, you must meet US entry and transit requirements.<br>Check your visa requirements with a US embassy or consulate well in advance of your travel.<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Peru. Some airlines may want to see one when you leave.<br><br>If you've visited Peru in the previous 6 days, you'll need a valid certificate to enter Australia.<br>Find out about returning to Australia after exposure to yellow fever."}, "Brazil": {"country-iso": "BR", "name": "Brazil", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You don't need a visa to enter Brazil for:<br>You can stay in Brazil for 90 days over a 12-month period. This will be counted from the date of your first entry to Brazil. You can also extend your stay for another 90 days.<br>In other cases, apply for your visa through an embassy or consulate of Brazil.<br>If you plan to live in Brazil, you'll need to get a visa before arrival. The Brazilian Government strongly enforces immigration and entry laws.<br>If you need a visa and arrive without one, authorities will send you back on the next available flight.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Brazil for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you travel through the US, you must meet US entry and transit requirements.<br>Check with your nearest embassy or consulate of the United States for visa requirements before you travel."}, "Honduras": {"country-iso": "HN", "name": "Honduras", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist card (CA-4 visa)<br>You'll need to purchase a tourist card at the airport. This permits you to visit Honduras for up to 90 days.<br>Honduras is a member country to the Central American Border Control Agreement (CA-4), along with:<br>El Salvador<br>Guatemala<br>Nicaragua<br>With a CA-4 tourist visa, you can travel freely by land between member countries within the 90-day period.<br>Your tourist card is dated from the first point of entry in any member country.<br>You can apply to extend the CA-4 visa before it expires at the National Institute of Migration (Spanish).<br>If you're not a tourist or you plan to stay longer, you'll need a visa.<br>Entry and exit conditions can change. Contact an embassy or consulate of Honduras for details about visas, currency, customs and quarantine rules."}, "Ireland": {"country-iso": "IE", "name": "Ireland", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You don't need a visa for tourist visits of less than 90 days.<br>When you arrive, immigration authorities may ask for details of your:<br>accommodation bookings<br>return flights<br>contacts in Ireland<br>If they don't believe you're a genuine tourist, they may:<br>refuse to let you enter<br>give you a limited-stay visa<br>For longer visits, or if you want to work or study, you'll need a visa. You'll need to apply for your visa before you leave Australia.<br>Ireland isn't a part of the Schengen area and doesn't accept Schengen visas.<br>Entry and exit requirements can change at short notice. For details about visas, customs and quarantine conditions, contact either:<br>Irish Naturalisation and Immigration Service<br>an embassy or consulate of Ireland"}, "Latvia": {"country-iso": "LV", "name": "Latvia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Latvia is part of the Schengen area, along with many other European countries. You can enter Latvia without a visa in some cases.<br>Monitor border conditions by:<br>checking local news sources<br>asking transport providers directly<br>Entry and exit conditions can change at short notice. These include visas, currency, customs and quarantine rules.<br>Latvia doesn't have an embassy in Australia. If you do need a visa, you can apply for it through the Austrian Embassy in Canberra."}, "Finland": {"country-iso": "FI", "name": "Finland", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>​Finland, along with other European countries, is part of the Schengen area. In some situations, this lets you enter Finland without a visa.<br>Check border conditions by monitoring local news and asking transport providers.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Finland for details about visas, currency, customs and quarantine rules."}, "Norway": {"country-iso": "NO", "name": "Norway", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>Norway is part of the Schengen area, along with many other European countries. You may be able to enter Norway without a tourist visa. In other situations, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Norway for details about visas, currency, customs and quarantine rules.<br>Travel via Svalbard<br>The Norwegian territory of Svalbard is not part of the Schengen area.<br>If you're travelling to Svalbard, you'll need a valid passport to enter.<br>You also need to meet Schengen area entry requirements when returning to Norway's mainland."}, "Mauritania": {"country-iso": "MR", "name": "Mauritania", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visa conditions<br>You can get a visa on arrival. You must show your hotel booking or a letter from your local host. If you're travelling for business, you must have a letter of invitation.<br>Entry and exit conditions may change. Contact the nearest Embassy of Mauritania for details about visas, currency, customs and quarantine rules."}, "Panama": {"country-iso": "PA", "name": "Panama", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>If you arrive by air or land, you won't need a visa. You'll be granted an initial stay of 180 days when you arrive.<br>To enter, you'll need to show proof of:<br>If you’re transiting on a cruise ship and Panama is a port of call, you won’t need a visa. An immigration official will stamp your passport and you will be granted a stay of up to 90 days<br>If you arrive by another type of boat, you'll need a visa.<br>Entry and exit conditions can change. Contact the nearest Panamanian embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you’re travelling through the US, you must meet US entry or transit requirements. This includes transit through Hawaii.<br>Check your visa requirements with an embassy or consulate of the United States before you travel.<br>Travel via Canada<br>If you're travelling through Canada, you'll need an eTA (Electronic Travel Authorisation) for Canada. Check your visa requirements with either:"}, "Estonia": {"country-iso": "EE", "name": "Estonia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>Estonia is part of the Schengen area. In some cases, you can enter Estonia without a visa. In other situations, you'll need a visa.<br>Check the Schengen Convention before you leave Australia.<br>Get an entry stamp in your passport from border control staff when you first enter the Schengen area.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Morocco": {"country-iso": "MA", "name": "Morocco", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You won't need a visa to visit Morocco for less than 3 months.<br>In other situations, you'll need a visa.<br>Entry and exit conditions can change at short notice. You can contact the Embassy of Morocco for the latest details. They will tell you about visas, currency, customs and other travel requirements.<br>Passport stamps<br>Some tourists report having trouble leaving the country without a stamp in their passport.<br>Get your passport stamped when you enter Morocco.<br>Closed borders<br>The land border between Morocco and Algeria is closed.<br>Don't attempt to cross into Algeria by land."}, "Chad": {"country-iso": "TD", "name": "Chad", "advisory-text": "Do not travel", "visa-info": "<br>Visa conditions<br>You'll need a visa to visit Chad.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Chad for details about visas, currency, customs and quarantine rules.<br>The Chadian embassy accredited to Australia is in Beijing, China.<br>Embassy of Chad in Beijing\nTayuan Diplomatic Building\nNo. 1 Xin Dong Lu\nBeijing, China\nPhone: +86 10 8532 3822\nEmail: ambatchad.beijing@yahoo.fr<br>Tayuan Diplomatic Building<br>No. 1 Xin Dong Lu<br>Beijing, China<br>8532 3822<br>Email: ambatchad.beijing@yahoo.fr<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Chad. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Land borders<br>Borders may close without warning.<br>In May 2014, authorities closed the border between Chad and the Central African Republic (CAR) until further notice. Only returning Chadian citizens can cross.<br>In 2017, the border with Libya also closed except for one crossing point.<br>We recommend against travel to either CAR or Libya."}, "Libya": {"country-iso": "LY", "name": "Libya", "advisory-text": "Do not travel", "visa-info": "<br>Visa conditions<br>If, despite our advice, you decide to travel to Libya, you need a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and other travel requirements."}, "Trinidad & Tobago": {"country-iso": "", "name": "Trinidad & Tobago", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You don't need a visa if your visit is for tourism. However, you'll need to pay a visa waiver fee to Immigration Services when you arrive. You can pay the fee in cash in Trinidad and Tobago dollars or US dollars.<br>If your visit is for other reasons, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the High Commission, Embassy or Consulate of Trinidad and Tobago for details about visas, currency, customs and quarantine rules.<br>Trinidad and Tobago doesn't have a an embassy or consulate in Australia. Its nearest mission is the Embassy of the Republic of Trinidad and Tobago in Beijing, China.<br>Travel via the United States<br>If you travel to Trinidad and Tobago through the US, you must meet US entry and transit requirements.<br>Check your visa requirements with a US embassy or consulate well before you travel.<br>Other requirements<br>You need a yellow fever vaccination certificate for every traveller over 1 year of age if you've come from or transited a country with a risk of yellow fever transmission.<br>Find out about returning to Australia after exposure to yellow fever."}, "Pakistan": {"country-iso": "PK", "name": "Pakistan", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visa conditions<br>You'll need a visa to enter Pakistan.<br>Entry and exit conditions can change at short notice. Contact the Pakistan High Commission for details about visas, currency, customs and other travel requirements.<br>To exit Pakistan, you must have either:<br>Authorities may stop you from boarding your flight if your visa has expired. You could also face heavy penalties, including fines and detention.<br>Take care not to overstay your visa.<br>If your visa has expired, contact the Ministry of Interior to get an exit visa.<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Pakistan from a country with yellow fever.<br>Travel with children<br>If a child travels unaccompanied, or with only 1 parent or guardian, local immigration authorities may ask for either:<br>This is particularly the case if the child is of Pakistani origin.<br>Local registration<br>Some provinces and cities require you to register with local authorities when you arrive.<br>Check and follow local registration procedures."}, "Kazakhstan": {"country-iso": "KZ", "name": "Kazakhstan", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>Before you travel:<br>check the dates your visa is valid<br>any rules or restrictions<br>You won't need a visa to stay for up to 30 days.<br>You must register at the local Migration Police office if you plan to stay longer than 3 months. You may also need to register if you enter through a land or sea border.<br>For longer stays, you'll need to get a visa before you travel. Get a visa that matches the purpose of your visit.<br>If you overstay your visa or breach your visa conditions, authorities may fine, jail or deport you.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Kazakhstan for details about visas, currency, customs and quarantine rules."}, "Sudan": {"country-iso": "SD", "name": "Sudan", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>You need a visa to enter Sudan.<br>Getting a visa can take several months. Visas are not granted automatically.<br>Visitors on a single entry visa need to obtain an exit visa to leave the country. However, this is not always enforced. You can get an exit visa at the airport. You should be ready to show proof of your sponsor and pay the exit visa fee. Visa and other entry and exit conditions can change at short notice. This includes currency, customs and quarantine.<br>Contact an Embassy of Sudan for details.<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Sudan. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever (Department of Health).<br>Other entry requirements<br>If your passport has an Israeli visa or Israeli entry/exit stamps you won’t be allowed to enter Sudan. This can happen even if you have a valid Sudanese visa.<br>Register with the Aliens Registration Office, Ministry of the Interior, west of the presidential palace, within three days of arrival in Khartoum. You’ll need at least two passport size photos. If you don’t register within three days of arrival, you may be fined. Some of the larger hotels will do this for you, but you should ask when you check-in.<br>Carry photo identification with you at all times.<br>Sudanese law prevents women and their children from leaving Sudan without the consent of the children's father. This applies regardless of nationality.<br>This can apply even if a Sudanese, Australian or other court has granted the mother custodial rights.<br>Airport departure taxes apply.<br>Border crossings<br>Land borders between Sudan and many countries are effectively closed.<br>The Wadi Halfa ferry through Lake Nasser between Egypt and Sudan is open but can close without notice.<br>Check with local authorities on the rules and regulations governing this crossing.<br>The status of land borders between Sudan and South Sudan often change without notice."}, "Italy": {"country-iso": "IT", "name": "Italy", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>Italy is part of the Schengen area with many other European countries. This means you can enter Italy without a visa in some cases.<br>In other situations, get a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Italian Police"}, "Moldova": {"country-iso": "MD", "name": "Moldova", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>If you're visiting for up to 90 days within a 6-month period, you won't need a visa.<br>For longer stays, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Moldova, or visit the Moldova Government website for details. They'll tell you about visas, currency, customs and quarantine rules.<br>Record your entry date, and where applicable, check your visa dates carefully. If you overstay your visa, authorities may deport you."}, "Malawi": {"country-iso": "MW", "name": "Malawi", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>You need a visa to enter Malawi.<br>Visas can be attained upon entry to Malawi. More information on visas and fees can be found at the Malawi Department of Immigration and Citizenship Services website.<br>If you can't apply in Australia, contact the Malawi Embassy in Tokyo for up-to-date information.<br>You can't enter Malawi on a tourist visa and then take part in other activities such as business or volunteer work. Immigration officials may fine, arrest or deport you.<br>Get the right visa and meet all visa conditions."}, "Mongolia": {"country-iso": "MN", "name": "Mongolia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You need a visa to enter Mongolia.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Guatemala": {"country-iso": "GT", "name": "Guatemala", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist card (CA-4 visa)<br>You'll need to purchase a tourist card at the airport. This permits you to visit Guatemala for up to 90 days.<br>Guatemala is a member country to the Central American Border Control Agreement (CA-4), along with:<br>El Salvador<br>Honduras<br>Nicaragua<br>With a CA-4 tourist visa, you can travel freely by land between member countries within the 90-day period.<br>Your tourist card is dated from the first point of entry in any member country.<br>You can apply to extend the CA-4 visa before it expires at the local immigration office.<br>If you're not a tourist or you plan to stay longer, you'll need a visa.<br>Entry and exit conditions can change. Contact an embassy or consulate of Guatemala for details about visas, currency, customs and quarantine rules."}, "Jamaica": {"country-iso": "JM", "name": "Jamaica", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You won't need a visa to enter Jamaica if your visit is for either:<br>tourism and you'll stay for less than 6 months<br>business and you'll stay for less than 30 days<br>In other situations, apply for a visa through a Jamaican embassy or consulate.<br>Visa and other entry and exit conditions, such as customs and quarantine regulations, can change at short notice. Contact a Jamaican embassy for details.<br>Jamaica doesn't have an embassy or consulate in Australia. Its nearest mission is the Embassy of Jamaica in Tokyo (Japanese).<br>Travel via the United States<br>If you're travelling through the US, you must also meet US entry and transit requirements. This includes transit through Hawaii or another US point of entry.<br>Check your visa requirements with a US embassy or consulate well before you travel.<br>Travel advice for the US"}, "Poland": {"country-iso": "PL", "name": "Poland", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Poland is a part of the Schengen area. This means you can enter Poland without a visa in some cases.<br>In other situations, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Poland for details about visas, currency, customs and quarantine rules."}, "Angola": {"country-iso": "AO", "name": "Angola", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>You need a visa to visit Angola as a tourist.<br>Apply for a visa online with Angola's Serviço de Migração. You can't get a tourist visa on arrival without pre-approval before your visit.<br>In other situations, you'll need a visa too. Contact an Angolan embassy or consulate to arrange it.<br>Renewing a visa can take at least 10 weeks. While you wait, Angolan authorities will keep your passport. You won't be able to travel. Plan ahead to avoid complications.<br>Penalties for visa offences include fines, detention and deportation.<br>Entry and exit conditions can change. Contact an Angolan embassy or consulate for details about visas, currency, customs and quarantine rues.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Angola. Some airlines want to see one when you leave.<br>Check yellow fever requirements for other countries you are visiting.<br>Find out about returning to Australia after exposure to yellow fever.<br>Travel via South Africa<br>If you're travelling through South Africa, you must meet South African entry and transit requirements.<br>South Africa has specific requirements for:<br>It won't accept provisional travel documents, such as 1-page travel documents."}, "Haiti": {"country-iso": "HT", "name": "Haiti", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visa requirements<br>Entry and exit conditions can change at short notice. Contact your nearest embassy or the Consulate of Haiti for details about visas, currency, customs and quarantine rules.<br>Other requirements<br>You'll need to pay an arrival fee at Toussaint Louverture International Airport.<br>Some people don't have to pay the fee:<br>child aged under 5 years<br>official or diplomatic passport holder<br>foreigner with a valid residence card<br>official or agent on a United Nations laissez-passer<br>a person born in Haiti who holds a foreign passport<br>Visitors who cross the land border from the Dominican Republic must pay a tourist fee. You must pay cash in US dollars.<br>If you plan to do volunteer work in Haiti, arrange a placement before you arrive. You'll be unlikely to find a placement when you get there.<br>Travel via the United States<br>If you’re travelling to Haiti through the US, you must also meet US entry or transit requirements.<br>Check your visa requirements with a US embassy or consulate well before you travel.<br>Travel advice for the US<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Haiti. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Countries with a risk of yellow fever (PDF 74KB)"}, "Dominican Republic": {"country-iso": "DO", "name": "Dominican Republic", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist cards<br>You must buy a tourist card on arrival. It's valid for 30 days. For longer visits, you must pay an extra fee at the airport on departure.<br>Rules affecting travellers can change at short notice.<br><br>Entry and exit conditions can change at short notice. Contact the Consulate of the Dominican Republic for details about visas, currency, customs and quarantine rules.<br>Travel with children<br>Strict exit requirements apply to children aged under 18 years who travel:<br>alone<br>with a parent<br>with another adult<br>Ask about the regulations before you travel. Contact the Consulate of the Dominican Republic.<br>Advice for people travelling with children<br>Departure tax<br>A departure tax applies for visits of up to 2 weeks.<br>It might be included in the price of your airline ticket. Confirm with your travel agent or airline.<br>You'll need to pay extra departure tax for stays of longer than 2 weeks.<br>Travel via the United States<br>If you’re travelling through the US, you must meet US entry or transit requirements. Contact your nearest US embassy or US consulate before you travel.<br>Travel advice for the US<br>Travel via Canada<br>If you're travelling via Canada, you'll need an eTA (Electronic Travel Authorisation) for Canada.<br>Find out more before you travel. Check your requirements with the High Commission of Canada.<br>Travel advice for Canada"}, "Guinea": {"country-iso": "GN", "name": "Guinea", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Entry and exit conditions can change at short notice. Contact an Embassy of the Republic of Guinea for details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter Guinea. Some airlines may want to see one when you leave.<br>You may need a valid yellow fever vaccination certificate to travel to other countries after visiting Guinea.<br>Find out about returning to Australia after exposure to yellow fever (Department of Health).<br>Countries with a risk of yellow fever (PDF 74KB) (World Health Organization)"}, "Germany": {"country-iso": "DE", "name": "Germany", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Germany is a part of the Schengen area. This means you can enter Germany without a visa in some cases.<br>In other situations, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest German embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Gabon": {"country-iso": "GA", "name": "Gabon", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>You need a visa to enter Gabon.<br>Gabon doesn't have an embassy or consulate in Australia. Gabon's nearest embassy is in Tokyo.<br>Entry and exit conditions can change at short notice. You can contact the nearest embassy or consulate for the latest details. They'll tell you about visas, currency, customs and other travel requirements.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Gabon. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Countries with a risk of yellow fever (PDF 74KB)<br>Cholera vaccination<br>You need to show proof that you've been vaccinated against cholera.<br>If you don't have proof, you may need to pay to have a vaccine on arrival."}, "The Bahamas": {"country-iso": "BS", "name": "The Bahamas", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You won't need a visa to enter The Bahamas if:<br>In other situations, you might need to get a visa before you travel.<br>Entry and exit conditions can change. Contact an embassy or consulate of The Bahamas for details about visas, currency, customs and quarantine rules.<br>The Bahamas doesn't have an embassy or consulate in Australia. Its nearest mission is the Embassy of the Commonwealth of The Bahamas in Beijing, China. Call +86 10 6532 2922.<br>Other requirements<br>You must complete and sign an immigration card when you enter The Bahamas. Officials will stamp your card when you enter.<br>Keep your immigration card until you leave.<br>If you arrive by private charter, you'll need entry documentation.<br>All visitors leaving The Bahamas need to pay a departure tax. This might not be included in the price of your ticket.<br>Travel via the United States<br>If you're travelling through the US, you'll need to meet US entry or transit requirements. This also applies if you're transiting through the US.<br>Check your visa requirements with a US embassy or US consulate well before you travel."}, "Lithuania": {"country-iso": "LT", "name": "Lithuania", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Lithuania is part of the Schengen area, which allows you to enter without a visa in some cases.<br>Entry and exit conditions can change at short notice. Contact the nearest Lithuanian embassy or consulate for details about visas, currency, customs and quarantine rules.<br>You will require a Russian visa for entry via the Curonian Spit and travellers should be aware of visa requirements when entering or departing through Belarus. Visa requirements for Belarus differ depending whether travel is by air or road."}, "France": {"country-iso": "FR", "name": "France", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of France for details about visas, currency, customs and quarantine rules.<br>France is part of the Schengen area. This means you can enter France without a visa in some cases. In other situations, you need a visa.<br>Get a visa from French authorities in Australia if you're travelling for either:<br>reasons other than tourism, or<br>more than 90 days<br>You can't apply for a visa or change your visa status once you're inside French territory. For example, you can't change from a tourist visa to a student or resident visa."}, "Czech Republic": {"country-iso": "CZ", "name": "Czech Republic", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>The Czech Republic is a part of the Schengen area, along with many other European states. This may allow you to enter the Czech Republic without a visa in some situations, such as short tourism stays.<br>Otherwise, you'll need to get a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of the Czech Republic for details about visas, currency, customs and quarantine rules."}, "Mexico": {"country-iso": "MX", "name": "Mexico", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>If you're visiting for 180 days or less, you generally won't need a visa.<br>To avoid being detained or deported, you'll need to:<br>fill in a Multiple Immigration Form (FMM)<br>make sure your passport is stamped by immigration officials on arrival<br>You can complete the FMM online before you arrive, or on arrival.<br>If you're entering by road, you can get the form at the immigration office (Instituto Nacional de Migración: Spanish). This is usually located near, not directly at, a border crossing.<br>Present your completed FMM for inspection at immigration if entering by air. Keep the form safe. You'll need to show it when you leave Mexico.<br>Information on other customs and import requirements are available from the Mexican government.<br>Entry and exit conditions can change at short notice. Contact the Embassy of Mexico for details about visas, customs, currency and quarantine rules.<br>Other travel requirements<br>Mexico charges all visitors an immigration fee.<br>If you arrive on a commercial flight, the cost of your ticket includes the fee.<br>If you enter by land, the immigration office will arrange for you to pay the fee at a nearby bank. There's no exit tax.<br>A child aged under 18 years departing alone, or with anyone other than their parent or legal guardian, must carry their notarised consent.<br>Minors with Mexican dual nationality or residency will need a specific form (SAM). Contact the Embassy of Mexico to get the form.<br>You may need a permit if you arrive in Mexico by motor vehicle. Check with the Embassy of Mexico before you travel.<br>Advice for people travelling with children<br>Travel via the United States<br>If you travel through the US, you must meet US entry or transit requirements. Check with your nearest US embassy or consulate.<br>transit requirements. Check with your nearest<br>.<br>Travel advice for the US"}, "Algeria": {"country-iso": "DZ", "name": "Algeria", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visitor visas<br>You'll need a visa to enter Algeria.<br>Only tourists arriving and departing by cruise ship can get visas on arrival. All other travellers must have a visa in advance.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Algeria if you arrive from a country where yellow fever is endemic.<br>This rule doesn't apply to children younger than 12 months."}, "Costa Rica": {"country-iso": "CR", "name": "Costa Rica", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>On an Australian passport, you don't need a visa for a tourist visit of less than 90 days.<br>You might be refused entry if you can't show that you'll return home or travel onwards.<br>Entry and exit conditions can change. Contact the Embassy of Costa Rica for details about visas, currency, customs and quarantine rules.<br>Travel via the United States<br>If you’re travelling through the US, you must also meet US entry or transit requirements.<br>Travel via Canada<br>If you're travelling via Canada, you'll need an eTA (Electronic Travel Authorisation) for Canada.<br>Travel with children<br>You may require extra documents if only one parent or guardian is travelling with a child.<br>Dual-national Australian and Costa Rican children need notarised written consent from both parents to leave the country. Contact the Embassy of Costa Rica to confirm this.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Costa Rica. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br><br>Other requirements<br>You must pay a departure tax to leave Costa Rica. This might be included in your airline ticket.<br>At airports, you can pay with US dollars or Costa Rican Colones (CRC), in cash or by credit card.<br>At other border crossings, you can pay at Bancredito kiosks."}, "Mali": {"country-iso": "ML", "name": "Mali", "advisory-text": "Do not travel", "visa-info": "<br>Visitor visas<br>If you decide to travel to Mali despite our advice, you'll need to get a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy of Mali for details about visas, currency, customs and quarantine rules."}, "Egypt": {"country-iso": "EG", "name": "Egypt", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visitor visas<br>Australians can get a tourist visa online at www.visa2egypt.gov.eg or on arrival.<br>You can only pay for visas with US dollars or euros. You can't pay for tourist visas with Egyptian pounds.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Egypt for the latest details. They'll tell you about visas, currency, customs and quarantine rules."}, "Sierra Leone": {"country-iso": "SL", "name": "Sierra Leone", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>You'll need a visa to enter Sierra Leone.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Sierra Leone for details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Sierra Leone.<br>Find out about returning to Australia after exposure to yellow fever (Department of Health).<br>Dual nationals<br>If you're an Australian-Sierra Leonean dual national, you need to show proof that you've paid taxes on money earned in Sierra Leone.<br>If you don't, you won't be allowed to leave the country."}, "Côte d'Ivoire (Ivory Coast)": {"country-iso": "CI", "name": "Côte d'Ivoire (Ivory Coast)", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Netherlands": {"country-iso": "NL", "name": "Netherlands", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>The Netherlands is part of the Schengen area, along with many other European countries.<br>You can enter the Netherlands without a visa in some cases.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Croatia": {"country-iso": "HR", "name": "Croatia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You don't need a tourist or business visa for stays of up to 90 days in a 6-month period.<br>You'll need a visa if:<br>Croatia is part of the European Union (EU) but isn't a member of the Schengen area.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Croatia for details about visas, currency, customs and quarantine rules."}, "Malta": {"country-iso": "MT", "name": "Malta", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Malta is a part of the Schengen area.<br>You can enter Malta without a visa in some circumstances. In other circumstances, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the High Commission of Malta for details about visas, currency, customs and quarantine rules.<br>Identity Malta"}, "Ghana": {"country-iso": "GH", "name": "Ghana", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>You'll need a visa to travel to Ghana.<br>Entry and exit conditions can change at short notice. Contact an embassy or high commission of Ghana for details about visas, currency, customs and quarantine rules."}, "Senegal": {"country-iso": "SN", "name": "Senegal", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa requirements<br>Contact an Embassy or Consulate of Senegal for entry and exit details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Senegal. If you don't have a certificate, authorities may quarantine you. You may also need a mandatory vaccination at your own cost.<br>Find out about returning to Australia after exposure to yellow fever (Department of Health)."}, "Liberia": {"country-iso": "LR", "name": "Liberia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>A visa is required to travel to Liberia.  Entry and exit conditions can change at short notice. Contact the nearest Embassy or Consulate of Liberia for details about visas, currency, customs and quarantine rules.<br>A visa is required to travel to Liberia."}, "Iran": {"country-iso": "IR", "name": "Iran", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visitor visa<br>You need a visa to enter Iran.<br>You can pay cash for a visa on arrival if you:<br>enter via an international airport<br>are visiting for tourism<br>are staying for 30 days or less<br>Extra requirements may apply. Before you travel, contact the Embassy of Iran to ask about the visa-on-arrival conditions.<br>In other situations, you must apply for a visa before you travel. Contact the Embassy of Iran to apply.<br>Entry and exit conditions can change at short notice. Contact the embassy of Iran for details about visas, currency, customs and quarantine rules.<br>The Government of Iran issues Iranian visas. The Australian Embassy can't intervene in visa matters, including visas on arrival."}, "Kuwait": {"country-iso": "KW", "name": "Kuwait", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You'll need a visa to enter Kuwait.<br>You can get a visitor visa on arrival. It will be valid for 3 months from the date of entry. Pay for your visa in cash using Kuwaiti dinars.<br>Get tourist, business and work visas online through the Kuwait e-Visa website. You'll need to pay in cash when you arrive at Kuwait International Airport.<br>For employment or residency visas, contact an embassy of Kuwait.<br>Entry and exit conditions can change at short notice. Contact an embassy of Kuwait for details about visas, currency, customs and quarantine rules.<br>If you overstay your visa, you'll face a large fine or travel ban. Check the expiry date on your visa."}, "Oman": {"country-iso": "OM", "name": "Oman", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You'll need a visa to enter Oman. Apply for an e-visa online.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of the Sultanate of Oman for details about visas, currency, customs and quarantine rules.<br>If your passport contains evidence of entry to Israel, or another country's border crossing points with Israel, authorities will deny you entry to Oman.<br>Omani authorities may not allow you to enter Oman from Yemen without prior approval.<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter Oman if you're arriving from a country where it's a risk.<br>Travel with children<br>Under Omani law, children with an Omani father are Omani nationals. They will need their father's permission to leave Oman."}, "French Polynesia": {"country-iso": "PF", "name": "French Polynesia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>Visa-free travel for short stays.<br>You likely won't need a visa for a tourist visit of up to 3 months.  However, you may need to show proof of:<br>sufficient money for your stay<br>return or onward travel ticket<br>adequate travel or health insurance<br>the purpose of your visit<br>In other situations, you may need a visa.<br>French Polynesia is an overseas territory of France.<br>Entry and exit conditions can change. Contact the Embassy of France in Canberra or the Consulate of France in Sydney for up to date information on visa requirements."}, "North Macedonia": {"country-iso": "MK", "name": "North Macedonia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>You can stay for up to 90 days in a 6-month period without a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>You can also get details from the Republic of North Macedonia Ministry of Foreign Affairs (Macedonian)."}, "Denmark": {"country-iso": "DK", "name": "Denmark", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Denmark, along with many other European countries, is part of the Schengen area. In some situations, this means you can enter Denmark without a visa.<br>Check the Schengen Convention before you travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Denmark for details about visas, currency customs and quarantine rules."}, "Palau": {"country-iso": "PW", "name": "Palau", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You can get a visitor visa for up to 30 days on arrival. You'll need an onward or return ticket.<br>Palau doesn't have an embassy or consulate in Australia.<br>Entry and exit conditions can change. Contact the Palau Bureau of Immigration for details about visas, currency, customs and quarantine rules.<br>Palau Bureau of Immigration\nPhone: (+680) 488 2498\nPhone: (+680) 488 2678\nEmail: imm@palaunet.com<br>Or you can contact:<br>Ministry of State\nPhone: (+680) 767 2490<br>Travel via the United States<br>If you travel through the US, including Guam and Hawaii, you must meet US entry or transit requirements. Check visa requirements with a US embassy or consulate."}, "Montenegro": {"country-iso": "ME", "name": "Montenegro", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You can stay for up to 90 days in a 6-month period without a tourist visa from date of entry to Montenegro.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Niger": {"country-iso": "NG", "name": "Niger", "advisory-text": "Do not travel", "visa-info": "<br>If you travel to Niger despite our advice, you'll need a visa to enter the country.<br>Entry and exit conditions can change. Contact the nearest embassy or consulate of Niger for details about visas, currency, customs and quarantine rules."}, "New Caledonia": {"country-iso": "NC", "name": "New Caledonia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You likely won't need a visa for a tourist visit of up to 3 months. However, you may need to show proof of:<br>In other situations, you'll need a visa.<br>New Caledonia is an overseas territory of France.<br>Entry and exit conditions can change. Contact the Consulate-General of France in Sydney or contact the Embassy of France in Canberra for up-to-date information on visas requirements.<br>Other formalities<br>Some goods aren't allowed in New Caledonia.  Other goods require specific approvals or other formalities."}, "Yemen": {"country-iso": "YE", "name": "Yemen", "advisory-text": "Do not travel", "visa-info": "na"}, "Federated States of Micronesia": {"country-iso": "FM", "name": "Federated States of Micronesia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You can get a tourist visa on arrival. It's valid for 30 days. You will need to show an onward or return ticket.<br>In other situations, you'll need an entry permit to:<br>work<br>study<br>stay for more than 30 days<br>Rules affecting your visit can change at short notice.<br>Entry and exit conditions can change. Contact the Division of Immigration in Pohnpei for details about visas and entry permits, currency, customs and quarantine rules.<br>Division of Immigration in Pohnpei<br>Phone: (+691) 320 5844 or (+691) 320 2605<br>Fax: (+691) 320 7250 or (+691) 320 6240<br>Email: imhq@mail.fm<br>Travel via the United States<br>If you’re travelling through the US, you must also meet US entry or transit requirements. This includes transit through Hawaii and Guam.<br>Contact your nearest US embassy or consulate for travel advice."}, "Syria": {"country-iso": "SY", "name": "Syria", "advisory-text": "Do not travel", "visa-info": "na"}, "Qatar": {"country-iso": "QA", "name": "Qatar", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You can get a free 30-day visa when you arrive, if your passport has at least 6 months validity. You also need a confirmed onward or return ticket.<br>You can apply to extend your visa for up to 30 more days through the Ministry of Interior Immigration Office.<br>Entry and exit rules can change at short notice. For details about visas, currency, customs and quarantine rules, contact:<br>Qatari authorities won't issue visas in an Australian emergency passport. You can only use an emergency passport to leave or travel through Qatar."}, "The Gambia": {"country-iso": "GM", "name": "The Gambia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Entry and exit conditions can change at short notice. Contact the High Commission of the Republic of The Gambia for details about visas, currency, customs and quarantine rules.<br>Yellow fever vaccination<br>You need a valid yellow fever vaccination certificate to enter The Gambia. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever (Department of Health)"}, "Iceland": {"country-iso": "IS", "name": "Iceland", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Iceland is one of the countries in Europe that's signed the Schengen Convention. This means you can enter Iceland without a visa in some cases.<br>Get an entry stamp in your passport from border control when you first enter the Schengen area.<br>Always carry a valid passport even if you're travelling from another Schengen country.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Iceland for details about visas, currency, customs and quarantine rules."}, "Nigeria": {"country-iso": "NG", "name": "Nigeria", "advisory-text": "Reconsider your need to travel", "visa-info": "<br>Visitor visas<br>If you decide to travel to Nigeria, despite our advice, you need a visa or Residence Permit (CERPAC or Green Card) to visit.<br>Some travellers can get a visa on arrival, subject to strict conditions. You'll need a letter of approval before you travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Serbia": {"country-iso": "RS", "name": "Serbia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You don't need a visa for tourist visits of up to 90 days in a 6-month period. This applies from the date of first entry.<br>You'll need a visa for other situations.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Serbia for details about visas, currency, customs and quarantine rules.<br>Don't attempt to enter Serbia from Kosovo unless you first travelled into Kosovo from Serbia.<br>To travel from Kosovo to Serbia, you'll need a valid, recent Serbian entry stamp in your passport. If you don't, you'll have to enter Serbia from another country.<br>If you have any border entry or exit stamps from Kosovo in your passport, Serbia can deny you entry. In practice, this does not occur often, but the Serbian border police will cancel the Kosovo entry/exit records by stamping over them.<br>The security situation along the Kosovo-Serbia border is volatile.<br>Political violence has broken out many times at the border crossings of:<br>Be cautious travelling in the Kosovo border area. See Safety<br>Within 24 hours of arrival, you must register your accommodation with either:<br>If you're staying at a hotel, ask if the hotel will register for you.<br>If you're staying in a private home, you'll need to register at the nearest police station.<br>If you don't register, you could be fined or detained.<br>If you plan to stay for longer than 90 days, you'll need to apply for a Temporary Residence Permit. Apply at least 30 days before your tourist visa expires.<br>Check the Serbian Ministry of Foreign Affairs (Serbian) for application forms and more information.<br>Local police issue the temporary residence permits."}, "Austria": {"country-iso": "AT", "name": "Austria", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Austria is part of the Schengen area. This means you can enter Austria without a visa in some cases.<br>In other situations, you'll need to get a visa.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Austria for details about visas, currency, customs and quarantine rules."}, "Romania": {"country-iso": "RO", "name": "Romania", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You don't need a visa if you're a tourist staying for less than 90 days.<br>For other kinds of travel, you need a visa.<br>Romania isn't part of the Schengen area, but it's working towards becoming a member.<br>Entry and exit conditions may change if Romania becomes part of the Schengen area. Contact an embassy or consulate of Romania for details about visas, customs and quarantine rules."}, "Georgia": {"country-iso": "GE", "name": "Georgia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You can visit Georgia for up to 12 months without a visa if you have an Australian passport. You'll need a visa for longer stays.<br>Entry and exit requirements can change at short notice. Contact the Georgian Foreign Ministry or an embassy or consulate of Georgia for details about visas, currency, customs and quarantine rules.<br>Ministry of Foreign Affairs of Georgia e-Visa Portal"}, "The Republic of Slovenia": {"country-iso": "SI", "name": "The Republic of Slovenia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Slovenia is part of the Schengen area. This means you can enter Slovenia without a visa in some cases.<br>Entry and exit conditions can change at short notice. Contact the nearest Embassy or Consulate of Slovenia for details about visas, currency, customs and quarantine rules.<br>Some Schengen countries, including neighbouring Austria, have temporary immigration controls in place.<br>Slovenia's border with Croatia has full immigration control. Croatia is not part of the Schengen area.<br>To avoid delays:<br><br>When you enter the Schengen area for the first time, check that the entry stamp in your passport is readable.<br>Customs officials may ask you to show them a return or onward ticket.<br>You must register with local police within 3 days of arrival or risk paying a fine. Registration is usually part of the hotel check-in procedure. If they don't do this, or you're staying in a private home, register at the nearest police station."}, "Marshall Islands": {"country-iso": "MH", "name": "Marshall Islands", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visa for short stays<br>You'll get a 30-day visitor visa on arrival. You can pay to extend your visa at the Division of Immigration.<br>If you want to travel to Kwajalein, you must have an Entry Authorisation from the US Military.<br>Entry and exit conditions can change. Contact the Division of Immigration for details about visas, currency, customs and quarantine rules.<br>Division of Immigration<br>Phone: (+692) 625 8633 or (+692) 625 4572<br>Facebook: www.facebook.com/repmarimmigration<br>Email: rmi_majuro@rmi-immigration.com<br>Travel via the United States<br>If you're travelling through the US, you must meet US entry or transit requirements. Check with your nearest US embassy or consulate.<br>Travel advice for the US"}, "Azerbaijan": {"country-iso": "AZ", "name": "Azerbaijan", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You need a visa to visit Azerbaijan.<br>Visa and other entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Azerbaijan for details about visas, currency, customs and quarantine rules.<br>You can apply for an electronic visa (e-visa) for single entry, 30-day stays. Do this online through Azerbaijan's State Agency for Public Service and Social Innovations. Allow at least 3 business days for processing.<br>Make sure your passport is valid for at least 3 months from the expiry date of the e-visa.<br>Visa extensions<br>You can apply to extend or renew your visa through Azerbaijan's State Migration Service. Keep a copy of your passport and existing visa while your application is processed. The Ministry of Interior Police may ask to see your documents at any time. See Local laws<br>Registering with the police<br>If you plan to stay in Azerbaijan for over 15 days, you must register with local police. Do this within 15 days of arrival. If you don't, you'll be fined.<br>You may not be able to leave Azerbaijan until you pay the fine and get an exit permit from the State Migration Service.<br>Travel via Nagorno-Karabakh<br>If your passport has visas or stamps from Nagorno-Karabakh, you could be refused entry into Azerbaijan.<br>Travel via neighbouring countries<br>Travel restrictions may apply to Australians planning to travel overland from Azerbaijan to neighbouring countries.<br>Check the nearest embassy or consulate of Azerbaijan for any travel restrictions. You'll also need to check the rules of neighbouring countries."}, "Greece": {"country-iso": "GR", "name": "Greece", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Greece is a part of the Schengen area. This allows you to enter without a visa in some cases. Get an entry stamp in your passport from border control when you first enter the Schengen area.<br>Always carry a valid passport, even if you're travelling from another Schengen country.<br>Entry and exit conditions can change at short notice and in some situations you will need a visa. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Visit Greece<br>Embassy of Greece"}, "Kosovo": {"country-iso": "RS", "name": "Kosovo", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>As a tourist, you won't need a visa for stays of less than 90 days.<br>You may need to provide documents showing the reason for your visit when entering.<br>Border authorities issue a 90-day entry stamp. You can renew your stamp for longer stays.<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and quarantine rules, contact:<br>Kosovo Foreign Ministry (Albanian)<br>Embassy or consulate of Kosovo"}, "Vanuatu": {"country-iso": "VU", "name": "Vanuatu", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You can apply for a visa when you arrive if:<br>you're visiting Vanuatu for up to 30 days<br>you have a return or onward ticket<br>Otherwise, you'll need to get a visa before you travel.<br>Entry and exit conditions can change. Contact an embassy or consulate of Vanuatu for details about visas, currency, customs and quarantine rules.<br>Vanuatu Department of Immigration"}, "Hungary": {"country-iso": "HU", "name": "Hungary", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Hungary is part of the Schengen area with many other European countries. In some cases, you can enter Hungary without a visa.<br>Otherwise, you'll need to get a visa before you travel.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Hungary for details about visas, currency, customs and quarantine rules"}, "Turkey": {"country-iso": "TR", "name": "Turkey", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You'll need an e-visa for tourism or business if you're staying for less than 90 days in a 180-day period.<br>Use the official Turkish government site to apply online for an e-visa.<br>Be wary of using unauthorised websites. They may charge for information on e-visas.<br>If you're not eligible for an e-visa, you'll need to arrange a visa through an embassy or consulate of Turkey before you arrive. If you don't, authorities may refuse you entry.<br>If you're a tourist and you arrive by sea, you may be able to visit the surrounding areas for up to 72 hours without a visa. Check your visa requirements with your travel operator or local authorities at the port of entry.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Guam": {"country-iso": "GU", "name": "Guam", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Guam is an unincorporated US territory. You must meet US entry or transit requirements.<br>The US has strict entry requirements. You may be refused entry if you don't comply. See our travel advice for the US.<br>Entry and exit conditions can change. Contact a US embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Embassy of the United States of America in Australia"}, "Indonesia": {"country-iso": "ID", "name": "Indonesia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You can visit Indonesia visa-free for up to 30 days. You can't extend your stay if you enter Indonesia visa-free.<br>If you plan to stay more than 30 days, apply for a visa from an embassy or consulate of Indonesia.<br>You can also apply for a visa on arrival. This visa is valid for 30 days and you can extend it for another 30 days.<br>You can't get a visa on arrival at all land entry points. If you plan to enter Indonesia by land, contact the embassy or consulate of Indonesia for details.<br>The period of your stay starts on the day you arrive. Part days are counted as whole days.<br>You face fines if you overstay your visa.<br>Some airlines flying from Australia to Jakarta and Bali offer on-board visa processing.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>You can't work or conduct research in Indonesia unless you have the appropriate visa. Fines of 1,000,000 IDR (approx. AU$100) per day apply for the maximum 60 day overstay period.<br>Fines of 1,000,000 IDR (approx. AU$100) per day apply for the maximum 60 day overstay period.<br>If you breach Indonesian immigration regulations, you may face:<br>You may not be allowed to enter Indonesia if you have a criminal record. This is regardless of how long ago the offence took place. If you're concerned, contact an embassy or consulate of Indonesia before you travel.<br>Indonesian immigration decisions are final. The Australian Government can't help you.<br>If you're travelling on an emergency passport, you can only enter Indonesia if you have a visa from an embassy or consulate of Indonesia."}, "Bulgaria": {"country-iso": "BG", "name": "Bulgaria", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You don't need a visa to enter as a tourist for up to 90 days within a 6-month period.<br>You need a visa for other kinds of travel.<br>While Bulgaria is part of the European Union (EU), it's not yet in the Schengen area.<br>Visa and other entry and exit conditions may change if Bulgaria becomes part of the Schengen area. Contact the nearest Bulgarian embassy or consulate for up-to-date information."}, "Bosnia and Herzegovina": {"country-iso": "BA", "name": "Bosnia and Herzegovina", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You don't need a visa for stays of up to 90 days.<br>If you plan to stay longer than 90 days, you'll need a temporary residence permit.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Bosnia and Herzegovina for details about visas, currency, customs and other travel requirements."}, "The Slovak Republic": {"country-iso": "SK", "name": "The Slovak Republic", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>The Slovak Republic is a part of the Schengen area. This means you can enter the country without a visa in some situations.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of The Slovak Republic for details about visas, currency, customs and quarantine rules."}, "Cameroon": {"country-iso": "CM", "name": "Cameroon", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Entry and exit conditions can change at short notice. You can contact the nearest High Commission of the Republic of Cameroon for the latest details. They will tell you about visas, currency, customs and other travel requirements.<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Cameroon, and neighbouring countries.<br>To protect yourself and to avoid entry issues, get vaccinated for yellow fever before you travel. See Health<br>Find out about returning to Australia after exposure to yellow fever."}, "Philippines": {"country-iso": "PH", "name": "Philippines", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You won't need a visa if you plan to:<br>You'll need a visa if you're:<br>Ensure you keep your visa up to date.  Failure to do so may result in you being:<br>arrested<br>detained in immigration detention<br>deported back to Australia at your cost<br>blacklisted from future travel to the Philippines<br>Detention conditions in the Philippines do not compare with Australian standards and deportation processes can be lengthy.<br>You can apply to extend your tourist visa (visa waiver) through the Philippines Bureau of Immigration  and pay the appropriate fees.<br>You can apply to extend your tourist visa (visa waiver) through the Philippines Bureau of Immigration<br>Philippines Bureau of Immigration<br><br>and pay the appropriate fees.<br>Entry and exit conditions can change at short notice. Get further details about visas, currency, customs and quarantine rules from:"}, "Tonga": {"country-iso": "TO", "name": "Tonga", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Tourist visas<br>You can get a tourist visa when you arrive for stays of up to 31 days. However, you must have an onward ticket.<br>Entry and exit conditions can change at short notice. Contact a high commission of Tonga for details about visas, currency, customs and quarantine rules."}, "Argentina": {"country-iso": "AR", "name": "Argentina", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>As a tourist, you can stay for up to 90 days without a visa, but you'll need:<br>Officials may also ask to see proof of accommodation and enough money or a credit card to cover your trip.<br>You'll need a visa to work or study in Argentina, or if you have an Australian diplomatic or official passport.<br>Apply for a visa from an Argentinian embassy or consulate well before you travel. Visas are not available on arrival.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Argentina for details about visas, currency, customs and quarantine rules.<br>Other entry requirements<br>Biometric entry procedures are in place at:<br>On arrival at these ports, authorities will:<br>Children younger than 18 may need to provide a letter of consent from any parents that aren't travelling with them.<br>Seek advice from your nearest embassy or consulate of Argentina as early as possible.<br>Travel via the United States<br>If you're travelling through the US, you must meet US entry or transit requirements.<br>Check your visa needs well before you travel. Contact the nearest embassy or consulate of the United States.<br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Argentina. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever."}, "Cook Islands": {"country-iso": "CK", "name": "Cook Islands", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free travel for short stays<br>You don't need visa for a tourist visit of up to 30 days.<br>In other situations, you'll need a visa.<br>Entry and exit conditions can change. Contact the Ministry of Foreign Affairs and Immigration  on +68229347 for the details about visas, currency, customs and quarantine rules.<br>Other formalities<br>To enter the Cook Islands, you'll need to show proof of:"}, "Belgium": {"country-iso": "BE", "name": "Belgium", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Belgium is a part of the Schengen area, along with many other European countries.<br>You can enter Belgium without a visa in some cases. In other situations, you'll need a visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules."}, "Lebanon": {"country-iso": "LB", "name": "Lebanon", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>People of most nationalities, including Australians, can get tourist visas for Lebanon on arrival.<br>Entry and exit conditions can change at short notice. Contact the nearest Lebanese embassy or consulate for details about visas, currency, customs and quarantine rules."}, "India": {"country-iso": "IN", "name": "India", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa requirements<br>You need a visa to enter India. You must arrange your visa before you arrive.<br>Electronic visas<br>You may be eligible for an Electronic Visa (e-Visa). It gives you up to 60 days of travel for:<br>Get your e-Visa at least 4 days before you arrive.<br>You can:<br>Check that you're eligible before you apply. Visit the Government of India's e-Visa website for details.<br>Beware of fake websites offering e-Visa services.<br>Carry a printed copy of your e-Visa, known as an electronic travel authorisation (ETA).<br>You'll get a formal visa in your passport when you arrive in India.<br>Long queues are common at immigration counters in India, regardless of visa type.<br>If you present an e-Visa at an entry point where the e-Visa is not recognised, you:<br>If you have an e-Visa, you can leave India from any authorised immigration check point.<br>Other visas<br>Not all international airports in India allow passengers to enter with an e-Visa. If you enter through another location, you need a visa. Arrange your visa through an Indian consulate, embassy or agent before you arrive.<br>All other visa applicants need to make an appointment online before submitting their visa application.<br>Other conditions<br>If you don't have a valid passport or visa, you could be deported by Indian authorities.<br>The Australian High Commission and consulates in India can't help you to stay if you don't have the right documents.<br>Entry and exit conditions can change at short notice. Contact the Indian High Commission in Canberra for details about visas, currency, customs and quarantine rules.<br>Ministry of Home Affairs<br>Volunteering<br>If you're considering volunteer work, talk to the nearest embassy or consulate about visa requirements before you travel. This includes students visiting India under the New Colombo Plan.<br>Volunteer responsibly.<br>Make sure you are contributing in an ethical and meaningful way.<br>Overstays and exit visas<br>You could incur heavy penalties for overstaying your visa, including being jailed.<br>Check your visa conditions and make sure you comply.<br>Leave India before your visa expires.<br>If your passport is lost or stolen while you're in India, you'll need to get an exit visa from the Indian Ministry of Home Affairs before you leave.<br>If your passport is lost or stolen:<br>arrange a replacement travel document from the nearest Australian Embassy, High Commission or Consulate"}, "Armenia": {"country-iso": "AM", "name": "Armenia", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>You don't need a visa for Armenia if you're staying for up to 180 days or less.<br>If you're staying longer than 180 days, you must also register with the police.<br>Visa and other entry and exit conditions, such as currency, customs and quarantine regulations, can change at short notice. To get the latest details, contact either:<br>"}, "Ukraine": {"country-iso": "UA", "name": "Ukraine", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You need a visa to enter Ukraine. You can't get a visa on arrival.<br>Australian tourist and business visitors can apply for an e-Visa from the Ministry of Foreign Affairs.<br>To extend your visa or to apply for temporary, long-term or permanent residency, contact the State Migration Service of Ukraine.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Ukraine for details about visas, currency, customs and quarantine rules."}, "Turkmenistan": {"country-iso": "TM", "name": "Turkmenistan", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You need a visa to enter Turkmenistan, even if you're just transiting.<br>You must get a visa before you arrive.<br>Make sure you have the right visa for the purpose of your visit, especially for business and work visas.<br>Before you travel, make sure your visa has the correct:<br>Turkmen visas specify:<br>You can only stay in Turkmenistan for the number of days shown on your visa.<br>There are penalties for infringing your visa, including:<br>Transit visas<br>Transit visa holders must:<br>You can't change a transit visa to another class of visa once you're in Turkmenistan.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>There is no embassy or consulate of Turkmenistan in Australia. See the Turkmenistan Government's list of embassies and consular offices."}, "Albania": {"country-iso": "AL", "name": "Albania", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You can visit Albania for 90 days without a visa. You'll need a visa for longer stays.<br>Entry and exit conditions can change. Contact an embassy or consulate of Albania for details about visas, currency, customs and quarantine rules."}, "United Kingdom": {"country-iso": "GB", "name": "United Kingdom", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>If you're travelling as a tourist for less than 6 months, you usually won't need a visa.<br>The UK can refuse entry without a visa. This happens if they think you're trying to enter for something other than tourism. You'll need a visa if you're planning to do paid or unpaid work, volunteer or get married. Arrange this before you travel.<br>Check with UK Visas and Immigration if:<br>Australian Government officials can't help you change your UK visa status.<br>Entry and exit conditions can change at short notice. Contact the UK High Commission for details about visas, currency, customs and quarantine rules."}, "Belarus": {"country-iso": "BY", "name": "Belarus", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa-free entry for short stays<br>You can get a 30-day visa-free entry into Belarus. You can stay up to 90 days per calendar year. This is only valid for travelers who enter and exit through Minsk International Airport.<br>Visa-free entry does not apply to travellers coming from, or travelling to Russia.<br>Other entry conditions apply, such as compulsory medical insurance.<br>Travel via Russia<br>You'll need to get a Russian transit visa if you're travelling via Russia. Contact the nearest embassy of Russia for details.<br>Diplomatic or official passport<br>Different rules apply if you're travelling on a diplomatic or official passport. Contact the State Border Committee of The Republic of Belarus for details.<br>Border crossings<br>Authorities don't permit foreigners to cross the land border between Belarus and Russia. Instead, you'll need to travel between Belarus and Russia by air. For details, contact either:<br>Authorities permit Australians to cross land borders for short visits to the areas of Augustov Canal, Belovezhskaya Pushcha and Brest (bordering Poland), and Grodno (bordering Poland and Lithuania).<br>Travel with a registered tour operator and enter through assigned border checkpoints. Check details about:<br>When you enter and exit Belarus, show the original issued visa to border authorities. They won't accept copies.<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and quarantine rules, contact:"}, "Kyrgyz Republic": {"country-iso": "KG", "name": "Kyrgyz Republic", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa-free travel for short stays<br>You don't need a tourist visa to stay up to 60 days.<br>In other cases, you'll need a visa.<br>You can apply for an e-visa for tourism and business for up to 90 days.<br>With an e-visa you may only enter and leave via:<br>Manas and Osh International airports<br>the Ak-Jol checkpoint at the Kyrgyz-Kazakh border<br>To apply visit, the e-visa website.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate for details about visas, currency, customs and quarantine rules.<br>Many flights in and out of the Kyrgyz Republic stop over in Russia. You'll need to meet visa requirements for any countries you'll transit through.<br>Travel advice for Russia"}, "Benin": {"country-iso": "BJ", "name": "Benin", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visitor visas<br>If you hold an Australian passport, you need a visa to enter Benin.<br>You can apply online for a short stay single or multiple entry e-visa.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of Benin for details about visas, currency, customs and quarantine rules."}, "China": {"country-iso": "CN", "name": "China", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You may need a full visa for travel to China, even as a tourist.<br>Transit visas, issued on arrival, are available for some short visits.<br>If you need a full visa, you must get this before you travel.<br>See the Embassy of the People's Republic of China for visa types.<br>If you're already travelling or living in China, contact the Foreigners Entry and Exit Administration Section of the local Public Security Bureau (PSB) for visa information.<br>Authorities will scan your fingerprints when you arrive if you're aged between 14 and 70 years.<br>Authorities have strict penalties for visa violations. Penalties include:<br>Make sure you leave China before your visa expires.<br>Entry and exit conditions can change at short notice. Contact the nearest embassy or consulate of China for details about visas, currency, customs and quarantine rules."}, "Iraq": {"country-iso": "IQ", "name": "Iraq", "advisory-text": "Do not travel", "visa-info": "<br>If you travel to Iraq despite our advice, you'll need a visa before you arrive. The Government of Iraq issues visas.<br>Authorities may arrest you for immigration offences if you enter Iraq without a valid visa.<br>Australian travellers arriving through Erbil International Airport or Sulaymaniyah International Airport may be eligible for a 30-day visa on arrival.<br>This visa is only valid for travel within the region the Kurdistan Regional Government administers. It's not accepted for travel to other areas of Iraq.<br>Entry and exit conditions can change at short notice. For details about visas, currency, customs and quarantine rules, contact either:<br>an embassy or consulate of Iraq, or<br>the Iraqi Ministry of Interior (Arabic)"}, "New Zealand": {"country-iso": "NZ", "name": "New Zealand", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visa conditions<br>You don't usually need a visa to visit New Zealand if you:<br>However, check your visa requirements if you've been:<br>In these cases, contact a New Zealand Visa Application Centre for advice well before you travel.<br>New Zealand Electronic Travel Authority<br>From 1 October 2019, you may need to follow new visa rules.<br>Australian permanent residents need to apply online for a New Zealand Electronic Travel Authority (NZeTA) to enter New Zealand.<br>Australian citizens are exempt from this rule.<br>New Zealand Visa Application Centre<br>Suite 9.03, Level 9,\n139 Macquarie Street\nSydney, New South Wales 2000\nPhone: 1800 388 718\nWebsite: www.ttsnzvisa.com\nEmail : ttssydneynz@ttsvisas.com<br>Entry and exit conditions can change at short notice. Contact NZ Immigration for details about visas, currency, customs and quarantine rules."}, "Guyana": {"country-iso": "GY", "name": "Guyana", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa conditions<br>Entry and exit conditions change regularly. Contact the High Commission of Guyana for details about visa, currency, customs and quarantine rules.<br>Departure tax<br>You must pay a departure tax. The amount varies at each international airport.<br>Payments must be in cash, in local currency.<br>Yellow fever vaccination<br>You'll need a valid yellow fever vaccination certificate to enter Guyana. Some airlines may want to see one when you leave.<br>Find out about returning to Australia after exposure to yellow fever.<br>Countries with a risk of yellow fever (PDF 74KB)<br>Travel via the United States<br>If you travel through the US, you must meet US entry or transit requirements.<br>Check our US travel advice for entry conditions.<br>Travel via Canada<br>If you transit or travel via Canada by air, you'll need a Canadian eTA (electronic Travel Authorisation).<br>Check our Canada travel advice for entry conditions."}, "Solomon Islands": {"country-iso": "SB", "name": "Solomon Islands", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>Visitor visas<br>Get a visitor visas on arrival for stays of up to 90 days.<br>Entry and exit conditions can change at short notice. Contact an embassy or consulate of Solomon Islands for details about visas, currency, customs and quarantine rules."}, "Paraguay": {"country-iso": "PY", "name": "Paraguay", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Vistor visas<br>You need a visa to enter Paraguay.<br>At Asunción International Airport, you can pay cash for a 90-day visa valid for multiple entries.<br>At other ports of entry, you'll need to have a visa before you arrive. Whether you arrive by air, land or sea.<br><br>Get your passport stamped by immigration when entering Paraguay by land. If you don't, you'll pay a fine when you leave.<br><br>Entry and exit conditions can change. Contact the nearest embassy or consulate of Paraguay for details about visas, currency, customs and other travel requirements.<br>Travelling with children<br>A child aged under 18 who travels alone or with only 1 parent needs a letter of consent from the non-travelling parent or parents.<br>Check with the nearest embassy or consulate of Paraguay about what you need to do.<br><br>Yellow fever vaccination<br>You may need a valid yellow fever vaccination certificate to enter Paraguay. Some airlines may want to see one when you leave.<br><br>Check the yellow fever entry requirements by contacting the nearest embassy or consulate of Paraguay.<br><br>Find out about returning to Australia after exposure to yellow fever.<br>Travel via the United States<br>If you're travelling to or from Paraguay through the US, you must meet US entry or transit requirements."}, "Bhutan": {"country-iso": "BT", "name": "Bhutan", "advisory-text": "Exercise normal safety precautions", "visa-info": "<br>You need a visa to travel to Bhutan.<br>Bhutan has strict controls on international tourism. Government-licensed tour operators must arrange your travel visa.<br>The Tourism Council of Bhutan publishes a list of licensed tour operators.<br>Independent travel is not possible unless you have a long-term visa.<br>If you plan to stay long term, you'll need either:<br>Bhutan does not recognise de facto or same-sex relationships. You need to provide a marriage certificate to be eligible for a dependent spouse visa.<br>Visa and other entry and exit conditions can change at short notice.<br>Travel via India<br>If you're travelling to or from Bhutan via India, read our travel advice for India."}}