{"Afghanistan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/afghanistan/", "country-iso": "AF", "visa-info": "If you are unsure of the entry requirements for Afghanistan, including visa and other immigration information, ask your travel agent or contact the Embassy of the Islamic Republic of Afghanistan in London. You can also check with them how long your passport must be valid for.", "advisory-text": "Do not travel", "name": "Afghanistan"}, "Albania": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/albania/", "country-iso": "AL", "visa-info": "", "advisory-text": "Normal precautions", "name": "Albania"}, "Algeria": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/algeria/", "country-iso": "DZ", "visa-info": "", "advisory-text": "High degree of caution", "name": "Algeria"}, "Andorra": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/andorra/", "country-iso": "AD", "visa-info": "Irish citizens don’t need a visa to enter Andorra.", "advisory-text": "Normal precautions", "name": "Andorra"}, "Angola": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/angola/", "country-iso": "AO", "visa-info": "If you are unsure about the entry requirements for Angola, including visa and other immigration information, ask your travel agent or contact the Embassy of Angola in London.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Angola"}, "Anguilla": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/anguilla/", "country-iso": "AI", "visa-info": "", "advisory-text": "Normal precautions", "name": "Anguilla"}, "Argentina": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/argentina/", "country-iso": "AR", "visa-info": "If you are unsure of what the entry requirements for Argentina are, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Argentina.You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Argentina"}, "Armenia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/armenia/", "country-iso": "AM", "visa-info": "EU passport holders no longer require a visa to visit Armenia. The entrance stamp is valid for a period of 90 days only. Children arriving on an Irish passport with parents entering Armenia on an Armenian passport will require an Armenian passport to leave the country; this is stated in Armenian law.If you intend to stay in Armenia longer than 90 days, you must register with the OVIR (Administration Department for Passports and Visas):Address: Mashtots Ave. 13A,Yerevan,ArmeniaTel: 00 374 10 536 932/ 941", "advisory-text": "Normal precautions", "name": "Armenia"}, "Australia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/australia/", "country-iso": "AU", "visa-info": "You will need a visa in advance to enter Australia. You have to be pre-cleared and issued with an Electronic Travel Authorisation. Travel agents, the nearest Australian Embassy or the Australian Immigration website can provide further details.Always respect the terms of your visa. It’s an offence to overstay a visa and to do so will likely incur a sanction, which can include up to a three-year ban on entering the country.Immigration law is very strictly enforced – don’t be under any illusion on this point.Travelling to Australia on a working holiday visaHealthAlways get comprehensive travel insurance. See the overview section of this travel advice for more information on the Reciprocal Health Agreement for emergency care only.Mosquito-borne diseasesVisitors to northern Queensland, the Northern Territory and the north of Western Australia may be exposed to mosquito-borne diseases such as dengue fever and Ross River fever. Take suitable precautions and use insect repellents and sleeping nets.There have been reports of cases of Murray Valley Encephalitis (MVE), a potentially fatal mosquito-borne disease, in the Northern Territory and north Western Australia, with occasional cases in Queensland, central Australia and the central regions of Western Australia.", "advisory-text": "Normal precautions", "name": "Australia"}, "Austria": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/austria/", "country-iso": "AT", "visa-info": "", "advisory-text": "Normal precautions", "name": "Austria"}, "Azerbaijan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/azerbaijan/", "country-iso": "AZ", "visa-info": "Irish nationals staying in Azerbaijan for longer than 3 days must register with the nearest police station within 3 working days of arrival. Hotels may provide this service for their guests, but visitors staying in apartments or private residences will have to register by themselves. Each traveller is responsible for ensuring that the registration has been completed. Guidance on the process can be found on the English language pages of the State Migration Service’s website. Those staying longer than 30 days are required to register for a residence card.Fines are applied if registration is not done on time.", "advisory-text": "High degree of caution", "name": "Azerbaijan"}, "Bahamas": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bahamas/", "country-iso": "BS", "visa-info": "Irish citizens don’t need a visa to enter the Bahamas. However, if you’re unsure of the entry requirements, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of the Bahamas. You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Bahamas"}, "Bahrain": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bahrain/", "country-iso": "BH", "visa-info": "All travellers to Bahrain face increased scrutiny from the Bahraini authorities and a number have been refused entry. Visitors must have legal status when they depart and may incur heavy fines if they overstay or fail to extend their legal residency.", "advisory-text": "High degree of caution", "name": "Bahrain"}, "Bangladesh": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bangladesh/", "country-iso": "BD", "visa-info": "", "advisory-text": "High degree of caution", "name": "Bangladesh"}, "Barbados": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/barbados/", "country-iso": "BB", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Barbados"}, "Belarus": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/belarus/", "country-iso": "BY", "visa-info": "If you’re unsure of the entry requirements for Belarus, including visa and other immigration information, ask your travel agent or contact the Embassy of Belarus in London. You can also check with them for how long your passport must be valid.", "advisory-text": "Normal precautions", "name": "Belarus"}, "Belgium": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/belgium/", "country-iso": "BE", "visa-info": "", "advisory-text": "High degree of caution", "name": "Belgium"}, "Belize": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/belize/", "country-iso": "BZ", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate..You can also check with them how long your passport must be valid for. ", "advisory-text": "High degree of caution", "name": "Belize"}, "Benin": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/benin/", "country-iso": "BJ", "visa-info": "It’s advisable to take a number of photocopies of your passport with you when travelling to Benin and you should carry a photocopy of your passport at all times during your stay.If your passport is lost or stolen while you’re abroad, we can help.What we can do:We’ll do our best to help you as quickly as possible but this can take some time. Your location and circumstances may limit the help we can give you. As Ireland does not have an Embassy or Consulate in Benin there may be additional complications in processing and application for a new passport.You should contact the Irish Embassy in Abuja in Nigeria to find out what you need to do to apply for a passport. They will also be able to advise you on the fees which apply.Ireland doesn’t have an Embassy or Consulate in Benin so we can’t verify detailed travel advice to ensure that it’s accurate, appropriate and up to date. However, we encourage you to conduct your own research and to read these links to travel advice from other foreign ministries: ", "advisory-text": "High degree of caution", "name": "Benin"}, "Bermuda": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bermuda/", "country-iso": "BM", "visa-info": "You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Bermuda"}, "Bhutan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bhutan/", "country-iso": "BT", "visa-info": "Bhutan’s tourism industry is small and strictly regulated. It’s not possible for a western tourist or business traveller to enter Bhutan as an independent traveller. If you want to visit Bhutan, you must first register and confirm an itinerary with a specialist Bhutanese travel agent or group tour operator. The tour operator will process all visa and immigration requirements, issue an entry visa and make flight and accommodation reservations as appropriate.The cost for such services can be high. A minimum daily rate of approximately US$200 per person is charged which also covers meals, guided excursions, cultural programmes and domestic transport. Failure to re-confirm travel plans with the tour operator and pay for the itinerary in full before travelling will result in travellers being refused entry.On arrival, you must also pay a further US$20 visa fee and provide two passport-sized photos.You can get more information (in English) on entry requirements from the Bhutanese Ministry of Tourism.", "advisory-text": "Normal precautions", "name": "Bhutan"}, "Bolivia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bolivia/", "country-iso": "BO", "visa-info": "If you are unsure of the entry requirements for Bolivia, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Bolivia.You can also check with them how long your passport must be valid for.", "advisory-text": "Avoid non-essential travel", "name": "Bolivia"}, "Botswana": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/botswana/", "country-iso": "BW", "visa-info": "", "advisory-text": "Normal precautions", "name": "Botswana"}, "Brazil": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/brazil/", "country-iso": "BR", "visa-info": "Ireland and Brazil have an agreement under which their citizens can enter each other’s country without a visa and as a tourist for up to 90 days. You will, however, have to be able to show that you are a genuine tourist (see below).On arrival in Brazil, you must present a passport that is valid for at least 6 months. If you have any other immigration queries, you should ask your travel agent or contact the nearest Brazilian Embassy or Consulate.In general, on arrival in Brazil you should have:Proof that you have or have access to sufficient funds (if you’re bringing a credit card, we advise you to carry a statement to prove the limit).A return or onward ticket.Proof of accommodation booked for at least the first night.On entering Brazil, you should ensure your passport is stamped by the immigration authorities and retain a copy of your immigration landing card. These will be reviewed when departing Brazil, and if not presented, a fine may be applied.", "advisory-text": "Normal precautions", "name": "Brazil"}, "Bulgaria": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/bulgaria/", "country-iso": "BG", "visa-info": "Irish citizens don’t need a visa to enter Bulgaria. However, children need an individual passport to enter the country. If you’re staying longer than 90 days you should register with the local police and get a temporary resident’s card.", "advisory-text": "Normal precautions", "name": "Bulgaria"}, "Burundi": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/burundi/", "country-iso": "BI", "visa-info": "If you are unsure about the entry requirements for Burundi, including visa and other immigration information, ask your travel agent or contact the country's nearest Embassy or Consulate.You can also check with them how long your passport must be valid for.", "advisory-text": "Do not travel", "name": "Burundi"}, "Cambodia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/cambodia/", "country-iso": "KH", "visa-info": "", "advisory-text": "Normal precautions", "name": "Cambodia"}, "Cameroon": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/cameroon/", "country-iso": "CM", "visa-info": "", "advisory-text": "High degree of caution", "name": "Cameroon"}, "Canada": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/canada/", "country-iso": "CA", "visa-info": "Please see ‘Overview’ tab for information on the eTA which is required to enter Canada.If you are unsure of what the entry requirements for Canada are, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Canada.You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Canada"}, "Chad": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/chad/", "country-iso": "TD", "visa-info": "", "advisory-text": "Avoid non-essential travel", "name": "Chad"}, "Chile": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/chile/", "country-iso": "CL", "visa-info": "", "advisory-text": "High degree of caution", "name": "Chile"}, "China": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/china/", "country-iso": "CN", "visa-info": "", "advisory-text": "High degree of caution", "name": "China"}, "Colombia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/colombia/", "country-iso": "CO", "visa-info": "If you're travelling through the United States of America, you'll need to meet US entry/transit requirements. Check your visa requirements with a US Embassy or Consulate well in advance of travel.Depending on your country of origin, Colombian authorities may require you to hold a yellow-fever vaccination certificate in order to enter the country. Such certificates are also mandatory to enter certain high-risk regions and national parks.If you intend to travel on to neighbouring countries in Latin America from Colombia, you may not be allowed to do so without production of a yellow-fever vaccination certificate. You should confirm with the authorities of your next destination whether they require a certificate following your visit to Colombia.It's advisable to take a number of photocopies of your passport with you. During your stay you should carry a photocopy of your passport, the passport page containing your Colombian visa (if applicable), and the passport page containing your entry stamp, at all times.Check with your doctor well in advance (at least eight weeks) of travelling to see if you need any vaccinations for Colombia.Medical facilities in Colombia vary widely in quality. In larger cities, private clinics usually provide good quality care, whereas public health facilities and those in smaller cities may be of poorer quality.Before you travel, you should make sure you have adequate travel health insurance and accessible funds to cover the cost of any medical treatment abroad and repatriation. Foreign nationals who violate immigration laws in Colombia (e.g. by overstaying a visa) will not be permitted to access Colombia's public health system.There's a high incidence of malaria in low-land tropical areas, particularly in Choco and north-western Antioquia. You are advised to take medical advice on anti-malarial medication prior to travel, and after arrival, take precautions to avoid being bitten by mosquitoes by using bed nets and repellents, and wearing closed shoes, long sleeves and trousers.Dengue fever is endemic to Latin America and the Caribbean and can occur throughout the year. Take precautions against being bitten by Dengue-carrying mosquitoes, which are active throughout the day.A moderate risk of transmission of the Zika virus (a dengue-like mosquito-borne disease) exists in Colombia, though it is worth noting that mosquitoes transmitting the virus are unlikely to be found above 2,000m (6,500ft). Pregnant women or women planning a pregnancy are advised to postpone all non-essential travel to Colombia. Irish Citizens especially those with a weakened immune system or women who are pregnant or trying to become pregnant are advised to follow guidance available on the website of the Health Protection Surveillance Centre (HPSC) at http://www.hpsc.ie/A-Z/Vectorborne/Zika/.Cases of chikungunya virus have been reported in Colombia. As with other mosquito-borne viruses, all precautions should be taken to avoid bites.Tap water is safe to drink only in Bogotá. In all other areas of Colombia, you should drink only bottled water and avoid ice in drinks.Travellers to many parts of Colombia, including Bogotá, are at risk of developing altitude sickness. Get advice from your doctor before you travel, particularly if you plan to carry out activities such as hiking in high-altitude areas. ", "advisory-text": "High degree of caution", "name": "Colombia"}, "Comoros": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/comoros/", "country-iso": "KM", "visa-info": "", "advisory-text": "High degree of caution", "name": "Comoros"}, "Congo": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/congo/", "country-iso": "CG", "visa-info": "", "advisory-text": "High degree of caution", "name": "Congo"}, "Croatia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/croatia/", "country-iso": "HR", "visa-info": "Irish citizens don’t need a visa to visit Croatia for up to 90 days. However, if you’re planning to stay for longer, please contact the nearest Croatian Embassy or Consulate.Make sure your passport is valid for the duration of your stay in Croatia. We advise you to take a number of photocopies of your passport with you and carry one at all times during your stay.", "advisory-text": "Normal precautions", "name": "Croatia"}, "Cuba": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/cuba/", "country-iso": "CU", "visa-info": "If you are unsure of the entry requirements for Cuba, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Cuba.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Cuba"}, "Cyprus": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/cyprus/", "country-iso": "CY", "visa-info": "You must hold a valid passport to visit Cyprus. However, Irish passport holders don’t require an entry visa into the Republic of Cyprus. You should ensure that your passport is valid for the full duration of your stay.It’s advisable to take a number of photocopies of your passport with you. During your stay, you should carry a photocopy of your passport at all times and should never give your passport as security for car, motorbike or quod bike rentals.", "advisory-text": "Normal precautions", "name": "Cyprus"}, "Denmark": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/denmark/", "country-iso": "DK", "visa-info": "Irish citizens don’t need a visa to enter Denmark.", "advisory-text": "Normal precautions", "name": "Denmark"}, "Djibouti": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/djibouti/", "country-iso": "DJ", "visa-info": "", "advisory-text": "High degree of caution", "name": "Djibouti"}, "Dominica": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/dominica/", "country-iso": "DM", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country's nearest Embassy or Consulate.You can also check with them how long your passport must be valid for. ", "advisory-text": "High degree of caution", "name": "Dominica"}, "Ecuador": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/ecuador/", "country-iso": "EC", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Ecuador"}, "Egypt": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/egypt/", "country-iso": "EG", "visa-info": "", "advisory-text": "High degree of caution", "name": "Egypt"}, "Eritrea": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/eritrea/", "country-iso": "ER", "visa-info": "", "advisory-text": "Avoid non-essential travel", "name": "Eritrea"}, "Estonia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/estonia/", "country-iso": "EE", "visa-info": "Irish citizens don’t need a visa to enter Estonia.", "advisory-text": "Normal precautions", "name": "Estonia"}, "Eswatini ": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/eswatini/", "country-iso": "SZ", "visa-info": "You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Eswatini "}, "Ethiopia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/ethiopia/", "country-iso": "ET", "visa-info": "", "advisory-text": "High degree of caution", "name": "Ethiopia"}, "Fiji": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/fiji/", "country-iso": "FJ", "visa-info": "If you are unsure of the entry requirements for Fiji, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Fiji.You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Fiji"}, "Finland": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/finland/", "country-iso": "FI", "visa-info": "You need a valid passport to visit Finland and we advise you to take a number of photocopies of your passport with you. During your stay you should carry a photocopy of your passport at all times.Irish citizens do not require a visa for Finland. However if you are staying for longer than three months, you are advised to register your details with the Local Register Office.", "advisory-text": "Normal precautions", "name": "Finland"}, "France": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/france/", "country-iso": "FR", "visa-info": "You need a valid passport to visit France and we advise you to take a number of photocopies of your passport with you. During your stay you should carry a photocopy of your passport at all times. Learn more about what to do if your passport is lost/stolen.", "advisory-text": "High degree of caution", "name": "France"}, "Gabon": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/gabon/", "country-iso": "GA", "visa-info": "", "advisory-text": "High degree of caution", "name": "Gabon"}, "Georgia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/georgia/", "country-iso": "GE", "visa-info": "Georgian visa rules have changed with effect from 1 September 2014. Irish and EU nationals do not need a visa to enter Georgia. You can visit for up to 90 days within a period of 180 days. Visit the Georgian Ministry of Foreign Affairs website for more details on entry requirements and how the new rules might affect you.If you want to stay longer than 90 days, you should apply for a temporary or permanent residency permit from the Civil Registration Agency of the Ministry of Justice of Georgia. Overstaying a residency permit can result in immediate deportation and a ban on re-entering Georgian territory for up to one year.", "advisory-text": "Normal precautions", "name": "Georgia"}, "Germany": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/germany/", "country-iso": "DE", "visa-info": "", "advisory-text": "Normal precautions", "name": "Germany"}, "Ghana": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/ghana/", "country-iso": "GH", "visa-info": "Irish nationals need a visa to travel to Ghana. You can’t get a visa at the border, so you will need to organise it before you travel. Contact your nearest Ghanaian embassy or consulate for more information on entry requirements, including how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Ghana"}, "Greece": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/greece/", "country-iso": "GR", "visa-info": "Holders of valid Irish passports do not require an entry visa for Greece.We recommend you take a number of photocopies of your passport, as this will assist in the event that your passport is lost or stolen. We also recommend that you carry photo ID or a copy of your passport with you at all times.", "advisory-text": "Normal precautions", "name": "Greece"}, "Grenada": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/grenada/", "country-iso": "GD", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask you travel agent or contact the country's nearest Embassy or Consulate.You can also check with them how long your passport must be valid for. ", "advisory-text": "Normal precautions", "name": "Grenada"}, "Guadeloupe": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/guadaloupe/", "country-iso": "FR", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country's nearest Embassy or Consulate.You can also check with them how long your passport must be valid for. ", "advisory-text": "Normal precautions", "name": "Guadeloupe"}, "Guatemala": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/guatemala/", "country-iso": "GT", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for. ", "advisory-text": "High degree of caution", "name": "Guatemala"}, "Guinea": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/guinea/", "country-iso": "GN", "visa-info": "", "advisory-text": "High degree of caution", "name": "Guinea"}, "Guyana": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/guyana/", "country-iso": "GY", "visa-info": "", "advisory-text": "High degree of caution", "name": "Guyana"}, "Haiti": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/haiti/", "country-iso": "HT", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate..You can also check with them how long your passport must be valid for. ", "advisory-text": "Avoid non-essential travel", "name": "Haiti"}, "Honduras": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/honduras/", "country-iso": "HN", "visa-info": ".You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Honduras"}, "Hungary": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/hungary/", "country-iso": "HU", "visa-info": "Holders of a valid Irish passport are granted visa-free travel to Hungary on condition that their visit does not exceed the period of 90 days. For a stay exceeding that period, a residence permit is required.", "advisory-text": "Normal precautions", "name": "Hungary"}, "Iceland": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/iceland/", "country-iso": "IS", "visa-info": "Irish citizens don’t need a visa to enter Iceland.", "advisory-text": "Normal precautions", "name": "Iceland"}, "India": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/india/", "country-iso": "IN", "visa-info": "Embassy of India in Dublin.", "advisory-text": "High degree of caution", "name": "India"}, "Indonesia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/indonesia/", "country-iso": "ID", "visa-info": "", "advisory-text": "High degree of caution", "name": "Indonesia"}, "Iran": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/iran/", "country-iso": "IR", "visa-info": "If you are unsure of the entry requirements for Iran, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Iran.You should also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Iran"}, "Iraq": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/iraq/", "country-iso": "IQ", "visa-info": "If you are unsure of the entry requirements for Iraq, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Iraq.You can also check with them how long your passport must be valid for. ", "advisory-text": "Do not travel", "name": "Iraq"}, "Italy": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/italy/", "country-iso": "IT", "visa-info": "", "advisory-text": "Normal precautions", "name": "Italy"}, "Jamaica": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/jamaica/", "country-iso": "JM", "visa-info": "Irish citizens don’t need a visa to enter Jamaica. However, if you are unsure about the entry requirements for Jamaica, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Jamaica.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Jamaica"}, "Japan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/japan/", "country-iso": "JP", "visa-info": "If you are unsure of what the entry requirements for Japan are, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Japan.If you have an Irish passport, you can enter Japan as a visitor for up to 90 days without a visa. You may need to provide evidence of a return or onward ticket. Your passport should be valid for the proposed duration of your stay. We recommend you take a number of photocopies of your passport with you. Japanese law requires you to present your passport when requested by a police officer or other authorised officer, and inability to do so can result in you being taken in for questioning.", "advisory-text": "Normal precautions", "name": "Japan"}, "Jordan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/jordan/", "country-iso": "JO", "visa-info": "Irish Citizens need a visa to enter Jordan. Tourist visas can be purchased on arrival at the Airport (Queen Alia International Airport in Amman, or at Aqaba airport in the south) for 40 JOD. These are valid for one month and can be extended for up to 3 months at a local police station. Visas can also be obtained from the Honorary Consul of Jordan in Dublin.", "advisory-text": "High degree of caution", "name": "Jordan"}, "Kazakhstan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/kazakhstan/", "country-iso": "KZ", "visa-info": "", "advisory-text": "High degree of caution", "name": "Kazakhstan"}, "Kenya": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/kenya/", "country-iso": "KE", "visa-info": "", "advisory-text": "High degree of caution", "name": "Kenya"}, "Kosovo": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/kosovo/", "country-iso": "RS", "visa-info": "", "advisory-text": "Normal precautions", "name": "Kosovo"}, "Kuwait": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/kuwait/", "country-iso": "KW", "visa-info": "If you are unsure of the entry requirements for Kuwait, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Kuwait.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Kuwait"}, "Kyrgyzstan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/kyrgyzstan/", "country-iso": "KG", "visa-info": "Irish citizens don’t need a visa to enter Kyrgyzstan if they’re travelling in the country for up to 60 days.", "advisory-text": "High degree of caution", "name": "Kyrgyzstan"}, "Laos": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/laos/", "country-iso": "LA", "visa-info": "If you’re unsure of the entry requirements for Laos, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Laos. You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Laos"}, "Latvia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/latvia/", "country-iso": "LV", "visa-info": "Irish citizens do not require a visa to enter Latvia for short visits but if remaining for longer than 90 days you are required to obtain a residence permit.When entering Latvia by car and at all times while driving in Latvia, you must have your original vehicle registration certificate, as well as your driving licence, with you.", "advisory-text": "Normal precautions", "name": "Latvia"}, "Lebanon": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/lebanon/", "country-iso": "LB", "visa-info": "Irish citizens need a visa to enter Lebanon, which is usually available on arrival to tourists travelling on ordinary passports. If you want more information on the entry requirements for Lebanon, ask your travel agent or contact the nearest Embassy of Lebanon in London.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Lebanon"}, "Lesotho": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/lesotho/", "country-iso": "LS", "visa-info": "If you intend to visit South Africa before or after Lesotho you should be aware that whilst South African authorities state officially that only one blank passport page is required for entry, there have been reports of some South African officials insisting on two blank pages. ", "advisory-text": "High degree of caution", "name": "Lesotho"}, "Liberia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/liberia/", "country-iso": "LR", "visa-info": "", "advisory-text": "High degree of caution", "name": "Liberia"}, "Libya": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/libya/", "country-iso": "LY", "visa-info": "Irish citizens need a visa for travel to Libya. Contact the nearest Libyan Embassy for more information on visa requirements.", "advisory-text": "Do not travel", "name": "Libya"}, "Lichenstein": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/liechtenstein/", "country-iso": "LI", "visa-info": "If you’re unsure about the entry requirements for Liechtenstein, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Liechtenstein.You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Lichenstein"}, "Lithuania": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/lithuania/", "country-iso": "LT", "visa-info": "Irish citizens don’t need a visa to enter Lithuania. However, entry requirements may change from time to time and you should check with the nearest Lithuanian Embassy before you travel. Lithuania is a member of the Schengen Area.", "advisory-text": "Normal precautions", "name": "Lithuania"}, "Luxembourg": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/luxembourg/", "country-iso": "LU", "visa-info": "", "advisory-text": "Normal precautions", "name": "Luxembourg"}, "Madagascar": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/madagascar/", "country-iso": "MG", "visa-info": "", "advisory-text": "High degree of caution", "name": "Madagascar"}, "Malawi": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/malawi/", "country-iso": "MW", "visa-info": "Irish citizens require a visa in order to enter Malawi.The Malawian government's advice is that Irish citizens should apply for a visa in advance of travel at the nearest Malawian Embassy or High Commission – in the case of Ireland, this is in London.The Malawian High Commission in London can be contacted via their website or on +44(0) 20 7421 6010.", "advisory-text": "High degree of caution", "name": "Malawi"}, "Malaysia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/malaysia/", "country-iso": "MY", "visa-info": "In general, Irish tourists visiting Malaysia for less than 3 months do not require a visa. Malaysian immigration requires international visitors (with the exception of children under 12) to provide fingerprints before entering Malaysia. For full entry requirements for Malaysia, please contact the nearest Malaysian Embassy or Consulate. In general, Irish tourists visiting Malaysia for less than 3 months do not require a visa. Malaysian immigration requires international visitors (with the exception of children under 12) to provide fingerprints before entering Malaysia. For full entry requirements for Malaysia, please contact the nearest Malaysian Embassy or Consulate. We advise you to take a number of photocopies of your passport with you. During your stay you should carry a photocopy of your passport at all times.We advise you to take a number of photocopies of your passport with you. During your stay you should carry a photocopy of your passport at all times.", "advisory-text": "High degree of caution", "name": "Malaysia"}, "Maldives": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/maldives/", "country-iso": "MV", "visa-info": "", "advisory-text": "High degree of caution", "name": "Maldives"}, "Mali": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mali/", "country-iso": "ML", "visa-info": "If you are unsure about the entry requirements for Mali, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for.", "advisory-text": "Do not travel", "name": "Mali"}, "Malta": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/malta/", "country-iso": "MT", "visa-info": "Irish citizens do not require a visa to enter Malta.", "advisory-text": "Normal precautions", "name": "Malta"}, "Martinique": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/martinique/", "country-iso": "MQ", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate..You can also check with them how long your passport must be valid for. ", "advisory-text": "Normal precautions", "name": "Martinique"}, "Mauritania": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mauritania/", "country-iso": "MR", "visa-info": "", "advisory-text": "Avoid non-essential travel", "name": "Mauritania"}, "Mauritius": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mauritius/", "country-iso": "MU", "visa-info": "Irish passport holders don’t need to get a visa before arrival. A visa, normally valid for three months, will be issued on arrival if you hold a valid Irish passport and have a return ticket.", "advisory-text": "Normal precautions", "name": "Mauritius"}, "Mayotte": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mayotte/", "country-iso": "FR", "visa-info": "", "advisory-text": "High degree of caution", "name": "Mayotte"}, "Mexico": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mexico/", "country-iso": "MX", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate..You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Mexico"}, "Moldova": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/moldova/", "country-iso": "MD", "visa-info": "", "advisory-text": "Normal precautions", "name": "Moldova"}, "Monaco": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/monaco/", "country-iso": "MC", "visa-info": "", "advisory-text": "Normal precautions", "name": "Monaco"}, "Mongolia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mongolia/", "country-iso": "MN", "visa-info": "If you're unsure of the entry requirements for Mongolia, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Mongolia. Up-to-date details on visa requirements can also be found at on the website of the Embassy of Mongolia in London.", "advisory-text": "Normal precautions", "name": "Mongolia"}, "Montenegro": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/montenegro/", "country-iso": "ME", "visa-info": "", "advisory-text": "Normal precautions", "name": "Montenegro"}, "Montserrat": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/montserrat/", "country-iso": "MS", "visa-info": ".You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Montserrat"}, "Morocco": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/morocco/", "country-iso": "MA", "visa-info": "Irish passport holders don’t need entry visas for tourist visits to Morocco. If you’re unsure of the entry requirements for Morocco, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Morocco. You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Morocco"}, "Mozambique": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mozambique/", "country-iso": "MZ", "visa-info": "Irish nationals need a visa to enter Mozambique. Travellers arriving from countries without Mozambican representation, such as Ireland, have been able to purchase single-entry visitors’ visas valid for 30 days at the airport or other points of entry.However, the Embassy of Ireland strongly recommends that Irish citizens obtain visas in advance from the High Commission of the Republic of Mozambique, 21 Fitzroy Square, London W1T 6EL, telephone: + 44 (0)20 7383 3800.", "advisory-text": "High degree of caution", "name": "Mozambique"}, "Namibia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/namibia/", "country-iso": "NA", "visa-info": "If you are unsure about the entry requirements for Namibia, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or ConsulateYou can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Namibia"}, "Nepal": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/nepal/", "country-iso": "NP", "visa-info": "If you’re unsure of the entry requirements for Nepal, including visa and other immigration information, ask your travel agent or contact the Embassy of Nepal in London or Embassy or Consulate of Nepal nearest to you.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Nepal"}, "Nicaragua": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/nicaragua/", "country-iso": "NI", "visa-info": ".You can also check with them how long your passport must be valid for. ", "advisory-text": "High degree of caution", "name": "Nicaragua"}, "Niger": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/niger/", "country-iso": "NG", "visa-info": "If you are unsure about the entry requirements for Niger, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for.", "advisory-text": "Avoid non-essential travel", "name": "Niger"}, "Nigeria": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/nigeria/", "country-iso": "NG", "visa-info": "", "advisory-text": "High degree of caution", "name": "Nigeria"}, "Norway": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/norway/", "country-iso": "NO", "visa-info": "You need a valid passport to visit Norway and we advise you to take a number of photocopies of your passport with you. During your stay you should carry a photocopy of your passport at all times. Irish passport holders do not require a visa to enter Norway but should note that all EU citizens living in Norway for more than 3 months must register themselves with the Norwegian Immigration authorities.", "advisory-text": "Normal precautions", "name": "Norway"}, "Oman": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/oman/", "country-iso": "OM", "visa-info": "If you’re unsure of the entry requirements for Oman, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Oman. You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Oman"}, "Pakistan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/pakistan/", "country-iso": "PK", "visa-info": "If you are unsure of the entry requirements for Pakistan, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Pakistan.Your passport must have six months validity.", "advisory-text": "Avoid non-essential travel", "name": "Pakistan"}, "Panama": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/panama/", "country-iso": "PA", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for. ", "advisory-text": "High degree of caution", "name": "Panama"}, "Paraguay": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/paraguay/", "country-iso": "PY", "visa-info": "If you’re unsure of the entry requirements for Paraguay, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Paraguay.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Paraguay"}, "Peru": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/peru/", "country-iso": "PE", "visa-info": "If you are unsure of the entry requirements for Peru, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Peru.You can also check with them how long your passport must be valid for.If you overstay your visa, you’ll need to pay a fine. In the worst case scenario you could be held in detention.", "advisory-text": "High degree of caution", "name": "Peru"}, "Poland": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/poland/", "country-iso": "PL", "visa-info": "You need a valid passport or Passport Card to visit Poland and we advise you to take a number of photocopies or a scan of the passport information page with you. During your stay you should carry a photocopy or scan of your passport information page at all times.You will need a visa to enter Belarus from Poland - this includes anyone travelling by train on the Warsaw-Moscow route.", "advisory-text": "Normal precautions", "name": "Poland"}, "Portugal": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/portugal/", "country-iso": "PT", "visa-info": "You need a valid passport to visit Portugal. You can enter Portugal up to the date of expiry.A significant number of citizens have had their passport seized on arrival in Portugal this year due to the fact that they were travelling on a passport that had been reported lost or stolen sometime in the past. Please make sure that the passport you are travelling on has never been reported lost or stolen, as this will produce an alert on the Schengen Information System and your passport will be apprehended by the Portuguese Immigration Authorities on arrival.", "advisory-text": "Normal precautions", "name": "Portugal"}, "Qatar": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/qatar/", "country-iso": "QA", "visa-info": "Irish citizens can get a free 30 day visa waiver on arrival in Qatar.If you are unsure about the entry requirements for Qatar, including visa and other immigration information, ask your travel agent or contact the nearest Embassy of Qatar in London.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Qatar"}, "Reunion": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/reunion/", "country-iso": "RE", "visa-info": "", "advisory-text": "Normal precautions", "name": "Reunion"}, "Romania": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/romania/", "country-iso": "RO", "visa-info": "", "advisory-text": "Normal precautions", "name": "Romania"}, "Rwanda": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/rwanda/", "country-iso": "RW", "visa-info": "", "advisory-text": "Normal precautions", "name": "Rwanda"}, "Samoa": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/samoa/", "country-iso": "WS", "visa-info": "If you are unsure of the entry requirements for this country, including visa and other immigration information, ask your travel agent or contact the country’s nearest Embassy or Consulate.You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Samoa"}, "Senegal": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/senegal/", "country-iso": "SN", "visa-info": "", "advisory-text": "High degree of caution", "name": "Senegal"}, "Serbia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/serbia/", "country-iso": "RS", "visa-info": "Irish citizens don’t need a visa to visit Serbia for a period of up to 90 days. If you have questions about the entry requirements for Serbia, including visa and other immigration information, ask your travel agent or contact the Embassy of Serbia in London. You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Serbia"}, "Seychelles": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/seychelles/", "country-iso": "SC", "visa-info": "", "advisory-text": "Normal precautions", "name": "Seychelles"}, "Singapore": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/singapore/", "country-iso": "SG", "visa-info": "You don’t normally need a visa to enter Singapore for stays of up to 30 days for tourism, business discussions or social visits.", "advisory-text": "Normal precautions", "name": "Singapore"}, "Slovakia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/slovakia/", "country-iso": "SK", "visa-info": "You must have a valid machine readable Irish passport when entering and leaving Slovakia and you must carry your passport with you at all times as identification. Keep it safe and keep the details separately in case you lose it.  If you’re a tourist or short-term visitor, we recommend that you should also leave a copy of your passport (and travel and insurance documents) with family or friends at home. ", "advisory-text": "Normal precautions", "name": "Slovakia"}, "Slovenia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/slovenia/", "country-iso": "SI", "visa-info": "Irish citizens don’t need a visa to enter Slovenia, but please ensure that your passport is valid for the length of your stay. A number of airlines during the checking-in process require that a passport would also be valid on the date of the return flight.  It is therefore advisable to renew a passport to ensure validity of the passport for the entire period of travel and any visa or other requirements.If you intend staying in Slovenia for a long time, we advise you to register with the Irish Embassy in Slovenia.", "advisory-text": "Normal precautions", "name": "Slovenia"}, "Somalia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/somalia/", "country-iso": "SO", "visa-info": "You can also check with them how long your passport must be valid for.", "advisory-text": "Do not travel", "name": "Somalia"}, "Spain": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/spain/", "country-iso": "ES", "visa-info": "", "advisory-text": "Normal precautions", "name": "Spain"}, "Sudan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/sudan/", "country-iso": "SD", "visa-info": "If you are unsure about the entry requirements for Sudan, including visa and other immigration information, ask your travel agent or contact the Embassy of Sudan in London.You can also check with them how long your passport must be valid for.", "advisory-text": "Avoid non-essential travel", "name": "Sudan"}, "Suriname": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/suriname/", "country-iso": "SR", "visa-info": "You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Suriname"}, "Sweden": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/sweden/", "country-iso": "SE", "visa-info": "Irish citizens don’t need a visa to enter Sweden. You can stay as a visitor for up to three months, but if you intend to stay for longer, you should contact a Migration Board office.", "advisory-text": "Normal precautions", "name": "Sweden"}, "Switzerland": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/switzerland/", "country-iso": "CH", "visa-info": "", "advisory-text": "Normal precautions", "name": "Switzerland"}, "Syria": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/syria/", "country-iso": "SY", "visa-info": "Irish citizens need a visa to enter Syria. For entry requirements, please contact the Embassy of Syria in London.", "advisory-text": "Do not travel", "name": "Syria"}, "Tajikistan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/tajikistan/", "country-iso": "TJ", "visa-info": "For entry requirements for Tajikstan, please contact the Embassy of Tajikistan in London. You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Tajikistan"}, "Tanzania": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/tanzania/", "country-iso": "TZ", "visa-info": "Irish citizens require a visa to enter Tanzania. The current charge for a tourist visa for Irish citizens is US$50. This visa can be obtained on arrival at entry points. Your passport should be valid for a minimum period of 6 months from the date of your visa application.For business/volunteer/working visas, contact the nearest Tanzanian Embassy or High Commission. If you are planning to work or volunteer, you will need a valid work permit. Your employer or volunteer organisation should arrange this before you travel. A separate permit is required if you intend to engage in journalism whilst in Tanzania.", "advisory-text": "High degree of caution", "name": "Tanzania"}, "Thailand": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/thailand/", "country-iso": "TH", "visa-info": "For entry requirements for Thailand, please contact the nearest Embassy or Consulate of Thailand. Irish citizens can obtain permission to stay for up to a month on arrival.", "advisory-text": "High degree of caution", "name": "Thailand"}, "Togo": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/togo/", "country-iso": "TG", "visa-info": "", "advisory-text": "High degree of caution", "name": "Togo"}, "Tunisia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/tunisia/", "country-iso": "TN", "visa-info": "", "advisory-text": "High degree of caution", "name": "Tunisia"}, "Turkey": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/turkey/", "country-iso": "TR", "visa-info": "All Irish citizens require a visa to enter Turkey.", "advisory-text": "High degree of caution", "name": "Turkey"}, "Turkmenistan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/turkmenistan/", "country-iso": "TM", "visa-info": "If you are unsure about the entry requirements for Turkmenistan, including visa and other immigration information, ask your travel agent or contact the Embassy of Turkmenistan in London.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Turkmenistan"}, "Uganda": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/uganda/", "country-iso": "UG", "visa-info": "Irish citizens can get a visa on arrival in Uganda; there is no fee. Irish citizens are not currently required to apply for a visa online, however, this subject to change and we advise citizens to check back here and on the website of Uganda's Directorate of Citizenship and Immigration regularly. It may be useful to print off this page from Uganda's Directorate of Citizenship and Immigration should any issue be encountered at your point of embarkation or transit.", "advisory-text": "High degree of caution", "name": "Uganda"}, "Ukraine": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/ukraine/", "country-iso": "UA", "visa-info": "If you are unsure about the entry requirements for Ukraine, including visa and other immigration information, ask your travel agent or contact the nearest Embassy of Ukraine.Following the illegal annexation of Crimea by the Russian Federation, Russian officials exercising de facto control of the territory are requiring Irish citizens seeking to enter Crimea to have a Russian Federation visa obtained from the nearest Russian Embassy. Those who do not comply with these “visa requirements”, including the expiry date indicated, can be subject to arrest, fines, and/or deportation by those exercising de facto control. It should be noted that the ability of the Embassy to intervene in such cases is extremely limited.You can also check with them how long your passport must be valid for.", "advisory-text": "High degree of caution", "name": "Ukraine"}, "Uruguay": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/uruguay/", "country-iso": "UY", "visa-info": "If you are unsure about the entry requirements for Uruguay, including visa and other immigration information, ask your travel agent or contact the nearest Embassy of Uruguay.You can also check with them how long your passport must be valid for.", "advisory-text": "Normal precautions", "name": "Uruguay"}, "Uzbekistan": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/uzbekistan/", "country-iso": "UZ", "visa-info": "If you are unsure about the entry requirements for Uzbekistan, including visa and other immigration information, ask your travel agent or contact the Embassy of Uzbekistan in London.  You can also check with them how long your passport must be valid for.If you want to travel to Termez and other parts of the Surkhandarya region, you’ll need to apply for a permit from the Ministry of Foreign Affairs in Tashkent.", "advisory-text": "High degree of caution", "name": "Uzbekistan"}, "Venezuela": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/venezuela/", "country-iso": "VE", "visa-info": "You can also check with them how long your passport must be valid for.", "advisory-text": "Avoid non-essential travel", "name": "Venezuela"}, "Vietnam": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/vietnam/", "country-iso": "VN", "visa-info": "Irish citizens require a visa to visit Vietnam.", "advisory-text": "Normal precautions", "name": "Vietnam"}, "Yemen": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/yemen/", "country-iso": "YE", "visa-info": "If you are unsure of what the entry requirements for Yemen are, including visa and other immigration information, ask your travel agent or contact the nearest Embassy or Consulate of Yemen.You can also check with them how long your passport must be valid for.", "advisory-text": "Do not travel", "name": "Yemen"}, "Zambia": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/zambia/", "country-iso": "ZM", "visa-info": "Irish citizens visiting Zambia for less than 90 days do not need a visa in advance, but can obtain a visa-on-arrival subject to the discretion of the local Immigration Officer. Holders of an Irish passport are exempt from the requirement to pay the visa fee.Visitors are usually allowed to remain in the country for the period that corresponds with their air ticket information when they arrive at the port of entry. Please ensure you check the validity of the visa you are given while still at the Visa Counter. Mistakes can be costly and difficult to rectify afterwards.Visas may be extended at the discretion of the immigration department up to a maximum of 90 days. Don’t overstay your visa as you risk a court appearance, imprisonment, fine and/or deportation.", "advisory-text": "High degree of caution", "name": "Zambia"}, "Zimbabwe": {"href": "https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/zimbabwe/", "country-iso": "ZW", "visa-info": "", "advisory-text": "High degree of caution", "name": "Zimbabwe"}}