[{"country_iso": "AF", "name": "Afghanistan", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to: The FCO advise against all travel to all other areas of Kabul and the rest of Afghanistan.", "visa_info": "Visa required["}, {"country_iso": "AL", "name": "Albania", "advisory": "A series of earthquakes occurred in western Albania in the early hours of 26 November. The largest quake, registering 6.4 on the Richter scale, was centred north of the port city of Durres (approximately 20 miles from the capital, Tirana,) and caused extensive damage. There are reports of a high number of casualties and some fatalities. Travellers to Albania should exercise caution at this time and follow the advice of the local authorities. Over 120,000 British nationals visit Albania every year. Most visits are trouble-free.", "visa_info": "Visa not required["}, {"country_iso": "DZ", "name": "Algeria", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to areas within: The FCO advise against all but essential travel to within 30km of the remainder of the border with Tunisia.", "visa_info": "Visa required["}, {"country_iso": "AD", "name": "Andorra", "advisory": "Around 150,000 British nationals visit Andorra every year. Most visits are trouble-free. The European Health Insurance Card (EHIC) isn’t valid in Andorra. Take out comprehensive travel and medical insurance before travelling. See Health", "visa_info": "Visa not required["}, {"country_iso": "AO", "name": "Angola", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to: You should avoid political gatherings and demonstrations, be vigilant and respect advice and instruction given by local security authorities.", "visa_info": "eVi"}, {"country_iso": "AG", "name": "Antigua and Barbuda", "advisory": "The hurricane season in the Caribbean normally runs from June to November. You should monitor local and international weather updates from the US National Hurricane Centre and follow the advice of local authorities, including any evacuation orders. See Natural disasters. The island of Barbuda was seriously hit by Hurricane Irma on 6 September 2017 and further affected by Hurricane Jose on 9 September 2017. Many buildings were destroyed. \nReconstruction work is still taking place. If you’re planning to visit Barbuda you should monitor local and international weather updates, follow the advice of the local authorities and ensure your accommodation is secure.", "visa_info": "Visa not required"}, {"country_iso": "AR", "name": "Argentina", "advisory": "111,638 British nationals visited Argentina in 2018 and most visits to are trouble-free. The most common incidents affecting tourists are distraction thefts, bag snatching, pick pocketing and street robberies. See Crime", "visa_info": "Visa not required"}, {"country_iso": "AM", "name": "Armenia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to within 5km of the border between Armenia and Azerbaijan in the Tavush and Gegharkunik  regions, and along the M16/H26 road between the towns of Ijevan and Noyemberyan. Tensions between Armenia and Azerbaijan over Nagorno-Karabakh continue. The border between Armenia and Azerbaijan is closed. Several ceasefire violations along the Line of Contact separating the opposing forces and elsewhere on the inter-state border between Azerbaijan and Armenia took place in 2018, resulting in a number of deaths and casualties. See Azerbaijan.", "visa_info": "Visa not required"}, {"country_iso": "AU", "name": "Australia", "advisory": "As of November 2019, Australia has already battled several devastating bushfires across a number of regions. These fires have resulted in the loss of lives and property with many residents advised to evacuate their homes until it is safe to return. A Fire Danger Rating system operates across Australia which provides an indication of the possible consequences of a fire, if one was to start. The highest rating of ‘Catastrophic’ has already been issued and it is likely this fire season could see many more areas see this rating applied.", "visa_info": "eVisitor"}, {"country_iso": "AT", "name": "Austria", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit. ", "visa_info": "Visa not required"}, {"country_iso": "AZ", "name": "Azerbaijan", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: Around 30,000 British nationals visit Azerbaijan every year, mainly on business. Most visits are trouble free.", "visa_info": "eVisa"}, {"country_iso": "BS", "name": "Bahamas", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to Grand Bahama and the Abaco Islands. However, travel to other islands of The Bahamas is unaffected. Hurricane Dorian passed over The Bahamas on 2 and 3 September, causing significant and widespread damage to Grand Bahama and the Abaco Islands. Most airports in Grand Bahama and Abaco have reopened. Water, shelter, power supplies and communications access have all been affected, but are now available, though in short supply.  The local authorities on Grand Bahama have set up emergency assistance lines on 351-4902, 351-4903 and 351-4904.", "visa_info": "Visa not required"}, {"country_iso": "BH", "name": "Bahrain", "advisory": "Around 6,000 to 8,000 British nationals live in Bahrain, and thousands more visit each year. Most visits are trouble free. Be aware that all residents and visitors must carry photographic ID. You should be alert to local and regional developments. Localised protests can take place regularly and generally there is a visible security presence. You should be vigilant, follow the advice of the local authorities, and avoid large crowds and demonstrations. If you encounter civil disturbance, leave the area immediately. Travel around Bahrain may be affected at such times. See Demonstrations", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "BD", "name": "Bangladesh", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to the Chittagong Hill Tracts. This does not include the city of Chittagong or other parts of Chittagong Division. See Chittagong Hill Tracts Up to 150,000 British nationals visit Bangladesh every year. Most visits are trouble free.", "visa_info": "Visa on arrival"}, {"country_iso": "BB", "name": "Barbados", "advisory": "The hurricane season normally runs from June to November. You should monitor local and international weather updates from the US National Hurricane Centre and follow the advice of local authorities, including any evacuation orders. See Natural Disasters UK health authorities have classified Barbados as having a risk of Zika virus transmission. For more information and advice, visit the website of the National Travel Health Network and Centre website.", "visa_info": "Visa not required"}, {"country_iso": "BY", "name": "Belarus", "advisory": "You’ll need to have valid medical insurance before travelling to Belarus. You’ll be asked to provide proof of your insurance when you apply for your visa or when you arrive at Minsk airport under the visa-free regime. Contact the Embassy of the Republic of Belarus for full details of what’s required. Although there is no recent history of terrorism in Belarus, attacks cannot be ruled out. \nAttacks could happen anywhere and could affect western interests and places visited by foreigners. See Terrorism", "visa_info": "Visa not required"}, {"country_iso": "BE", "name": "Belgium", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "BZ", "name": "Belize", "advisory": "13,444 British nationals visited Belize in 2017. Most visits are trouble free. There has been an increase in violent incidents against tourists and expatriate residents. You should take precautions against crime throughout Belize, in particular the Southside area of Belize City, due to dangerous gang violence and gun crime. See Crime", "visa_info": "Visa not required"}, {"country_iso": "BJ", "name": "Benin", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to the Parc du W and the contiguous hunting zones of Meêkrou and Djona. The Parc is tri-national and shares an open border with Burkina Faso and Niger. There is a risk of terrorist attacks throughout the Parc. See Terrorism The FCO advise against all travel to the Pendjari National Park and adjacent hunting grounds; the area between the Parc du W National Park and the border with Niger; and to all other areas within 5km of the border with Burkina Faso.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "BT", "name": "Bhutan", "advisory": "You must arrange any visit to Bhutan through an authorised travel agent well in advance. See Entry requirements. Britain is represented in Bhutan by an Honorary Consul. Consular support is not available from the British government in Bhutan. However, the British Deputy High Commission in Kolkata, India can provide consular support to British nationals.", "visa_info": "Visa required"}, {"country_iso": "BO", "name": "Bolivia", "advisory": "The Foreign and Commonwealth Office advise against all but essential travel to Bolivia. If you’re in Bolivia, you should keep your departure options under review. If you need urgent consular assistance, contact the British Embassy La Paz on (591 2) 2433424. The British Embassy’s ability to travel to deliver consular services is very limited at this time.", "visa_info": "Visa not required"}, {"country_iso": "BA", "name": "Bosnia and Herzegovina", "advisory": "Around 9,000 British nationals visit Bosnia and Herzegovina every year. Most visits are trouble-free. Unexploded landmines remain a real danger, particularly in isolated areas in the mountains and countryside. Flooding and landslides in previous years have moved minefields and destroyed some of the minefield markings. For latest updates on mines see the Mine Action Centre website. See Local travel", "visa_info": "Visa not required"}, {"country_iso": "BW", "name": "Botswana", "advisory": "Around 42,000 British nationals visit Botswana every year. Most visits are trouble free. On 23 October, Botswana will hold parliamentary elections. Political rallies and demonstrations may take place and you should follow local security advice.", "visa_info": "Visa not required"}, {"country_iso": "BR", "name": "Brazil", "advisory": "154,586 British nationals visited Brazil in 2018. Despite high crime levels, most visits are trouble free. You are likely to see a heavy police presence on the streets, particularly in Rio de Janeiro, including occasional checkpoints. Cars are usually slowed down to single file and have to drive past with windows down. If you’re asked to stop by the police at a checkpoint, stay calm and follow the instructions given.", "visa_info": "Visa not required"}, {"country_iso": "BN", "name": "Brunei", "advisory": "Around 13,000 British nationals visit Brunei every year (source: Brunei Immigration). Most visits are trouble free. Although there’s no recent history of terrorism in Brunei, attacks can’t be ruled out. See Terrorism", "visa_info": "Visa not required"}, {"country_iso": "BG", "name": "Bulgaria", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit. ", "visa_info": "Visa not required"}, {"country_iso": "BF", "name": "Burkina Faso", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to the rest of Burkina Faso, including the capital Ouagadougou.", "visa_info": "Visa on arrival"}, {"country_iso": "BI", "name": "Burundi", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to the rest of Burundi.", "visa_info": "Visa required"}, {"country_iso": "KH", "name": "Cambodia", "advisory": "Around 162,395 British nationals visited Cambodia in 2017. Most visits are trouble-free but there have been reports of assaults and robberies against foreigners. See Crime UK health authorities have classified Cambodia as having a risk of Zika virus transmission. For information and advice about the risks associated with Zika virus, visit the National Travel Health Network and Centre website.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "CM", "name": "Cameroon", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Visa required"}, {"country_iso": "CA", "name": "Canada", "advisory": "Around 724,000 British nationals visit Canada each year. Most visits are trouble free. Visitors travelling to Canada by air are now expected to get an electronic travel authorisation (eTA) to enter Canada. For more information about the eTA system, and to apply online, visit the official Canadian government website. See Entry requirements", "visa_info": "Visa not required"}, {"country_iso": "CV", "name": "Cape Verde", "advisory": "Most visits to Cape Verde are trouble-free, but you should take sensible precautions against petty crime. See Crime UK health authorities have classified Cape Verde as having a moderate risk of Zika virus transmission. There is also a low risk of malaria in the capital city, Praia (Santiago Island). For more information and advice, visit the website of the National Travel Health Network and Centre website. See Health", "visa_info": "Visa not required"}, {"country_iso": "CF", "name": "Central African Republic", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to central Bangui between the Airport and the Oubangui river, as shown on the map. This area is bordered to the north by Avenue des Martyrs and Avenue de l’Indépendance linked by Avenue Koudoukou and bordered to the south by Avenue de France and Avenue Barthélemy Boganda linked by Avenue Ruth Roland. It includes the riverside area of the city centre (around Boulevard du Géneral de Gaulle) including the UNESCO building, the French Embassy and the Hotel Oubangi.", "visa_info": "Visa required"}, {"country_iso": "TD", "name": "Chad", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to all remaining parts of the country including the capital, N’Djamena and the town of Faya Largeau.", "visa_info": "Visa required"}, {"country_iso": "CL", "name": "Chile", "advisory": "Since 18 October there have been large demonstrations across Chile. Protests have resulted in incidents of violence and travel disruption in cities and towns, including Santiago, Temuco, Iquique, Conception and Rancagua. There have been reports of looting and clashes in parts of Punta Arenas, Santiago, Viña del Mar, Arica, Puerto Montt, Valparaiso, Antofagasta, and Iquique. Large demonstrations are expected in Santiago and other cities on a daily basis and there is a risk of violence associated with them. Police resources may be limited and support to respond to incidents slower than normal. In Santiago, protests are expected to take place in Las Condes, Providencia and Vitacura where the British Embassy and many international hotels are located. At present, the Chilean Government recommends tourists avoid Plaza Baquedano/Plaza Italia.  The Chilean Government also recommends tourists avoid the centre of Valparaiso city.", "visa_info": "Visa not required"}, {"country_iso": "CN", "name": "China", "advisory": "Over 595,000 British nationals visited mainland China in 2017. Most visits are trouble free but you should always take out comprehensive travel and medical insurance before you travel. British nationals normally need a visa to enter mainland China, including Hainan Island, but not Hong Kong or Macao. See Visas", "visa_info": "Visa required"}, {"country_iso": "CO", "name": "Colombia", "advisory": "The FCO advises against all but essential travel to: Following a national strike on 21 November, there have been continued protests throughout Colombia. In response, authorities have been implementing additional security measures, including curfews, at short notice. There is significant disruption to transport services. You should remain vigilant, avoid all demonstrations and monitor local media for the latest information.", "visa_info": "Visa not required"}, {"country_iso": "KM", "name": "Comoros", "advisory": "You will need a visa to enter Comoros. Visas are available on arrival at the airport or other points of entry. See Visas Comoros can be affected by tropical cyclones between January and May. You should monitor regional and international weather updates from the World Meteorological Organisation. See Natural disasters", "visa_info": "Visa on arrival"}, {"country_iso": "CG", "name": "Republic of the Congo", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Visa required[100]["}, {"country_iso": "CG", "name": "Democratic Republic of the Congo", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Visa required[102]["}, {"country_iso": "CR", "name": "Costa Rica", "advisory": "Around 95,000 British nationals visited Costa Rica in 2018. Most visits are trouble-free, but incidents of violent crime against tourists have increased. There have been incidents of robbery at gunpoint involving groups of British visitors, and 2 incidents in August 2018 which led to the deaths of tourists. See Crime There has been disruption to local travel and public services due to protests and strikes by various groups opposed to certain Government policies. These have taken place in different locations around the country, at times affecting access to San Jose airport, and could reoccur without warning. Check local traffic information before planning your journey and avoid demonstration gatherings. See Safety and security", "visa_info": "Visa not required["}, {"country_iso": "CI", "name": "Côte d'Ivoire", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to within 20km of the border with Liberia. See Local travel There were incidents of violence and intimidation during local elections in October 2018 and re-runs in December 2018. Political tensions continue to be heightened following these elections, particularly in the central Plateau district of Abidjan. You should exercise caution and, in the event of unrest, monitor local media and follow instructions given by local police and security personnel. You should avoid large public gatherings and political rallies. See  Security", "visa_info": "eVisa["}, {"country_iso": "HR", "name": "Croatia", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit. ", "visa_info": "Visa not required["}, {"country_iso": "CU", "name": "Cuba", "advisory": "The hurricane season in Cuba normally runs from June to November. You should monitor weather updates and track the progress of approaching storms. See Hurricanes The Cuban Government has announced that it is taking measures to manage electricity and fuel supplies in the coming days and weeks in view of limited stocks and deliveries of oil in September.  Government measures include prioritising supplies for essential services.  The Government has said there will be notice of any planned power cuts.  Transport services, including trains and buses, are being reduced. Tour operators, hotels and owners of casas particulares will be aware if their services are to be affected.", "visa_info": "Tourist Card required["}, {"country_iso": "CY", "name": "Cyprus", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "CZ", "name": "Czech Republic", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "DK", "name": "Denmark", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "DJ", "name": "Djibouti", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to the border with Eritrea. See Local travel Terrorists are likely to try to carry out attacks in Djibouti. Attacks can’t be ruled out and could be indiscriminate, including in places frequented by expatriates and foreign travellers. See Terrorism", "visa_info": "eVisa["}, {"country_iso": "DM", "name": "Dominica", "advisory": "General elections have been announced for 6 December.  Visitors may see an increase in political marches and gatherings in the lead up to the elections. You should be alert to the situation around you in case of unrest and avoid large crowds and demonstrations. The hurricane season in the Caribbean normally runs from June to November. You should monitor local and international weather updates from the US National Hurricane Center and follow the advice of local authorities, including any evacuation orders. See Natural disasters.", "visa_info": "Visa not required["}, {"country_iso": "DO", "name": "Dominican Republic", "advisory": "The hurricane season normally runs from June to November. You should monitor local and international weather updates from the US National Hurricane Center and follow the advice of local authorities, including any evacuation orders. Spanish language alerts are available from the Dominican Emergency Management Centre (COE) via their mobile app ‘AlertaCOE’, or on their Twitter account. See Natural disasters 179,000 British nationals visited the Dominican Republic in 2017. Most visits are trouble-free, but there are incidents of crime and violence. See Crime", "visa_info": "Visa not required["}, {"country_iso": "EC", "name": "Ecuador", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel within the 20km exclusion zone along the border with Colombia, except for the official border crossing town of Tulcan in Carchi province. The FCO advise against all but essential travel to:", "visa_info": "Visa not required["}, {"country_iso": "EG", "name": "Egypt", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to the Governorate of North Sinai. The FCO advise against all but essential travel to:", "visa_info": "eVisa / Visa on arrival[115]["}, {"country_iso": "SV", "name": "El Salvador", "advisory": "Most visits to El Salvador are trouble free. However, El Salvador has one of the highest crime rates in Latin America so you should take extra care. Take particular care in downtown San Salvador and on roads outside major towns and cities, especially at night. Avoid wearing expensive jewellery or displaying valuable items. Safeguard your passport, mobile phone and cash against pickpockets. See Crime UK health authorities have classified El Salvador as having a risk of Zika virus transmission. For more information and advice, visit the website of the National Travel Health Network and Centre website.", "visa_info": "Visa not required["}, {"country_iso": "GQ", "name": "Equatorial Guinea", "advisory": "Consular support is not available from the British government in Equatorial Guinea. However, the British High Commission in Yaoundé, Cameroon or the Honorary Consul can provide consular support to British nationals. Be alert and take sensible personal security precautions. Roadblocks and unannounced identification checks are likely. Carry an appropriate form of identification (passport or residence permit) with you at all times. See Crime and Road travel", "visa_info": "Visa required[118]["}, {"country_iso": "ER", "name": "Eritrea", "advisory": "The FCO advise against all travel within 25km of Eritrea’s land borders, with the exceptions of: the towns of Senafe and Tessenei; the border crossings at Debay Sima – Burre, Serha – Zalambessa and Kesadika (Adi Kuala) – Rama, plus the main paved roads leading to those crossings (as displayed on the map). All border crossings between Ethiopia and Eritrea are currently closed. See Local travel All foreign nationals, including diplomats, must apply in advance for a travel permit to leave the Asmara region. See Travel permits and Consular assistance", "visa_info": "Visa required[120]["}, {"country_iso": "EE", "name": "Estonia", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "SZ", "name": "Eswatini", "advisory": "On 19 April 2018, King Mswati III announced that Swaziland had officially changed its name to Eswatini. Consular support is limited in Eswatini as the British High Commission does not provide consular services. If you’re in Eswatini and need urgent help from the UK government, call +27 12 421 7500. If you’re in the UK and worried about a British national in Eswatini, call 020 7008 1500. The British High Commission in Pretoria can provide consular support to British nationals in Eswatini.", "visa_info": "Visa not required["}, {"country_iso": "ET", "name": "Ethiopia", "advisory": "The Foreign and Commonwealth Office (FCO) advises against all travel to: The FCO advise against all but essential travel to:", "visa_info": "eVisa / Visa on arrival["}, {"country_iso": "FJ", "name": "Fiji", "advisory": "General elections were held in Fiji in November 2018 returning the ruling Fiji First Party to govern for the next four years. See Political situation Cyclone season is normally between November and April but cyclones can occur throughout the year. Severe weather may result in flooding, landslides, and disruption to essential services and infrastructure. You should monitor weather updates from the Fiji Meteorological Service, in local newspapers and on Radio Fiji 2 on 105 FM, and follow the advice of the local authorities including any evacuation orders. See our Tropical Cyclones page for further advice about what to do if you’re caught up in a storm. See Natural disasters", "visa_info": "Visa not required["}, {"country_iso": "FI", "name": "Finland", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "FR", "name": "France", "advisory": "Most visits to Mayotte are trouble-free. Although there’s no recent history of terrorism in Mayotte, attacks can’t be ruled out. See Terrorism", "visa_info": "Visa not required["}, {"country_iso": "GA", "name": "Gabon", "advisory": "On 7 January there was a failed coup attempt by a small group of military officers. Following a few hours of sporadic gunfire in Libreville, the situation was brought back under control. Political stability in Gabon remains uncertain following the result of the 2016 presidential election, with violent clashes occurring between demonstrators and security forces at that time. Further protests may quickly turn violent without warning. You should avoid all demonstrations and rallies and remain vigilant during periods of unrest.  See Political situation. During periods of unrest, police checks may increase. Make sure you have all required documentation with you and avoid large gatherings.", "visa_info": "eVisa / Visa on arrival["}, {"country_iso": "GM", "name": "Gambia", "advisory": "Most visits to The Gambia are trouble-free, although independent travellers are at increased risk due to the lack of local support in an emergency. If you’re travelling independently, make sure next of kin in the UK have details of your itinerary and keep in regular touch. Take out comprehensive travel and medical insurance before you travel. In January 2017, The Gambia experienced a peaceful handover of power to President Adama Barrow and his coalition government.", "visa_info": "Visa not required["}, {"country_iso": "GE", "name": "Georgia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to the breakaway regions of South Ossetia and Abkhazia, and against all but essential travel to areas immediately adjacent to the Administrative Boundary Lines with Abkhazia and South Ossetia. The British government does not recognise the unilateral declarations of independence made by the de facto authorities in the breakaway regions of Abkhazia and South Ossetia. Consular support is not available in parts of Georgia where the FCO advise against all travel. See Local travel", "visa_info": "Visa not required["}, {"country_iso": "DE", "name": "Germany", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "GH", "name": "Ghana", "advisory": "Around 90,000 British nationals visit Ghana every year. While most visits are trouble-free, crime does occur. In recent years, reported crime has increased, particularly over the Christmas period. Criminal activity ranging from petty street crime, to violent crime can occur at any time. Take sensible precautions. Be particularly vigilant in public areas, and take care when travelling by road. See Crime It’s mandatory for all foreign nationals resident in Ghana to register with the National Identification Authority (NIA) of Ghana and get a non-citizen Ghana card. See Local laws and customs", "visa_info": "Visa required[135]["}, {"country_iso": "GR", "name": "Greece", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "GD", "name": "Grenada", "advisory": "The hurricane season in Grenada normally runs from June to November. You should monitor local and international weather updates from the US National Hurricane Center and follow the advice of local authorities, including any evacuation orders. See Natural disasters UK health authorities have classified Grenada as having a risk of Zika virus transmission. For more information and advice, visit the National Travel Health Network and Centre website.", "visa_info": "Visa not required["}, {"country_iso": "GT", "name": "Guatemala", "advisory": "On 4th September, the Guatemalan President declared a State of Siege for a period of 30 days, starting from Saturday 7th September.  On 7th October the Government announced that the State of Siege will continue for a further 30 days in all the following departments and towns:  Izabal; El Estor, Morales and Los Amates; Alta Verapaz, towns of Tactic, Senahu, Tamahu, Tucuru, Panzos, Santa Maria Cahabon, Santa Catalina la Tinta, Chahal and Fray Bartolome de las Casas; Zacapa, towns of Gualan, Rio Hondo, Teculutan and Usumatlan; El Progreso, towns of San Agustin Acasaguastlan and San Cristobal Acasaguastlan; Baja Verapaz, town of Purulha; Peten, town of San Luis. The State of Siege was declared following reports of violence in the area of El Estor, Izabal. The State of Siege may impact on your ability to move freely around these named provinces. This measure has now been approved by Congress and the State of Siege has expanded to the towns of Puerto Barrios and Livingston in the Department of Izabal. See Local travel Guatemala held national elections on Sunday 16th June, with  the second round of Presidential Elections taking place on 11th August. The new government is due to take power in January 2020, following the inauguration of the president-elect in early January.  Avoid all political demonstrations and monitor local news channels. Large demonstrations occur throughout Guatemala, including in Guatemala City and other major towns, often with little or no notice. There may be disruptions to traffic and public transport. You should remain cautious and avoid any demonstrations. See Political situation", "visa_info": "Visa not required["}, {"country_iso": "GN", "name": "Guinea", "advisory": "The National Front for the Defence of the Constitution (FNDC) has announced further demonstrations for Thursday 14 November. There have been weekly demonstrations across Conakry and in other towns throughout Guinea since October 2019, which have led to significant travel disruption and a number of violent incidents, including deaths. You should remain vigilant, stay clear of areas where demonstrators are gathering and monitor local media. Outbreaks of violence occurred across the country following local elections in February 2018. “Villes mortes” (general strikes) happen intermittently. See Political situation", "visa_info": "eVisa["}, {"country_iso": "GW", "name": "Guinea-Bissau", "advisory": "Guinea-Bissau suffers from political instability.  The country is scheduled to hold Presidential Elections on 24 November 2019.  Ahead of these elections, there has been an increase in civil unrest, street demonstrations and large public gatherings, which you should avoid. You should exercise a high degree of caution should you decide to travel to Guinea-Bissau. In the event of any political unrest you should follow the advice of local authorities. Although the security situation is currently calm, you should stay alert to local developments and avoid sensitive areas like military installations. You should also avoid any demonstrations. See Political situation", "visa_info": "eVisa / Visa on arrival["}, {"country_iso": "GY", "name": "Guyana", "advisory": "Most visits to Guyana are trouble-free. Crime levels are high. You should take sensible precautions to protect yourself and your belongings.", "visa_info": "Visa not required["}, {"country_iso": "HT", "name": "Haiti", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to Haiti due to the current unstable and dangerous security situation.  If you are in Haiti, you should consider carefully whether you need to remain, and keep your departure options under close review. There have been sporadic, unpredictable and sometimes violent demonstrations, protests and roadblocks in Port au Prince and throughout Haiti since July 2018, with a notable increase in civil unrest in the weeks since 2 September 2019. The movement of goods and people into and within the country is often disrupted due to blocked roads and security incidents. As a consequence, there are sometimes fuel and food shortages. There are currently no UK diplomats in country, although the Embassy remains open.", "visa_info": "Visa not required["}, {"country_iso": "HN", "name": "Honduras", "advisory": "There’s no British Embassy in Honduras.  Consular support may be limited in Honduras, with the exception of Tegucigalpa and the Bay Islands, and severely limited in more remote areas.  See Consular assistance Honduras is seeing a sharp increase in cases of dengue fever, especially in children.  As a result, the Honduran Government has declared a state of emergency.  The most affected departments are Cortés, Yoro, Olancho, and Santa Bárbara, and the San Pedro Sula metropolitan area.  For information on avoidance, please visit the National Travel Health Network and Centre Website", "visa_info": "Visa not required["}, {"country_iso": "HU", "name": "Hungary", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required["}, {"country_iso": "IS", "name": "Iceland", "advisory": "Approximately 298,000 British nationals visited Iceland through Keflavik airport in 2018. Most visits are trouble-free. If you’re living in or moving to Iceland, visit our Living in Iceland guide in addition to this travel advice.", "visa_info": "Visa not required["}, {"country_iso": "IN", "name": "India", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The tourist destinations of Pahalgam, Gulmarg and Sonamarg, the city of Srinagar and the Jammu-Srinagar national highway are within the areas where the FCO advise against all travel.", "visa_info": "e-Visa["}, {"country_iso": "ID", "name": "Indonesia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: These are exclusion zones put in place by the local authorities due to ongoing volcanic activity. If you’re in either exclusion zone, you should leave immediately. See Mount Agung and Mount Sinabung", "visa_info": "Visa not required["}, {"country_iso": "IR", "name": "Iran", "advisory": "The Foreign and Commonwealth Office (FCO) advise all British nationals against all travel to: Additionally, the FCO advise British-Iranian dual nationals against all travel to Iran.", "visa_info": "Visa required["}, {"country_iso": "IQ", "name": "Iraq", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to the rest of Iraq, including the remainder of the Kurdistan region.", "visa_info": "Visa required"}, {"country_iso": "IE", "name": "Ireland", "advisory": "In addition to this travel advice, view the latest updates for UK nationals travelling to and living in Europe. Around 3 million British nationals visit Ireland each year. Most visits are trouble free.", "visa_info": "Visa not required"}, {"country_iso": "IL", "name": "Israel", "advisory": "This travel advice covers Israel and the Occupied Palestinian Territories The Foreign and Commonwealth Office (FCO) advise against all travel to:", "visa_info": "Visa not required"}, {"country_iso": "IT", "name": "Italy", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "JM", "name": "Jamaica", "advisory": "Over 217,000 British nationals visited Jamaica in 2017. Most visits are trouble-free. There are high levels of crime and violence, particularly in the capital Kingston. See Crime", "visa_info": "Visa not required"}, {"country_iso": "JP", "name": "Japan", "advisory": "330,000 British nationals visited Japan in 2018. Most visits are trouble free. Follow the British Embassy Tokyo on Facebook and Twitter for updates and more information about Japan.", "visa_info": "Visa not required"}, {"country_iso": "JO", "name": "Jordan", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to within 3km of Jordan’s border with Syria. The British Embassy is in contact with local authorities and urgently seeking further information following reports of an ongoing incident at the Roman city of Jerash, with a number of casualties. If you’re in the area, you should remain vigilant and follow the advice of local authorities. This travel advice will be updated as the situation develops.", "visa_info": "Free visa on arrival"}, {"country_iso": "KZ", "name": "Kazakhstan", "advisory": "On 20 March 2019, the capital of Kazakhstan, Astana, was formally renamed Nur-Sultan. However, the previous name is likely to be widely used for some time. The border between Kazakhstan and Turkmenistan is currently closed to traffic. You’re advised not to try to cross the road border but to seek alternative routes, such as via Uzbekistan, until further notice.", "visa_info": "Visa not required"}, {"country_iso": "KE", "name": "Kenya", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to: The areas to which the FCO advise against all but essential travel (marked in amber on the map above) don’t include Kenya’s safari destinations in the national parks, reserves and wildlife conservancies (including the Aberdare National Park, Amboseli, Laikipia, Lake Nakuru, Masai Mara, Meru, Mount Kenya, Samburu, Shimba Hills and Tsavo), nor does it include the beach resorts of Mombasa, Malindi, Kilifi, Watamu, Diani, Lamu Island and Manda Island, or Mombasa (Moi International), Malindi and Manda airports. If you travel to Lamu Island or Manda Island, you should do so by air to Manda airport and not by road.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "KI", "name": "Kiribati", "advisory": "Most visits to Kiribati are trouble-free. However, petty theft can occur and you should take care with personal possessions. Women travelling on their own should take care, particularly at night. The wet season normally runs from November to April. Severe weather may result in flooding, coastal inundation and disruption to essential services and infrastructure. See Natural disasters", "visa_info": "Visa not required"}, {"country_iso": "KP", "name": "North Korea", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to North Korea (DPRK). Few British people visit North Korea.  Those that do are usually part of an organised tour.  If you decide to visit North Korea, follow the advice of your tour group and the local authorities. Failure to do so could put your personal safety at risk.", "visa_info": "Visa required"}, {"country_iso": "KR", "name": "South Korea", "advisory": "Around 140,000 British nationals visit South Korea every year. Most visits are trouble-free. A revised Korean Traffic Law came into effect on 25 June 2019. See Road travel", "visa_info": "Visa not required"}, {"country_iso": "KW", "name": "Kuwait", "advisory": "Around 8,000 British nationals live in Kuwait and a further 10,000 visit each year. Most visits to Kuwait are trouble-free. You must carry your passport or a Kuwait civil identification card at all times.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "KG", "name": "Kyrgyzstan", "advisory": "Terrorist attacks in Kyrgyzstan can’t be ruled out. You should be vigilant in public places and follow security advice from the local authorities. See Terrorism. Take care if you travel to the Oblasts (Provinces) of Osh, Batken and Jalal-Abad. See Local travel", "visa_info": "Visa not required"}, {"country_iso": "LA", "name": "Laos", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to Xaisomboun province. The monsoon season in Laos runs from May to October. You should be aware of elevated risks of flooding and landslides during this period, particularly if travelling by road as maintenance and repair standards differ to the UK, you should take additional care and undertake research. See Natural disasters", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "LV", "name": "Latvia", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "LB", "name": "Lebanon", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Free visa on arrival"}, {"country_iso": "LS", "name": "Lesotho", "advisory": "Consular support is limited in Lesotho as the British High Commission does not provide consular services. If you’re in Lesotho and need urgent help from the UK government, call +27 12 421 7500. If you’re in the UK and worried about a British national in Lesotho, call 020 7008 1500. The British High Commission in Pretoria can provide consular support to British nationals in Lesotho. Most visits to Lesotho are trouble free.", "visa_info": "Visa not required"}, {"country_iso": "LR", "name": "Liberia", "advisory": "Protests and demonstrations do take place in Monrovia on occasion. You should avoid protests, demonstrations, large gatherings and crowds and follow the advice of local authorities. Terrorists are likely to try to carry out attacks in Liberia. Attacks could be indiscriminate. You should be vigilant, especially in places visited by foreigners. See Terrorism", "visa_info": "Visa required"}, {"country_iso": "LY", "name": "Libya", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to Libya, and for British nationals still in Libya to leave immediately by any practical means. This advice has been in place consistently since 2014. Local security situations are fragile and can quickly deteriorate into intense fighting and clashes without warning. Consular support is not available from the British government from within Libya, as consular operations remain suspended. If you need to speak to a consular officer in the UK, call the FCO in London on +44 (0)20 7008 1500.", "visa_info": "Visa required"}, {"country_iso": "LI", "name": "Liechtenstein", "advisory": "The British government is not represented in Liechtenstein. However, consular support to British nationals can be provided through the British Embassy in Berne, Switzerland. British nationals make around 2,200 visits to Liechtenstein every year (source: Liechtenstein Office for Statistics). Most visits are trouble-free.", "visa_info": "Visa not required"}, {"country_iso": "LT", "name": "Lithuania", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "LU", "name": "Luxembourg", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "MG", "name": "Madagascar", "advisory": "Most visits to Madagascar are trouble-free. If possible, you should travel with established organisations or travel companies who know the terrain and have the capacity to warn of potential hazards. If hiring a guide in country, the National Tourism Office advises visitors to use the services of members of the Professional Tour Operators Association PTO. You will need a visa to enter Madagascar. You can get a tourist visa on arrival at the airport or an e-visa online before you travel. See Visas", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "MW", "name": "Malawi", "advisory": "The results of Malawi’s May 2019 elections are being challenged in the High Court by two political parties. Protests have taken place in central Lilongwe and elsewhere in Malawi and have at times turned violent, with some reports of looting and damage to property. Further protests are possible. See Political situation On 8 March 2019 the President of Malawi declared a State of Disaster in areas of southern Malawi affected by heavy floods. The floods caused at least 45 deaths and more than 80,000 people have been displaced. If travelling to affected regions, you should take extra care and follow the advice of local authorities.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "MY", "name": "Malaysia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to all islands off the coast of eastern Sabah from Kudat to Tawau, including (but not limited to) Lankayan, Mabul, Pom Pom, Kapalai, Litigan, Sipadan and Mataking. Terrorists are very likely to try to carry out attacks in Malaysia. Attacks could happen anywhere, including in places visited by foreigners. Be vigilant, monitor local media and follow the advice of the local authorities.", "visa_info": "Visa not required"}, {"country_iso": "MV", "name": "Maldives", "advisory": "Most visits to Maldives are trouble free. The most common problems faced by visiting British nationals are lost and stolen passports, and swimming and diving related accidents. See Safety and security Political protests in the capital Malé have subsided since the presidential election in September 2018 and the inauguration of a new president in November 2018.  You should continue to exercise caution and avoid any protests or rallies. Outlying islands, resorts or Malé International Airport are not usually affected by protests or rallies.", "visa_info": "Free visa on arrival"}, {"country_iso": "ML", "name": "Mali", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to the rest of Mali, including Bamako.", "visa_info": "Visa required"}, {"country_iso": "MT", "name": "Malta", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "MH", "name": "Marshall Islands", "advisory": "Cyclone season is normally between November and April but cyclones can occur throughout the year. Severe weather may result in flooding, landslides, and disruption to essential services and infrastructure. See Natural disasters The Government of the Republic of the Marshall Islands has declared a state of health emergency due to an outbreak of Dengue fever.  A number of travel restrictions are in place and you should follow advice from the Ministry of Health and Human Services. Further information on Dengue, including symptoms, is available on the National Travel Health Network and Centre (NaTHNaC)", "visa_info": "Visa not required"}, {"country_iso": "MR", "name": "Mauritania", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to the rest of the country, including the Nouakchott - Nouadhibou corridor.", "visa_info": "Visa on arrival"}, {"country_iso": "MU", "name": "Mauritius", "advisory": "Around 140,000 British tourists visit Mauritius every year. Most visits are trouble free. You don’t need a visa to enter Mauritius. On arrival, your passport will be stamped allowing entry to the country for 60 days. You’ll need to be able to provide evidence of onward or return travel. See Visas", "visa_info": "Visa not required"}, {"country_iso": "MX", "name": "Mexico", "advisory": "There are currently large numbers of migrants moving en masse from Honduras through Guatemala to Mexico and beyond. This is having an impact on border crossings. The situation is fluid but borders crossings at Tecun Uman (Guatemala/Mexico), Agua Caliente (Honduras/Guatemala) and Tijuana (Mexico/USA) are currently affected and subject to periodic closures. You’re advised to check with local authorities and tour operators before attempting to cross land borders. The hurricane season normally runs from June to November and affects both the Pacific and Atlantic coasts. Be aware that effects of tropical storms and hurricanes can span hundreds of miles from the centre of the storm, causing flooding, landslides and disruption to local services, including transport. See Natural disasters", "visa_info": "Visa not required"}, {"country_iso": "FM", "name": "Micronesia", "advisory": "Cyclone season is normally between November and April but cyclones can occur throughout the year. Severe weather may result in flooding, landslides, and disruption to essential services and infrastructure. See Natural disasters Only a few British tourists visit the Federated States of Micronesia every year. Most visits are trouble-free. See Crime", "visa_info": "Visa not required"}, {"country_iso": "MD", "name": "Moldova", "advisory": "Most visits to Moldova are trouble free. You should be alert to the possibility of protests and demonstrations. While these are generally peaceful, the situation could quickly change. If you’re in Moldova, keep up to date with developments and take extra care. You should avoid large crowds, remain vigilant and follow the advice of local authorities.", "visa_info": "Visa not required"}, {"country_iso": "MC", "name": "Monaco", "advisory": "Terrorist attacks in Monaco can’t be ruled out. See Terrorism Most visits are trouble-free.", "visa_info": "Visa not required"}, {"country_iso": "MN", "name": "Mongolia", "advisory": "Mongolia takes border security very seriously and foreign nationals aren’t routinely permitted access to border areas. The authorities can regard zones of up to 100km inside the border as a border area. If you wish to travel in these areas, you must get permission from the State Frontier Guard Authority. Only a few specified land border crossings are open to foreigners. See Border crossings Although there’s no recent history of terrorism in Mongolia, attacks can’t be ruled out. See Terrorism.", "visa_info": "Visa required"}, {"country_iso": "ME", "name": "Montenegro", "advisory": "Most visits to Montenegro are trouble-free. Terrorist attacks in Montenegro can’t be ruled out. See Terrorism", "visa_info": "Visa not required"}, {"country_iso": "MA", "name": "Morocco", "advisory": "Almost 700,000 visitors from the UK come to Morocco every year. Most visits are trouble-free. Morocco is a Muslim country which follows Islamic laws and customs. You should respect these at all times. See Local Laws and Customs", "visa_info": "Visa not required"}, {"country_iso": "MZ", "name": "Mozambique", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to the districts of Nangade, Quissanga, Ibo, Macomia, Mocimboa da Praia, Palma and Meluco in Cabo Delgado province, due to attacks by groups with links to Islamic extremism. This includes the islands off the coast. Terrorists are likely to try to carry out attacks in Mozambique. There has an been an increasing intensity of attacks in Cabo Delgado since January 2019, with attacks reported in the districts of Palma, Mocimboa da Praia, Macomia, Nangade, Quissanga, Muidumbe, Meluco and Ibo. Militants have used explosives, machetes and firearms to conduct lethal attacks, as well as burning vehicles and homes. There are reports of an increased security presence in the province, including road blocks, and there are regular clashes between militants, armed vigilante groups and Mozambican security forces. See Terrorism", "visa_info": "Visa on arrival"}, {"country_iso": "MM", "name": "Myanmar", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to: For more information on these areas, see Local travel", "visa_info": "eVisa"}, {"country_iso": "NA", "name": "Namibia", "advisory": "Avoid driving outside towns at night as wildlife and stray livestock pose a serious hazard. See Road travel There is a growing level of violent street crime affecting foreign tourists, particularly in Windhoek. See Crime", "visa_info": "Visa not required"}, {"country_iso": "NR", "name": "Nauru", "advisory": "Most visits to Nauru are trouble-free. Accommodation options are limited. We recommend that you plan flights and book accommodation well in advance of travel. Although there’s no recent history of terrorism in Nauru, attacks can’t be ruled out. See Terrorism", "visa_info": "Visa required"}, {"country_iso": "NP", "name": "Nepal", "advisory": "Around 40,000 British nationals visit Nepal annually. Most visits are trouble-free. There has been an outbreak of Dengue fever is the southeast of Nepal. If you’re travelling in this area, take extra precautions to avoid mosquito bites. For up to date information see guidance on the TravelHealthPro website.", "visa_info": "Visa on arrival"}, {"country_iso": "NL", "name": "Netherlands", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "NZ", "name": "New Zealand", "advisory": "Around 200,000 British nationals visit New Zealand every year. Most visits are trouble-free. You don’t need a visa to enter New Zealand as a visitor for up to 6 months, but you will need to get a New Zealand Electronic Travel Authority (NZeTA) before you travel. See Visas", "visa_info": "Electronic Travel Authority"}, {"country_iso": "NI", "name": "Nicaragua", "advisory": "Many areas of the country have experienced a period of political unrest since April 2018, resulting in hundreds of deaths and detentions according to UN reports. Protests have led to violent clashes and use of tear gas, rubber bullets and live ammunition. The situation is now quieter but remains unpredictable. You should stay well away from all demonstrations and gatherings, even if apparently peaceful, as these could result in outbreaks of violence. See Political situation The incidence of crime has risen significantly since the protests began.", "visa_info": "Visa not required"}, {"country_iso": "NG", "name": "Niger", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to: ", "visa_info": "Visa required"}, {"country_iso": "NG", "name": "Nigeria", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to: ", "visa_info": "Visa required"}, {"country_iso": "MK", "name": "North Macedonia", "advisory": "On 14 February 2019, the UK government was informed that the Republic of Macedonia was henceforth known as the Republic of North Macedonia. Most visits to North Macedonia are trouble-free. Occasional acts of criminal violence occur, although foreigners are not generally targeted.", "visa_info": "Visa not required"}, {"country_iso": "NO", "name": "Norway", "advisory": "Around 581,000 British nationals visit Norway every year. Most visits are trouble-free. If you’re living in or moving to Norway, see our Living in Norway guide in addition to this travel advice.", "visa_info": "Visa not required"}, {"country_iso": "OM", "name": "Oman", "advisory": "Most visits to Oman are trouble-free. You should maintain a high level of security awareness and take care in public places and on the roads. Avoid large crowds and demonstrations.", "visa_info": "eVisa"}, {"country_iso": "PK", "name": "Pakistan", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Online Visa"}, {"country_iso": "PW", "name": "Palau", "advisory": "There is no British diplomatic representation in Palau.  Consular support is not available from the British government in Palau. However, the British Embassy in Manila, Philippines can provide consular support to British nationals. Most visits to Palau are trouble-free.", "visa_info": "Free visa on arrival"}, {"country_iso": "PA", "name": "Panama", "advisory": "Most visits to Panama are trouble-free. UK health authorities have classified Panama as having a risk of Zika virus transmission. For information and advice about the risks associated with Zika virus, visit the National Travel Health Network and Centre website.", "visa_info": "Visa not required"}, {"country_iso": "PG", "name": "Papua New Guinea", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to Hela and Southern Highlands provinces following significantly increased levels of tribal fighting and the declaration of states of emergency by the Papua New Guinea government. There has also been heavier than usual tribal fighting in Enga and Western Highlands provinces. If you’re planning to travel to these provinces, you should take greater care than usual and consider enhanced security precautions.", "visa_info": "eVisa / Free visa on arrival"}, {"country_iso": "PY", "name": "Paraguay", "advisory": "Forest fires are currently affecting the regions of the Chaco area and Northeast regions.  If you plan to visit those areas, monitor local media and follow the guidance of local authorities. Transnational criminal organisations involved in drug trafficking and arms smuggling operate along Paraguay’s eastern border with Brazil, especially from Pedro Juan Caballero south to Ciudad del Este, including the Tri-Border Area of Paraguay, Brazil and Argentina.  Their presence has increased violent crime in these areas. They have also carried out isolated violent criminal attacks in Asunción targeting the Paraguayan security forces and people associated with rival organisations. While tourists have not been the target of such incidents, anyone in the vicinity of an incident could be affected and you should exercise due caution.", "visa_info": "Visa not required"}, {"country_iso": "PE", "name": "Peru", "advisory": "Around 70,000 British nationals visit Peru every year. Most visits are trouble free. On 19 September, the government declared a 60 day state of emergency due to the risk of collapse of part of the Costa Verde cliff in Lima. The affected areas lie in the districts of San Miguel, Magdalena del Mar, San Isidro, Miraflores, Barranco and Chorrillos. Authorities are taking action to reduce the risk but you should follow their advice in the area.", "visa_info": "Visa not required"}, {"country_iso": "PH", "name": "Philippines", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to western and central Mindanao and the Sulu archipelago because of terrorist activity and clashes between the military and insurgent groups. The FCO advise against all but essential travel to the remainder of Mindanao (excluding Camiguin, Dinagat and Siargao Islands) due to the threat of terrorism. Typhoon Kammuri is expected to make land fall in Northern Luzon early in the week beginning 2 December. You should monitor local media and the Philippines Disaster Risk Reduction and Management Council for the latest updates. See Natural disasters", "visa_info": "Visa not required"}, {"country_iso": "PL", "name": "Poland", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "PT", "name": "Portugal", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "QA", "name": "Qatar", "advisory": "Around 20,000 British nationals live in Qatar, and approximately 130,000 visit annually. Most visits are trouble-free. The FIFA Club World Cup Qatar 2019 will take place in Qatar from 11 December to 21 December, with Liverpool Football Club, this year’s UEFA Champions League winners, taking part. Check our FIFA Club World Cup Qatar 2019 guidance page to make sure you are familiar with local laws and tips before travelling to Qatar.", "visa_info": "Visa not required"}, {"country_iso": "RO", "name": "Romania", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit. ", "visa_info": "Visa not required"}, {"country_iso": "RU", "name": "Russia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Visa required"}, {"country_iso": "RW", "name": "Rwanda", "advisory": "Rwanda is generally safe and crime levels are relatively low, but street crime does occur. There have been reports of an increase in burglary, theft and mugging in Kigali in recent months. You should take precautions with valuables and remain vigilant. See Crime The security situation near the border with the Democratic Republic of Congo (DRC) and Burundi remains unstable, and there have been armed attacks in Rwanda’s Nyungwe Forest and Volcanoes National Parks. If you are travelling near the border with the Democratic Republic of Congo (DRC) or Burundi, you should be aware of the risk of attacks and Government of Rwanda security operations. You should exercise caution and keep up to date with developments on the current situation, including via your tour operator, the local media and this travel advice. See Local travel", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "WS", "name": "Samoa", "advisory": "On 17 November 2019 Samoa declared a health emergency following several deaths linked to the ongoing measles outbreak. You should monitor the NaTHNaC website for the latest updates and advice.  On 22 November 2019 reports were received that Samoan Customs are requiring proof of measles immunization to enter the county.  See Health UK health authorities have classified Samoa as having a risk of Zika virus transmission. For information and advice about the risks associated with Zika virus, visit the National Travel Health Network and Centre website.", "visa_info": "Visa not required"}, {"country_iso": "SM", "name": "San Marino", "advisory": "Although there’s no recent history of terrorism in San Marino, attacks can’t be ruled out. See Terrorism The European Health Insurance Card (EHIC) is not valid in San Marino.", "visa_info": "Visa not required"}, {"country_iso": "ST", "name": "São Tomé and Príncipe", "advisory": "Consular support is limited in São Tomé and Príncipe as there is no British Embassy. The Honorary Consul/Consular Agent in Sao Tome and Principe can offer limited consular assistance.  British nationals should contact the British Embassy in Luanda, Angola who can provide consular support. Most visits to São Tomé and Príncipe are trouble-free.", "visa_info": "Visa not required"}, {"country_iso": "SA", "name": "Saudi Arabia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to within 10km of the border with Yemen. The FCO advise against all but essential travel to:", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "SN", "name": "Senegal", "advisory": "Presidential elections on 24 February passed peacefully, with the re-election of President Macky Sall for a second term. You should continue to exercise caution and avoid any demonstrations and areas where large public gatherings are likely. Terrorists are likely to try to carry out attacks in Senegal. Attacks could be indiscriminate, including in places visited by foreigners. See Terrorism", "visa_info": "Visa not required"}, {"country_iso": "RS", "name": "Serbia", "advisory": "Most visits to Serbia are trouble-free. Weekly protests are currently taking place in Belgrade and some other towns and cities. These usually remain peaceful, but can cause significant disruption, including to public transport. You should keep up to date with local developments and avoid any large crowds or demonstrations. See Political situation", "visa_info": "Visa not required"}, {"country_iso": "SC", "name": "Seychelles", "advisory": "Most visits to Seychelles are trouble-free. You should exercise caution when swimming, especially with children. Currents can be strong and drownings occur. Beaches which are safer at certain times of the year can be dangerous for swimming at other times. See Swimming", "visa_info": "Free Visitor's Permit on arrival"}, {"country_iso": "SL", "name": "Sierra Leone", "advisory": "Most visits to Sierra Leone are incident free, but a small number of incidents have been reported of British nationals being robbed, sometimes at knife-point. See Crime You will need a visa to enter Sierra Leone. See Visas", "visa_info": "Visa on arrival"}, {"country_iso": "SG", "name": "Singapore", "advisory": "Drunk and disorderly conduct is treated seriously. Penalties for convicted offenders include fines, imprisonment, and/or corporal punishment (caning). See Local laws and customs It’s illegal to drink alcohol in public places from 10:30pm to 7am and all day on weekends in specific areas and designated Liquor Control Zones. Offenders will be fined. See Local laws and customs", "visa_info": "Visa not required"}, {"country_iso": "SK", "name": "Slovakia", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "SI", "name": "Slovenia", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "SB", "name": "Solomon Islands", "advisory": "On 5 February 2019, a bulk carrier vessel ran aground in Kangava Bay on Rennell Island.  The surrounding bay was affected by the resulting fuel leakage, and though the spill has now been contained, clean up activity continues.  You should take local advice on precautions if visiting affected coastal areas. Mosquito-borne diseases such as malaria and dengue fever are wide-spread across Solomon Islands. You should follow the advice of local authorities, the National Travel Health Network and Centre, and avoid being bitten by mosquitoes.", "visa_info": "Free Visitor's permit on arrival"}, {"country_iso": "SO", "name": "Somalia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to Somalia, including Somaliland except for the cities of Hargeisa and Berbera to which the FCO advise against all but essential travel. Any British nationals in areas of Somalia to which the FCO advise against all travel should leave. Any British nationals in Hargeisa or Berbera who are not on essential travel should leave. If you visit Hargeisa or Berbera, exercise a heightened level of vigilance and take care in public places where people gather. Monitor local and international media to avoid any demonstration or disturbance taking place. Leave any area of unrest quickly and don’t attempt to watch or photograph it.", "visa_info": "Visa on arrival"}, {"country_iso": "ZA", "name": "South Africa", "advisory": "Over 430,000 British tourists visit South Africa each year. Most visits are trouble-free, but a small number of British people encounter problems in South Africa. You should take sensible precautions to protect your safety.", "visa_info": "Visa not required"}, {"country_iso": "SS", "name": "South Sudan", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to South Sudan. If you’re in South Sudan, you should leave if it’s safe to do so. Levels of intercommunal violence remain high across the country, and there are sporadic reports of fighting between armed groups in certain areas. It is possible that such violence will increase in the run-up to, and beyond, the 12 November deadline for the formation of a new Transitional Government of National Unity.", "visa_info": "Visa required"}, {"country_iso": "ES", "name": "Spain", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "LK", "name": "Sri Lanka", "advisory": "The Sri Lankan presidential elections took place on 16 November 2019. There were sporadic incidents of violence during the campaign and it is possible these will continue into the post – election period. You should take appropriate security precautions, follow local advice, comply with security instructions and avoid large gatherings, protests and rallies. Monsoon rains have caused flooding in many places in Sri Lanka. The Centre for Disaster Management has issued a general alert. Heavy rains and landslides can also lead to road closures and affect local transport links. If you’re travelling in the area, you should check local advice when planning your journey. See Natural disasters", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "SD", "name": "Sudan", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Visa required"}, {"country_iso": "SR", "name": "Suriname", "advisory": "If you’re visiting Suriname as a tourist and arriving at Johan Adolf Pengel International Airport in Paramaribo you don’t need a visa before travel. See Visas Most visits are trouble-free, but burglary, armed robbery and violent crime occur in Paramaribo and in outlying areas. See Crime", "visa_info": "E-tourist card"}, {"country_iso": "SE", "name": "Sweden", "advisory": "Stay up to date The UK is leaving the European Union. The rules for passports, entry requirements, driving, EHIC cards and more may change after Brexit.", "visa_info": "Visa not required"}, {"country_iso": "CH", "name": "Switzerland", "advisory": "British nationals made 703,933 visits to Switzerland in 2016. Most visits are trouble-free. If you’re living in or moving to Switzerland, visit our Living in Switzerland guide in addition to this travel advice.", "visa_info": "Visa not required"}, {"country_iso": "SY", "name": "Syria", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to Syria. British nationals in Syria should leave by any practical means. Consular support is not available from the British government from within Syria, as all services of the British Embassy in Damascus are suspended and all diplomatic and consular staff have been withdrawn. If you need to speak to a consular officer in the UK, call the FCO in London on +44 (0)20 7008 1500.", "visa_info": "Visa required"}, {"country_iso": "TJ", "name": "Tajikistan", "advisory": "Terrorists are likely to try and carry out attacks in Tajikistan. On 6 November 2019, it was reported that 17 people were killed in an armed attack on a Tajik security checkpoint in Rudaki District on the Tajik/Uzbek border, approximately 60km south-west of Dushanbe. The Tajik Government has said that Daesh/ISIS is responsible. Dushanbe remains calm, and there is no special police presence on the streets or at checkpoints. You should exercise caution and vigilance, particularly if travelling near or across the Tajik/Uzbek border. See Local travel and Terrorism", "visa_info": "eVisa"}, {"country_iso": "TZ", "name": "Tanzania", "advisory": "Around 75,000 British nationals visit Tanzania every year. Although most visits to Tanzania are trouble-free, violent and armed crime is increasing. Take sensible precautions to protect yourself and your belongings. See Crime", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "TH", "name": "Thailand", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all but essential travel to areas within the provinces on the Thailand-Malaysia border, including: Consular support is not available in the parts of Thailand where the FCO advise against all but essential travel.", "visa_info": "Visa not required"}, {"country_iso": "TL", "name": "Timor-Leste", "advisory": "Crime continues to be a problem in Timor-Leste (East Timor), including gang-related violence (not directed towards foreigners), robbery and assault. See Crime Consular support may be limited in Timor-Leste as there’s no resident British diplomatic mission. Emergency consular services are provided by the New Zealand Embassy in Dili (24 hour emergency number: +670 7732 1015) and the British Honorary Consul. For all routine consular issues, contact the British Embassy in Jakarta, Indonesia.", "visa_info": "Visa on arrival"}, {"country_iso": "TG", "name": "Togo", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to within 5km of the border with Burkina Faso. There have been sporadic marches and protests in Lomé and around the country since August 2017, over demands to restore the 1992 constitution. Tensions remain heightened and further marches and protests, by supporters of the government and opposition are possible, particularly ahead of presidential elections in February 2020.  You should remain vigilant, avoid crowds and demonstrations, monitor local media and follow advice of local authorities. See Political situation", "visa_info": "Visa on arrival"}, {"country_iso": "TO", "name": "Tonga", "advisory": "Tonga is currently suffering a measles outbreak. See Health There is no British diplomatic representation in Tonga. Consular support is limited in Tonga. However, the British High Commission in Suva in Fiji can provide consular support to British nationals.", "visa_info": "Free visa on arrival"}, {"country_iso": "TT", "name": "Trinidad and Tobago", "advisory": "Over 30,000 British nationals visit Trinidad and Tobago every year. Most visits are trouble-free. There are high levels of violent crime in Trinidad, including murder, particularly in parts of the capital Port of Spain. See Crime", "visa_info": "Visa not required"}, {"country_iso": "TN", "name": "Tunisia", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to: The FCO advise against all but essential travel to:", "visa_info": "Visa not required"}, {"country_iso": "TR", "name": "Turkey", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to areas within 10 km of the border with Syria, except the city of Kilis (see below). The FCO advise against all but essential travel to:", "visa_info": "eVisa"}, {"country_iso": "TM", "name": "Turkmenistan", "advisory": "The European Aviation Safety Agency (EASA) has suspended Turkmenistan Airlines flights to and from the EU pending confirmation that it meets international air safety standards. If you have an existing booking, you should contact Turkmenistan Airlines to seek further information on alternative arrangements or contact: More information for affected UK passengers is available on the Civil Aviation Authority (CAA) website.", "visa_info": "Visa required"}, {"country_iso": "TV", "name": "Tuvalu", "advisory": "Cyclone season is normally between November and April but cyclones can occur throughout the year. Severe weather may result in flooding, landslides, and the disruption of essential services and infrastructure. See Natural disasters. There’s no British Consulate in Tuvalu.  Consular support is severely limited, however, the British High Commission Suva in Fiji can provide some consular support to British nationals.", "visa_info": "Free visa on arrival"}, {"country_iso": "UG", "name": "Uganda", "advisory": "The arrest of a number of opposition Members of Parliament following violence around the Arua by-election on the 15 August 2018 has led to heightened political tension. There have been sporadic protests throughout 2019 and there remains an increased likelihood of protests, which may turn violent, across Uganda. You should remain vigilant, avoid large crowds and public demonstrations and follow local media for updates. See Political situation On 1 August 2018, an outbreak of Ebola was confirmed in eastern Democratic Republic of Congo – in July 2019 this was declared a Public Health Emergency of International Concern (PHEIC) by the World Health Organisation. On 28 August 2019, the Ugandan Ministry of Health confirmed a single case of Ebola in Kasese District in western Uganda.  This outbreak was declared over on 28 October 2019.  See National Travel Health Network and Centre. The latest updates can be found on the World Health Organisation’s website. See Health", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "UA", "name": "Ukraine", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to Donetsk oblast, Luhansk oblast and Crimea. The situation in Kyiv and other areas outside Donetsk and Luhansk is generally calm. However, events in Ukraine are fast moving. You should remain vigilant throughout Ukraine, monitor the media and this travel advice regularly, subscribe to email alerts and read our advice on how to deal with a crisis overseas.", "visa_info": "Visa not required"}, {"country_iso": "AE", "name": "United Arab Emirates", "advisory": "The United Arab Emirates (UAE) authorities have announced the suspension of diplomatic relations with Qatar. All air and sea points of entry between UAE and Qatar were closed on 6 June 2017. If you have a question about your travel plans you should contact your airline or travel company. There are further restrictions on travel and residence affecting UAE and Qatar nationals. For more information see this UAE government announcement. If you’re a British national holding Qatari residency, and you wish to transit through or enter into the UAE, normal entry requirements to the UAE should apply.", "visa_info": "Free visa on arrival"}, {"country_iso": "US", "name": "United States", "advisory": "Heavy snow is disrupting travel across the centre of the United States causing significant travel disruption over the Thanksgiving holiday period, including a number of cancelled flights. If you are due to travel to or within the US in the coming days you should check with your airline before travelling. Around 3.8 million British nationals visit the USA every year. Most visits are trouble free. Take out comprehensive travel and medical insurance before you travel.", "visa_info": "Visa Waiver Program"}, {"country_iso": "UY", "name": "Uruguay", "advisory": "Around 20,000 British nationals visit Uruguay every year. Most visits are trouble-free. Most criminal incidents occur in Montevideo, where opportunistic street crime is on the rise. Take care of your personal belongings at all times and be aware of your surroundings. Take particular care in and around the downtown and port areas. Don’t walk through these areas alone or at night; consider taking a taxi if necessary. See Crime", "visa_info": "Visa not required"}, {"country_iso": "UZ", "name": "Uzbekistan", "advisory": "Most visits to Uzbekistan are trouble free. On 6 November 2019, it was reported that 17 people were killed in an armed attack on a Tajik security check-point on the Uzbek/Tajik border. The Tajik Government has said that Daesh/ISIS was responsible. Tashkent remains calm, and there is no additional police presence on the streets or at checkpoints. You should exercise caution and vigilance, particularly if travelling near or across the Uzbek/Tajik border. See Local travel and Terrorism", "visa_info": "Visa not required"}, {"country_iso": "VU", "name": "Vanuatu", "advisory": "The British High Commission in Port Vila is monitoring the development and tracking of Tropical Cyclone Rita. If you are in or are near the area you should follow the guidance issued by the Vanuatu National Disaster Management Office. The government of Vanuatu has declared a state of emergency for the island of Ambae. The government have ordered the immediate compulsory evacuation of the population of Ambae to the neighbouring island of Maewo due to the ongoing volcanic activity. If you’re in Vanuatu you’re advised to follow the advice of the local authorities, including the evacuation order.", "visa_info": "Visa not required"}, {"country_iso": "VE", "name": "Venezuela", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to within 80 km (50 miles) of the Colombian border and 40 km (25 miles) of the Brazilian border. Drug traffickers and illegal armed groups are active along the border area with Colombia and Brazil and there is a risk of kidnapping. See Crime The FCO advise against all travel to Zulia State as a result of prolonged power cuts and an increase in civil disorder. See Crime", "visa_info": "Visa not required"}, {"country_iso": "VN", "name": "Vietnam", "advisory": "British nationals make over 300,000 visits to Vietnam every year. Until 30 June 2021, British Citizen passport holders travelling for tourism or business can enter Vietnam for up to a maximum of 15 days (inclusive of dates of entry and exit) without a visa. See Visas", "visa_info": "Visa not required"}, {"country_iso": "YE", "name": "Yemen", "advisory": "The Foreign and Commonwealth Office (FCO) advise against all travel to Yemen. This includes the mainland and all islands. If you’re in Yemen, you should leave immediately. If you choose to remain in Yemen, you should minimise movement around the country and within cities and towns, monitor developments in the local security situation and follow other precautions in this travel advice. The security situation in Yemen remains unstable. Fighting continues across the country, which has exacerbated the humanitarian crisis and damaged key infrastructure. Access to food, clean water, fuel and medical supplies is difficult throughout Yemen. There is a high risk of being caught in indiscriminate gunfire or shelling.", "visa_info": "Visa required"}, {"country_iso": "ZM", "name": "Zambia", "advisory": "Around 60,000 British tourists visit Zambia every year. You should avoid all political rallies and demonstrations. See Political situation", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "ZW", "name": "Zimbabwe", "advisory": "You should avoid any political gatherings or demonstrations. These can be unpredictable, can turn violent without notice and the response from the security forces may be disproportionate. You should exercise a high degree of caution and monitor local media and this travel advice for updates. Taking photographs of members of police and armed forces personnel and of demonstrations and protests is not permitted. You should avoid political activity, or activities which could be considered political, including political discussions in public places. Ensure you carry identification, so that you can produce it if required to do so by the security forces. See Political situation", "visa_info": "eVisa / Visa on arrival"}]