{"Afghanistan": {"country-iso": "AF", "name": "Afghanistan", "advisory-text": "Do not travel", "visa-info": "na"}, "Albania": {"country-iso": "AL", "name": "Albania", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can visit for 90 days without a visa. For longer stays, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or Consulate of Albania for up-to-date information."}, "Algeria": {"country-iso": "DZ", "name": "Algeria", "advisory-text": "Reconsider your need to travel", "visa-info": " You'll need a visa to enter Algeria. Visas on arrival are only available for tourists arriving and departing by cruise ship. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Embassy of Algeria for up-to-date information."}, "American Samoa": {"country-iso": "AS", "name": "American Samoa", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Andorra": {"country-iso": "AD", "name": "Andorra", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Angola": {"country-iso": "AO", "name": "Angola", "advisory-text": "High degree of caution", "visa-info": " You need a visa to visit Angola. Contact an \n   Angolan Embassy or Consulate well ahead of travel to organise an appropriate visa. Tourist visa on arrival is not available without online visa pre-approval which can be applied for on Angola's Serviço de Migração. Serviço de Migração In Angola, it can take at least ten weeks to renew a visa. During this time, the Angolan immigration authorities will keep your passport and you won't be able to travel. Plan your travel and visa renewals carefully to avoid complications. Penalties for visa offences include fines, detention and deportation."}, "Antigua and Barbuda": {"country-iso": "AG", "name": "Antigua and Barbuda", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Argentina": {"country-iso": "AR", "name": "Argentina", "advisory-text": "Exercise normal safety precautions", "visa-info": " Visas are only required for work permits, study, or Australian diplomatic and official passports holders. They're not available on arrival. Arrange your visa, before you leave, through your nearest Embassy or Consulate of Argentina. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Argentina for up-to-date information."}, "Armenia": {"country-iso": "AM", "name": "Armenia", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can visit Armenia without a visa unless you're staying for more than 180 days. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest    Embassy or Consulate of Armenia or the \n   Armenian Ministry of Foreign Affairs for up-to-date information."}, "Aruba": {"country-iso": "AW", "name": "Aruba", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Austria": {"country-iso": "AT", "name": "Austria", "advisory-text": "Exercise normal safety precautions", "visa-info": " Austria is part of the \n   Schengen area, along with a number of other European countries. This allows you to enter Austria without a visa in some circumstances. In other circumstances, you'll need to get a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Austria for up-to-date information."}, "Azerbaijan": {"country-iso": "AZ", "name": "Azerbaijan", "advisory-text": "Exercise normal safety precautions", "visa-info": " You need a visa to enter Azerbaijan. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Azerbaijan before you travel for up-to-date information. Electronic visas (e-visa) for single entry, 30 day stays are available online through Azerbaijan's \n   State Agency for Public Service and Social Innovations. Allow at least three business days for online applications to be processed and ensure your passport is valid for at least three months from the expiry date of the e-visa. If your passport contains visas/stamps from the disputed territory of Nagorno-Karabakh, you'll likely encounter difficulties at Azerbaijan border control points and could be refused entry into Azerbaijan. In Azerbaijan, applications for visa extensions and renewals can be made through Azerbaijan's \n   State Migration Service. Carry a photocopy of your passport and existing Azerbaijan visa while your application for a new or renewed visa is being processed. Ministry of Interior Police conduct random checks of foreign citizens for their documentation. See \n   Laws. More information:"}, "Bahrain": {"country-iso": "BH", "name": "Bahrain", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Visit the \n   Bahrain Ministry of Foreign Affairs website for up-to-date information. Bahrain does not have an embassy in Australia, the nearest \n   Embassy of Bahrain is in Bangkok, Thailand."}, "Bangladesh": {"country-iso": "BD", "name": "Bangladesh", "advisory-text": "Reconsider your need to travel", "visa-info": " You'll need a visa to enter Bangladesh. Visas must be arranged prior to arrival. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Bangladesh High Commission for up-to-date information."}, "Barbados": {"country-iso": "BB", "name": "Barbados", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Belarus": {"country-iso": "BY", "name": "Belarus", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australians are eligible for 30-day visa-free entry into Belarus, with a maximum stay of 90 days in one calendar year. The visa-free regime is only valid for people entering and exiting through Minsk International Airport. Other entry and exit conditions, such as compulsory medical insurance, still apply. Visa-free entry doesn't apply to travellers arriving from, or travelling to, Russia. If you're travelling to Belarus through Russia, you'll need to get a Russian transit visa. For information on Russian visas, contact the nearest \n   Embassy of Russia. The five day visa-free arrangement isn't available if you're travelling on a diplomatic or official passport. More information: \n   State Border Committee of The Republic of Belarus. Foreigners aren't permitted to cross the land border between Belarus and Russia. Don't enter or exit Belarus by the land border with Russia. Travel between Belarus and Russia by air. Contact the Ministry of Foreign Affairs of Belarus and the \n   Embassy of Russia for up-to-date information. Australians are also permitted to cross land borders for short visits to the border areas of Avgustov Canal, Belovezhskaya Pushcha, Brest or Grodno. Travel with a registered tour operator and enter through assigned border checkpoints. More information at \n   Grodno Visa Free and \n   regulations for foreign citizens visiting the national park. When you enter and exit Belarus, show the original issued visa to border authorities - a photocopy isn't sufficient. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. For up-to-date information, contact the Ministry of Foreign Affairs of Belarus. More information:"}, "Belgium": {"country-iso": "BE", "name": "Belgium", "advisory-text": "High degree of caution", "visa-info": " Belgium is a part of the Schengen area, along with a number of other European countries. This allows you to enter Belgium without a visa in some circumstances. In other circumstances, you will need a visa. More information: \n   Schengen Convention As visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice, contact the nearest    Embassy or Consulate of Belgium for the most up to date information."}, "Belize": {"country-iso": "BZ", "name": "Belize", "advisory-text": "High degree of caution", "visa-info": " Australian passport holders are eligible for a tourist visa on arrival, valid for one month. You must show you have a return ticket and sufficient funds (considered to be USD60 a day) to cover your stay. If you plan to stay more than 30 days, you must have your passport re-stamped by a local immigration office and pay an additional fee. For other kinds of travel, you'll need to apply for a visa in advance. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Consulate of Belize or visit the official \n   Belize Tourism Board website for up-to-date information. If you're travelling via the United States, you must meet US entry/transit requirements. Check your visa needs well in advance of travel with the nearest \n   Embassy or Consulate of the United States. More information: \n   Travel advice for the United States"}, "Benin": {"country-iso": "BJ", "name": "Benin", "advisory-text": "High degree of caution", "visa-info": " Australian passport holders need a visa to enter Benin. You can apply \n   online for a short stay single or multiple entry e-visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Benin for up-to-date information."}, "Bermuda": {"country-iso": "BM", "name": "Bermuda", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Bhutan": {"country-iso": "BT", "name": "Bhutan", "advisory-text": "Exercise normal safety precautions", "visa-info": " Every country or territory decides who can enter or exit through its borders. The Australian Government cannot intervene on your behalf if you do not meet your destination’s entry or exit requirements. You'll need a visa to travel to Bhutan. Bhutan strictly controls international tourism. All tourist travel must be arranged through a government-licensed tour operator. The \n    Tourism Council of Bhutan publishes a \n   list of all licensed tour operators. The tour operator is responsible for arranging visas for travellers. Independent travel is not possible unless you have a long term visa. If you plan a longer-term stay in Bhutan, you will need a work permit, volunteer visa or other long-term visa. You and your partner will only be eligible for a dependent spouse visa if you provide a marriage certificate. Bhutan does not recognise de-facto or same-sex relationships. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Tourism Council of Bhutan (phone: +975 2 323 251/52 or email  \n   info@tourism.gov.bt) for up-to-date information. More information: \n   Embassy of Bhutan For travel to or from Bhutan via India, read our \n   travel advice for India. More information:"}, "Bolivia": {"country-iso": "BO", "name": "Bolivia", "advisory-text": "Reconsider your need to travel", "visa-info": " You can visit Bolivia for tourist purposes without a visa for up to 90 days. For other visits you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Bolivia for up-to-date information. If you are travelling to Bolivia through the United States of America, including Honolulu, you'll need to meet US entry/transit requirements, even if transiting. Check visa requirements with an \n   Embassy or Consulate of the United States in advance of your travel. More information: \n   Travel advice for the United States of America"}, "Bosnia and Herzegovina": {"country-iso": "BA", "name": "Bosnia and Herzegovina", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don't need a visa for stays of up to three months. If you plan to stay for longer than three months, you'll need a temporary residence permit. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Bosnia and Herzegovina for up-to-date information."}, "Botswana": {"country-iso": "BW", "name": "Botswana", "advisory-text": "Exercise normal safety precautions", "visa-info": " Visas on arrival for tourists are available for stays of up to 90 days. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest High Commission, Embassy or Consulate of Botswana for up-to-date information. Australian emergency passports are accepted as a valid travel document in Botswana. If you plan to enter Botswana on an Australian emergency passport, you must obtain a visa before you enter Botswana. This visa cannot be obtained on arrival. You need to apply at the nearest \n   High Commission, Embassy or Consulate of Botswana"}, "Brazil": {"country-iso": "BR", "name": "Brazil", "advisory-text": "High degree of caution", "visa-info": " From 17 June 2019 you don't need a visa to enter Brazil for tourism, business, transit, artistic or sport activities. You can stay in Brazil for 90 days in a 12 month period (extendable by another 90 days by contacting the Brazilian Federal Police) over a twelve month period, counted from the date of first entry to Brazil. If you intend to live in Brazil you'll need to get a visa before arrival. In other circumstances, you'll need to apply for your visa through an \n   Embassy or Consulate of Brazil. More information: \n   Embassy or Consulate of Brazil (Canberra) The Brazilian Government enforces immigration and entry laws. If you arrive without a required visa, you will be sent back on the next available flight. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Brazil for up-to-date information. If you travel through the United States, you must meet US entry/transit requirements. Check with your nearest \n   Embassy or Consulate of the United States for visa requirements before you travel. More information: \n   Travel advice for the United States of America"}, "Brunei Darussalam": {"country-iso": "BN", "name": "Brunei Darussalam", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can get a visa on arrival for transit (up to 72 hours) and single and multiple entry. You'll need to pay the visa fee in cash in either Bruneiean or Singaporean dollars. There is a money changer at the airport before the immigration control point, but no ATMs or banking  facilities. Immigration regulations are strictly enforced. Check your entry stamp in your passport to confirm your permitted length of stay. Closely monitor your immigration status and visa expiry date. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy, High Commission or Consulate of Brunei for up-to-date information. More information: \n   Brunei Department of Immigration and National Registration."}, "Bulgaria": {"country-iso": "BG", "name": "Bulgaria", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don't need a visa to enter for tourism purposes for stays of up to 90 days within a six month period. You'll need a visa for other kinds of travel. While Bulgaria is part of the European Union, it is not in the Schengen area. Visa and other entry and exit conditions (such as, customs and quarantine regulations) may change as they are realigned with those of the Schengen area. Contact the nearest \n   Embassy or Consulate of Bulgaria for up-to-date information. More information:"}, "Burkina Faso": {"country-iso": "BF", "name": "Burkina Faso", "advisory-text": "Reconsider your need to travel", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy or Consulate of Burkina Faso for up-to-date information."}, "Burundi": {"country-iso": "BI", "name": "Burundi", "advisory-text": "Do not travel", "visa-info": " If you plan to enter Burundi despite our advice, you'll need a visa issued in advance. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an embassy or consulate of Burundi for up-to-date information. Burundi does not have diplomatic representation in Australia. The nearest Embassy of Burundi is in Tokyo."}, "Cabo Verde": {"country-iso": "CV", "name": "Cabo Verde", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Cambodia": {"country-iso": "KH", "name": "Cambodia", "advisory-text": "Exercise normal safety precautions", "visa-info": " You need a visa to visit Cambodia. If you're travelling for tourism, you can apply for an e-visa online through the \n   Cambodian Ministry of Foreign Affairs and International Cooperation. E-visas are only valid for entry through the Phnom Penh, Siem Reap and Sihanoukville International Airports, and Cham Yeam (Koh Kong), Poipet (Banteay Meanchey), Bavet (Svay Rieng) and Tropaeng Kreal (Stung Treang). Tourist visas are also available on arrival. Tourist visas are valid for thirty days. For longer stays, or if you're travelling to Cambodia for a purpose other than tourism, you must arrange a visa in advance through the nearest \n   Embassy or Consulate of Cambodia. Day trips aren't permitted, except when arriving and departing via Phnom Penh International Airport. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Cambodia for up-to-date information."}, "Cameroon": {"country-iso": "CM", "name": "Cameroon", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice.  Contact the nearest \n   Embassy or Consulate of Cameroon for the most up to date information."}, "Canada": {"country-iso": "CA", "name": "Canada", "advisory-text": "Exercise normal safety precautions", "visa-info": " You'll need to get an \n   electronic travel authorisation (eTA) or visa before you travel to Canada. If you have a criminal record, including a drink-driving conviction, you may not be allowed into Canada.  More information: Overcome criminal convictions\n(Government of Canada) If you overstay your visa, you may be detained or deported. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n   Canadian High Commission or Consulate for up-to-date information. The Australian Government can't help with visa issues of Australians seeking to enter Canada. This includes those with valid Canadian visas who are refused permission to enter or are required to depart. If you're travelling through the United States, you must meet US entry/transit requirements. Check your visa requirements with an \n   Embassy or Consulate of the United States well before your travel. More information:"}, "Central African Republic": {"country-iso": "CF", "name": "Central African Republic", "advisory-text": "Do not travel", "visa-info": "na"}, "Chad": {"country-iso": "TD", "name": "Chad", "advisory-text": "Do not travel", "visa-info": " You'll need a visa to visit Chad. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy or Consulate of Chad for up-to-date information. The Chadian embassy accredited to Australia is located in Beijing, China: Embassy of Chad in Beijing 21 Guanghua Lu 100600 Beijing, ChinaPhone: +86 10 6532 1296 or +86 10 6532 4830 Fax: +86 10 532 3638"}, "Chile": {"country-iso": "CL", "name": "Chile", "advisory-text": "High degree of caution", "visa-info": " If you're visiting Chile for tourism for 90 days or less, you can get a visa on arrival. In other circumstances, or if you're travelling on a diplomatic or official passport, you need to arrange a visa before you travel. Apply through an \n   Embassy or Consulate of Chile. The APEC Business Travel Card provides streamlined entry to several regional countries for Australians who travel frequently for trade and investment. More information is available from the \n   Department of Home Affairs. You won't be allowed to depart Chile unless you have a valid visa. If you need to extend your visa, apply at the Chilean Immigration Office at San Antonio 580, Santiago (telephone (56 2) 2550 2469). If you overstay your visa, go to the Migration Department of the Ministry of the Interior and Public Security. You may face a fine. If your Tourist Card is lost or stolen, you can get a replacement Tourist Card at any PDI (International Police) Office or at Santiago's international airport. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Chile for up-to-date information. If you're travelling to Chile through the United States, or transiting Honolulu or another US point of entry, you must also meet US entry/transit requirements. Check visa requirements with a \n   US Embassy or Consulate well in advance of travel. More information: \n   Travel advice for the United States of America Travellers, including mainland Chileans, are not allowed to stay more than 30 days consecutively on Easter Island (Isla de Pascua / Rapa Nui)."}, "China": {"country-iso": "CN", "name": "China", "advisory-text": "Exercise normal safety precautions", "visa-info": " You may require a full visa for travel to China, even as a tourist. Transit visas (issued on arrival) are available for some short visits. If you require a full visa, you must get this prior to travel. The website of the \n   Embassy of the People's Republic of China in Australia has detailed information on the eligibility of Australians for various visa types. For foreigners already travelling or residing in China, all visa queries should be directed to the Foreigners Entry and Exit Administration Section of the local Public Security Bureau (PSB). Fingerprint scanning of foreign nationals (aged between 14 to 70 years) on arrival, commenced in 2017. Chinese authorities strictly enforce penalties for entry and exit visa violations. Ensure you depart China before your visa expiry date. Penalties for visa violations range from fines to detention. Fines are imposed for each day overstayed, including if you’re in detention. The period of detention can range from five to 30 days, depending on the severity of the violation. Australians who become involved in a criminal matter or investigation, or directly or indirectly involved in a civil or commercial dispute, may be prevented from departing China until the matter is resolved. See \n   Laws. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n    Embassy or Consulate of China for up-to-date information."}, "Colombia": {"country-iso": "CO", "name": "Colombia", "advisory-text": "High degree of caution", "visa-info": " If you're visiting for tourism for 90 days or less, you generally won't need a visa to enter Colombia. Immigration Officers have discretion to refuse entry, even if you fulfil the usual criteria for visa-free entry. You may need to give evidence of return or onward travel. In other circumstances, you must arrange a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Colombia to arrange a visa or for up-to-date information. If you're transiting thorugh the USA, you must meet US entry/transit requirements. More information: \n   Travel advice for the United States of America"}, "Comoros": {"country-iso": "KM", "name": "Comoros", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Cook Islands": {"country-iso": "CK", "name": "Cook Islands", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're travelling for tourism and staying for less than 31 days, you normally won't need a visa. In other circumstances, you'll need a visa. Entry and exit conditions (such as visa requirements, currency, customs and quarantine regulations) can change at short notice. Contact the Cook Islands \n   Ministry of Foreign Affairs and Immigration for up-to-date information or call +682 29347."}, "Costa Rica": {"country-iso": "CR", "name": "Costa Rica", "advisory-text": "High degree of caution", "visa-info": " Australian passport holders don't need a visa for tourism for less than 90 days. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. For up-to-date information contact the nearest \n   Embassy or Consulate of Costa Rica"}, "Côte d'Ivoire (Ivory Coast)": {"country-iso": "CI", "name": "Côte d'Ivoire (Ivory Coast)", "advisory-text": "High degree of caution", "visa-info": " As visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice, contact the \n   nearest Embassy or Consulate of Côte d'Ivoire for up-to-date information. You’ll need an exit permit from the National Museum to take any art objects from Côte d'Ivoire. The \n   World Health Organization (WHO) says yellow fever is endemic in Côte d'Ivoire. Yellow fever is a serious and potentially fatal disease preventable by vaccination. A valid Yellow Fever Vaccination Certificate is required for entry into Côte d'Ivoire. For more information  see the \n    Department of Health website."}, "Croatia": {"country-iso": "HR", "name": "Croatia", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australians travelling for tourism or business do not need a visa to enter Croatia for stays of up to 90 days within a six-month period. If you are travelling for another purpose, such as work or study, or you plan to stay for longer than 90 days in six months, you'll need a visa. Croatia is part of the European Union (EU) but is not a member of the \n   Schengen area. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Croatia for up-to-date information."}, "Cuba": {"country-iso": "CU", "name": "Cuba", "advisory-text": "Exercise normal safety precautions", "visa-info": " You'll need a visa to enter Cuba. If your visit is for tourism, you can get a 'tourist card', through your travel agent or airline, or through an \n   Embassy or Consulate of Cuba.  The 'tourist card' includes a tourist visa. In other circumstances, you'll need to apply for your visa through an \n   Embassy or Consulate of Cuba. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact an \n   Embassy or Consulate of Cuba for up-to-date information."}, "Cyprus": {"country-iso": "CY", "name": "Cyprus", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don't need a visa to visit Cyprus for stays of up to 90 days within a six-month period. If you plan to stay longer, you'll need to apply for a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n   High Commission, Embassy or Consulate of Cyprus for up-to-date information. More information:"}, "Czech Republic": {"country-iso": "CZ", "name": "Czech Republic", "advisory-text": "Exercise normal safety precautions", "visa-info": " The Czech Republic is a part of the \n   Schengen area, along with a number of other European countries. This allows you to enter the Czech Republic without a visa in some circumstances. In other circumstances, you'll need to get a visa before you travel. As visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change, contact the nearest \n   Embassy or Consulate of the Czech Republic for up-to-date information. More information: \n   Schengen Convention"}, "Democratic Republic of the Congo": {"country-iso": "CG", "name": "Democratic Republic of the Congo", "advisory-text": "Reconsider your need to travel", "visa-info": " Every country  or territory decides who can enter or exit through its borders. The Australian  Government can’t intervene on your behalf if you don’t meet your destination’s  entry or exit requirements. You'll need a visa to enter the DRC. You can’t get a visa on arrival. For visa information, contact the closest Embassy of the DRC to Australia in Tokyo. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy or Consulate of the DRC for up-to-date information."}, "Denmark": {"country-iso": "DK", "name": "Denmark", "advisory-text": "Exercise normal safety precautions", "visa-info": " Denmark is part of the Schengen Area, along with a number of other European countries. This allows you to enter without a visa in some circumstances. Read the Smartraveller \n   Schengen Convention bulletin before you leave Australia. As visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice, contact the nearest \n   Embassy or Consulate of Denmark for the most up-to-date information."}, "Djibouti": {"country-iso": "DJ", "name": "Djibouti", "advisory-text": "High degree of caution", "visa-info": "na"}, "Dominica": {"country-iso": "DM", "name": "Dominica", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Dominican Republic": {"country-iso": "DO", "name": "Dominican Republic", "advisory-text": "High degree of caution", "visa-info": " You must purchase a tourist card when entering the country. It is valid for 30 days. For longer visits, you must  pay an additional fee at the airport on departure. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest Embassy or \n   Consulate of the Dominican Republic for the latest information."}, "Ecuador": {"country-iso": "EC", "name": "Ecuador", "advisory-text": "High degree of caution", "visa-info": " Australian passport holders can stay in Ecuador for up to 90 days without a visa. If you want to stay longer, you'll need a visa. If you overstay, you may be fined and barred from future visits. You can visit the Galapagos Islands for tourism for up to 60 days. If you’re visiting for other purposes, you must get a visa or special permission from the local authority before you arrive in Ecuador. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Ecuador for up-to-date information. If you are travelling through the United States, you must meet US entry or transit requirements. Check your visa requirements with an \n   Embassy or Consulate of the United States well in advance of your travel. More information: \n   United States of America."}, "Egypt": {"country-iso": "EG", "name": "Egypt", "advisory-text": "Reconsider your need to travel", "visa-info": " Australians can get a tourist visa online at \n   www.visa2egypt.gov.eg or on arrival. Visas can only be ppaid for with US Dollars or Euros. Egyptian Pounds aren't accepted as payment for tourist visas. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n    Egyptian diplomatic mission for up-to-date information. All foreign journalists entering Egypt for work purposes must get appropriate accreditation from the \n   Egyptian Press Centre, which is part of the Egyptian State Information Service, before arrival. There are severe punishments for journalists working without appropriate accreditation."}, "El Salvador": {"country-iso": "SV", "name": "El Salvador", "advisory-text": "High degree of caution", "visa-info": " You need a visa to enter El Salvador. Under the Central American Border Control Agreement (CA-4), you can travel freely between El Salvador, Honduras, Nicaragua and Guatemala for tourism for up to 90 days once per year by buying a tourist card when you first enter one of these countries. The 'tourist card' includes a CA-4 visa. You can request an extension of your CA-4 visa prior to its expiry by contacting the local immigration authorities (Centro de Gobierno, San Salvador, Tel: (503)2221 2111). If you stay more than 90 days without permission, you may face fines and have to leave. Visitors expelled from one country may be refused entry to the others. If your visit isn't for tourism or you plan to stay longer than permitted under the CA-4 visa conditions, you'll need to get a visa before you go. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of El Salvador for up-to-date information. If you're travelling through the United States (US), or transiting Honolulu or another US point of entry, you must meet US entry/transit requirements. Check your visa requirements with a \n   US Embassy or Consulate well in advance of travel. More information: \n   United States of America. If you fly via Canada, you'll need an eTA (electronic Travel Authorisation) for Canada. More information:"}, "Equatorial Guinea": {"country-iso": "GQ", "name": "Equatorial Guinea", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Eritrea": {"country-iso": "ER", "name": "Eritrea", "advisory-text": "Reconsider your need to travel", "visa-info": " You need a visa to enter Eritrea. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Eritrea for up-to-date information."}, "Estonia": {"country-iso": "EE", "name": "Estonia", "advisory-text": "Exercise normal safety precautions", "visa-info": " Estonia is a party to the Schengen Convention. This allows you to enter Estonia without a visa in some circumstances. More information: \n   \nSchengen Convention Schengen Convention In other circumstances, you need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Estonia for the most up-to-date information."}, "Eswatini": {"country-iso": "SZ", "name": "Eswatini", "advisory-text": "Exercise normal safety precautions", "visa-info": "na"}, "Ethiopia": {"country-iso": "ET", "name": "Ethiopia", "advisory-text": "High degree of caution", "visa-info": " Visas on-arrival are only available from Bole International Airport. All other travellers need to get a visa in advance. More information: \n   Government of Ethiopia For a business visa you may need prior approval from the Ethiopian Department of Immigration and Nationality Affairs before applying to an \n   Embassy of the Federal Democratic Republic of Ethiopia Embassy of the Federal Democratic Republic of Ethiopia Check your visa’s expiry date. If you overstay your visa, you’ll be fined USD10 per day. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n    Embassy of the Federal Democratic Republic of Ethiopia for up-to-date information."}, "Federated States of Micronesia": {"country-iso": "FM", "name": "Federated States of Micronesia", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can get a tourist visa on arrival for stays of up to 30 days, if you show an onward or return ticket. If you want to work or study, or you'll stay longer than 30 days, you need to apply for an entry permit. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. For up-to-date information and entry permits, contact the Division of Immigration in Pohnpei (Tel: 691 320 5844/2605 Fax: 691 320 7250/6240, email: \n   imhq@mail.fm). If you’re travelling to FSM through the United States of America (including Honolulu and Guam), you'll need to meet US entry or transit requirements. Check visa requirements with a \n   US Embassy or Consulate before you travel. More information: \n   United States of America travel advice"}, "Fiji": {"country-iso": "FJ", "name": "Fiji", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australians don't need a visa to travel to Fiji for tourism. Visitor visas for stays of less than four months are issued on arrival, provided you have a return ticket and confirmation of accommodation. You may require a visa for other purposes. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy, High Commission or Consulate of Fiji for up-to-date information. More information:"}, "Finland": {"country-iso": "FI", "name": "Finland", "advisory-text": "Exercise normal safety precautions", "visa-info": " ​Finland is part of the \n   Schengen Area, along with a number of other European countries. This allows you to enter Finland without a visa in some circumstances. Monitor border conditions by checking local news sources and asking transport providers directly. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Finland for the most up-to-date information."}, "France": {"country-iso": "FR", "name": "France", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of France for up-to-date information. France is part of the \n   Schengen area. This allows you to enter France without a visa in some circumstances. In other circumstances, you'll need a visa. If you're travelling for reasons other than tourism, or for more than 90 days, get a visa from French authorities in Australia before you arrive. You can't apply for a visa or change your visa status once inside French territory (for example, from a tourist visa to a student or resident visa). More information: \n   Schengen area"}, "French Polynesia": {"country-iso": "PF", "name": "French Polynesia", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're visiting French Polynesia for tourism, you generally won't need a visa. In other circumstances, you may need one. Entry and exit conditions (such as visas, currency, customs and quarantine regulations) can change at short notice. French Polynesia is an overseas territory of France. Visit the \n   Consulate of France in Sydney website or contact an \n      Embassy or \n   Consulate of France for up-to-date information."}, "Gabon": {"country-iso": "GA", "name": "Gabon", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to enter Gabon. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest Embassy or Consulate of Gabon for up-to-date information. Gabon doesn't have diplomatic representation in Australia. The nearest embassies are in Jakarta and Tokyo."}, "Georgia": {"country-iso": "GE", "name": "Georgia", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australian passport holders can visit Georgia without a visa for up to 12 months. For longer stays you'll need a visa. More information: Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Georgian Foreign Ministry or the \n      Embassy or \n   Consulate of Georgia for up-to-date information."}, "Germany": {"country-iso": "DE", "name": "Germany", "advisory-text": "Exercise normal safety precautions", "visa-info": " Germany is a part of the Schengen area, along with a number of other European countries. This allows you to enter Germany without a visa in some circumstances. In other circumstances, you'll need a visa. More information: \n   Schengen Convention A number of Schengen countries, including Germany, have introduced temporary immigration controls. Carry your passport with you when entering or leaving Germany, even if travelling to or from another Schengen country. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or \n   Consulate of Germany, or visit their website, for the most up-to-date information."}, "Ghana": {"country-iso": "GH", "name": "Ghana", "advisory-text": "Exercise normal safety precautions", "visa-info": " You need a visa to enter Ghana. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy or \n      High Commission of Ghana for up-to-date information."}, "Gibraltar": {"country-iso": "GI", "name": "Gibraltar", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Greece": {"country-iso": "GR", "name": "Greece", "advisory-text": "Exercise normal safety precautions", "visa-info": " Greece is a part of the \n   Schengen Area, along with a number of other European countries. This allows you to enter Greece without a visa in some circumstances. In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or \n   Consulate of Greece for up-to-date information. More information:"}, "Grenada": {"country-iso": "GD", "name": "Grenada", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Guam": {"country-iso": "GU", "name": "Guam", "advisory-text": "Exercise normal safety precautions", "visa-info": " Guam is an unincorporated US territory. US entry and visa requirements apply. The US administers a strict entry regime. You may be refused entry on arrival if you don't comply with entry requirements. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or \n   Consulate of the United States for up-to-date information, even if you only plan to transit Guam. More information: Travel advice for the United States of America"}, "Guatemala": {"country-iso": "GT", "name": "Guatemala", "advisory-text": "High degree of caution", "visa-info": " If you're visiting Guatemala for tourism and you'll stay for 90 days or less, you won't need a visa to enter Guatemala, provided you have: Tourists can extend their stay once for a further 90 days. To extend your stay, you'll need to apply at the local immigration office before the end of the initial 90 day period. If you're visiting Guatemala for a different purpose or you plan to stay for a longer period, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Guatemala for up-to-date information or to apply for an entry visa. If you are travelling or transiting to Guatemala through the United States of America (US), you'll need to meet US entry/transit requirements. Check visa requirements with an \n   Embassy or Consulate of the United States well in advance of your travel. More information: \n   Travel advice for the United States of America If you are flying to Guatemala via Canada, get an eTA (electronic Travel Authorisation) for Canada. More information:"}, "Guinea": {"country-iso": "GN", "name": "Guinea", "advisory-text": "High degree of caution", "visa-info": "na"}, "Guinea-Bissau": {"country-iso": "GW", "name": "Guinea-Bissau", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Guyana": {"country-iso": "GY", "name": "Guyana", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the \n   High Commission of Guyana for up-to-date information."}, "Haiti": {"country-iso": "HT", "name": "Haiti", "advisory-text": "Reconsider your need to travel", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Haiti does not have an embassy in Australia, but it is currently establishing an Honorary Consulate in Brisbane. The nearest embassy is located in Japan. Contact details are: No.34 Kowa Building, No 906 4-12-24 Nishi-Azabu, Minato-ku Tokyo Japan Phone: +81 3 3486 7096 Fax: +81 3 3486 7070 Email: \n    amb.japon@diplomatie.ht See also the websites of the \n    Embassy of Haiti in Washington DC (USA) and the \n    Haiti Ministry of Tourism."}, "Honduras": {"country-iso": "HN", "name": "Honduras", "advisory-text": "High degree of caution", "visa-info": " You don’t need a visa to visit Honduras for tourism and less than 90 days. In other circumstances you do. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or Consulate of Honduras for the up-to-date information. If you are travelling through the United States of America, or if you are transiting in Honolulu or another US point of entry, you'll need to meet US entry/transit requirements. Check visa requirements with an \n      Embassy or \n      Consulate of the United States well in advance of your travel. More information: \n      United States of America If you are flying via Canada, you'll need an eTA (electronic Travel Authorisation) for Canada. More information:"}, "Hong Kong": {"country-iso": "HK", "name": "Hong Kong", "advisory-text": "High degree of caution", "visa-info": " Hong Kong is a Special Administrative Region (SAR) and has separate immigration regulations from those of the People's Republic of China. If you visit Hong Kong for tourism for less than 90 days, you generally won't need to organise a visa in advance. In all other cases, you need a visa. Visa and other entry and exit conditions can change at short notice. Contact the \n   Hong Kong Economic and Trade Office in Sydney or the \n   Hong Kong Special Administrative Region Immigration Department before travelling for up-to-date information."}, "Hungary": {"country-iso": "HU", "name": "Hungary", "advisory-text": "Exercise normal safety precautions", "visa-info": " Hungary is part of the \n   Schengen area, along with a number of other European countries. This allows you to enter Hungary without a visa in some circumstances. More information: Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or \n   Consulate of Hungary for up-to-date information."}, "Iceland": {"country-iso": "IS", "name": "Iceland", "advisory-text": "Exercise normal safety precautions", "visa-info": " Iceland is part of the Schengen area. This allows you to enter Iceland without a visa.  More information: \n   Schengen Convention Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or \n   Consulate of Iceland for up-to-date information."}, "India": {"country-iso": "IN", "name": "India", "advisory-text": "High degree of caution", "visa-info": " You need a visa to enter India. Visas must be arranged before arrival. The Electronic Visa (e-Visa) is available to eligible Australians for tourism, business and/or medical-related travel for up to 60 days. Get it at least four days before you arrive in India. \n   Double entry is permitted for those travelling on a tourist or business e-Visa. Triple entry is permitted for those travelling on a medical e-Visa. An e-Visa may only be used a maximum of two times in a calendar year. Find more information about the eligibility criteria on the Government of India's e-Visa website. Beware of fake websites offering the e-Visa service. Make sure you are eligible for an e-Visa before you apply. he Electronic Visa (e-Visa) is available to eligible Australians for tourism, business and/or medical-related travel for up Double entry is permitted for those travelling on a tourist or business e-Visa. Triple entry is permitted for those travelling on a medical e-Visa. An e-Visa may only be used a maximum of two times in a calendar year. Find more information about the eligibility criteria on the Government of India's e-Visa website . Beware of fake websites offering the e-Visa service. Make sure you are eligible for an e-Visa before you apply.  Carry a printed copy of your e-Visa (known as an electronic travel authorisation of ETA). A formal visa will be put in your passport on arrival in India. Long queues are common at immigration counters in India, regardless of visa type. Not all international airports in India allow passengers to enter with an e-Visa. The e-Visa is only valid for entry through 24 \n   \ndesignated airports. If you want to enter through another location, arrange for an Indian visa before you arrive through an \n   \nIndian High Commission, Consulate, Embassy or agent. If you arrive with an e-Visa at an entry point where the e-Visa is not recognised, you won't be able to apply for any other visa. You won't be allowed in and deported. If you hold an e-Visa you may leave from any authorised immigration check point in India. designated airports Indian High Commission, Consulate, Embassy All other visa applicants need to make an appointment online prior to submitting their visa application. If you don't have a valid passport or visa you could be deported by Indian authorities. The Australian High Commission or Consulates General in India can't facilitate your stay if you arrive without proper documentation. For more see the Government of India's \n   \ne-Visa and Ministry of Home Affairs websites. e-Visa Volunteers: If you're considering paid or unpaid volunteer work (including students visiting India under the New Colombo Plan), discuss relevant visa requirements with your local Indian diplomatic mission well ahead of any travel. Volunteer responsibly. Ensure you are contributing in an ethical and meaningful way. Read this advice with the pages on volunteering listed below. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   \nIndian High Commission for the latest information. Indian High Commission More information:  India's e-Visa  There are heavy penalties, including imprisonment, for overstaying your visa. Check and comply with your visa conditions. Depart India before your visa expires. If your passport is lost or stolen while you're in India, you'll need an exit visa from the Indian Ministry of Home Affairs before you can leave. After reporting your lost passport to police, arrange a replacement travel document from the nearest Australian mission and then apply for an exit visa."}, "Indonesia": {"country-iso": "ID", "name": "Indonesia", "advisory-text": "High degree of caution", "visa-info": " You can visit Indonesia visa-free for up to 30 days. You can't extend your stay if you enter Indonesia visa-free. If you intend to stay in Indonesia for more than 30 days, apply for a visa: Free visas and visas on arrival aren't available at every land entry-point. If you're planning to enter Indonesia by land, contact the \n   Embassy or Consulate of Indonesia to check whether you can get the free visa or visa on arrival. Visas are non-transferable. The period of your stay is calculated from the day you arrive. Part days are counted as whole days. You'll be fined for each additional day you stay in Indonesia beyond your visa. Some airlines flying from Australia to Jakarta and Bali offer on-board visa processing. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the nearest Embassy or Consulate of Indonesia for up-to-date information. You can't work or conduct research in Indonesia unless you have the appropriate visa. If you breach Indonesian immigration regulations, you can be fined, jailed, deported or banned from re-entry. Fines of 1,000,000 IDR (approx. AU$100) per day apply for the maximum 60 day overstay period. If you have a criminal record, you may be refused entry to Indonesia, regardless of how long ago the offence took place. If you're concerned about being denied entry, contact an \n   Embassy or Consulate of Indonesia before travelling. Decisions of Indonesian immigration officials are final. The Australian Government can't intervene. If travelling on an emergency passport, you'll only be allowed to enter Indonesia if you have a visa from an \n   Embassy or Consulate of Indonesia."}, "Iran": {"country-iso": "IR", "name": "Iran", "advisory-text": "Reconsider your need to travel", "visa-info": " If you decide to travel to Iran, despite our advice, you'll need a visa to enter Iran. You can apply for a 30 day tourist visa-on-arrival if: The visa-on-arrival must be paid for in cash. Additional requirements may apply. If you plan to get a visa on arrival, contact the \n   Embassy of Iran for detailed information on requirements before you travel. In all other circumstances, you'll need to apply to the \n   Embassy of Iran for a visa before you travel. Visas and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Embassy of Iran for up-to-date information. Iranian visas are a matter for the Government of Iran. The Australian Embassy is unable to intervene in visa issues, including visas on arrival."}, "Iraq": {"country-iso": "IQ", "name": "Iraq", "advisory-text": "Do not travel", "visa-info": " If you plan to enter Iraq despite our strong advice, you'll need a visa issued in advance by the Government of Iraq. Australian travellers arriving through Erbil International Airport or Sulaymaniyah International Airport may be entitled to a 30 day visa on arrival. This visa is only valid for travel within the region administered by the Kurdistan Regional Government (KRG) and is not accepted for travel to other areas of Iraq. Visas for travel to the rest of Iraq must be obtained in advance. You may be arrested for immigration offences if you enter Iraq without a valid visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Iraq or the \n   Iraqi Ministry of Interior for up-to-date information."}, "Ireland": {"country-iso": "IE", "name": "Ireland", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don't need a visa for visits less than 90 days for tourism. On arrival, immigration authorities may ask for details of accommodation bookings, return flights and contacts in Ireland. You may be refused entry, or be given a limited stay visa, if Irish Immigration don't believe you're a genuine tourist. For longer visits or if you wish to work or study in Ireland, you will need a visa. Ireland is not a part of the Schengen area and therefore does not accept Schengen visas. More information: \n   Schengen bulletin Visa and other entry and exit requirements can change at short notice. Contact the \n   Irish Naturalisation and Immigration Service or an \n      Embassy or Consulate of Ireland for up-to-date visa information."}, "Israel, Gaza and the West Bank": {"country-iso": "IL", "name": "Israel, Gaza and the West Bank", "advisory-text": "High degree of caution", "visa-info": " If you're travelling to Israel for tourism purposes for a period of less than three months, you generally won't need a visa. For longer stays, you'll need to arrange a visa in advance. Visa and other entry and exit conditions (such as security checks and currency, customs and quarantine regulations) can change at short notice. Visit the \n   Israel Government Portal or contact the nearest \n   Embassy or Consulate of Israel for up-to-date information."}, "Italy": {"country-iso": "IT", "name": "Italy", "advisory-text": "Exercise normal safety precautions", "visa-info": " Italy is a party to the \n   Schengen Convention, along with a number of other European countries. This allows you to enter without a visa in some circumstances. In other circumstances, you'll need to get a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Italy or visit the \n   Embassy of Italy website for the most up-to-date information. More information:"}, "Jamaica": {"country-iso": "JM", "name": "Jamaica", "advisory-text": "High degree of caution", "visa-info": " You won't need a visa to enter Jamaica if your visit is: In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Jamaica for up-to-date information. Jamaica doesn't have a High Commission, Embassy or Consulate in Australia. Its nearest mission is the \n   Embassy of Jamaica in Tokyo. If you're travelling to Jamaica through the United States, or if you are transiting in Honolulu or another US point of entry, you must meet US entry/transit requirements. Check your visa requirements with a \n   US Embassy or Consulate well in advance of your travel. More information: \n   United States of America"}, "Japan": {"country-iso": "JP", "name": "Japan", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're  visiting for less than 90 days as a tourist, for a business trip or conference, or to visit friends and family, you don't need a visa. To qualify,  you need to show evidence of sufficient funds and an onward/return ticket  or confirmed accommodation arrangements. If immigration authorities believe you intend to seek work, they can refuse you entry for up to five years. You can't appeal the decision. On arrival, you must declare if you have a criminal record. If you have a criminal record, immigration may refuse you entry. Before travelling, contact the nearest Embassy or Consulate of Japan to check if you need a visa. Some employment  agents misleadingly entice foreigners to work in Japan without the correct  visa. If you work while on a tourist visa, you could be prosecuted.  See \n   Laws. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \nembassy or consulate of Japan for up-to-date information. The \n   Embassy of Japan in Canberra has information for visa applicants on its website. More information:"}, "Jordan": {"country-iso": "JO", "name": "Jordan", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to visit Jordan. If you are visiting for tourism, you can get a single entry visa valid for one month on arrival at the airports or at the Sheikh Hussein/North Border crossing at the Jordan/Israel border. Entry visas are not issued at the Wadi Araba/South Border crossing (Aqaba/Eilat) or the Allenby/King Hussein Bridge (the other crossing on the Jordan/Israel border). You'll need to arrange a visa in advance if: Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Jordan for up-to-date information."}, "Kazakhstan": {"country-iso": "KZ", "name": "Kazakhstan", "advisory-text": "Exercise normal safety precautions", "visa-info": " If your stay is for 30 days or less, you won't need a visa to enter Kazakhstan. For longer stays, you'll need to get a visa before you travel. Get the appropriate visa for the purpose of your visit. Check the validity dates for your visa and any restrictions before travelling. Penalties for visa infringements or overstaying include fines, imprisonment and deportation. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Kazakhstan for up-to-date information."}, "Kenya": {"country-iso": "KE", "name": "Kenya", "advisory-text": "High degree of caution", "visa-info": "na"}, "Kiribati": {"country-iso": "KI", "name": "Kiribati", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Kosovo": {"country-iso": "RS", "name": "Kosovo", "advisory-text": "High degree of caution", "visa-info": " You don't need a visa to enter for less than 90 days for tourism. However, you may need to provide documents showing the reason for your visit when entering. Border authorities issue a 90-day entry stamp, which is renewable for longer stays. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. For up-to-date information on visa requirements, visit the \n   Kosovo Foreign Ministry website, or contact an \n   Embassy or Consulate of Kosovo."}, "Kuwait": {"country-iso": "KW", "name": "Kuwait", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to enter. You can get a visa on arrival that is valid for three months from the date of entry. Visa payments are accepted in cash (Kuwaiti Dinar). Or you can get tourist, business and work visas online through the Kuwait e-Visa website and pay in cash on arrival at Kuwait International Airport. For employment or residency visas, contact an \n   Embassy of Kuwait. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy of Kuwait for up-to-date information. Visitors who overstay their visas face significant fines or travel bans. Check the expiry date on your visa carefully and comply with all conditions."}, "Kyrgyz Republic": {"country-iso": "KG", "name": "Kyrgyz Republic", "advisory-text": "High degree of caution", "visa-info": "na"}, "Laos": {"country-iso": "LA", "name": "Laos", "advisory-text": "Exercise normal safety precautions", "visa-info": " You'll need a visa to enter Laos. If you're visiting Laos for tourism, you can get a 30-day tourist visa on arrival at a number of locations, including the International Airports in Vientiane and Luang Prabang and at some land border crossings. To apply you'll need two blank pages in your passport and two recent passport-size photos. If you're entering Laos through Wattay International Airport or by crossing the First Lao-Thai Friendship Bridge, you can apply for a visa online beforehand. More information: Lao Official Online eVisa In other circumstances, you'll need to apply for a visa from the Embassy of Laos before you travel. More information: \n   Department of Immigration of Laos Lao immigration authorities will stop issuing on-arrival visas from the below border checkpoints from the following dates: 31 December 2019 Pang Hok, Phongsaly province Nam Soy, Houaphanh province Nam Ngeun, Xayabouly province 31 March 2020 Nam Kanh, Xiengkhouang province Savannakhet International Airport, Savannakhet province Nam Heuang Friendship Bridge, Xayabouly province 30 June 2020 Nam Phao, Bolikhamxay province Na Pao, Khammouane province Phoukeua, Attapeu province Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy of Laos for up-to-date information. Some travellers to Laos choose to travel by road to Thailand to renew their visa for Laos. Since December 2016, Thailand has limited this practice by restricting the number of visa exemptions it will grant for entries to Thailand by land to two per person per calendar year. This restriction doesn't apply to arrivals in Thailand through international airports. More information: \n   Thailand"}, "Latvia": {"country-iso": "LV", "name": "Latvia", "advisory-text": "Exercise normal safety precautions", "visa-info": " Latvia is a party to the Schengen Convention, along with a number of other European countries. This allows you to enter Latvia without a visa in some circumstances. More information: \n   Schengen Convention Monitor border conditions by checking local news sources and asking transport providers directly. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Latvia does not have an Embassy in Australia. However, you can submit your Latvian visa application through the \n   Austrian Embassy in Canberra."}, "Lebanon": {"country-iso": "LB", "name": "Lebanon", "advisory-text": "High degree of caution", "visa-info": " Most nationalities, including Australians, can get tourist visas for Lebanon on arrival. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Lebanon for up-to-date visa information."}, "Lesotho": {"country-iso": "LS", "name": "Lesotho", "advisory-text": "High degree of caution", "visa-info": " You can visit Lesotho for tourism for up to 14 days without a visa. For other visits you'll need to get a visa in advance. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   \nEmbassy or Consulate of Lesotho for up-to-date information. Embassy or Consulate of for up-to-date information."}, "Liberia": {"country-iso": "LR", "name": "Liberia", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Liberia for up-to-date information."}, "Libya": {"country-iso": "LY", "name": "Libya", "advisory-text": "Do not travel", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Libya for the most up to date information."}, "Liechtenstein": {"country-iso": "LI", "name": "Liechtenstein", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Lithuania": {"country-iso": "LT", "name": "Lithuania", "advisory-text": "Exercise normal safety precautions", "visa-info": " Lithuania is part of the Schengen area, which allows you to enter without a visa in some circumstances. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Lithuania for up-to-date information. More information: Schengen Convention"}, "Luxembourg": {"country-iso": "LU", "name": "Luxembourg", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Macau": {"country-iso": "MO", "name": "Macau", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you’re visiting Macau for tourism for less than 30 days, you generally won’t need to get a visa. In other circumstances, you'll need a visa. Macau is a Special Administrative Region (SAR) of the People's Republic of China. It has separate visa and entry administration to that of Hong Kong and mainland China. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of the People's Republic of China or visit the \n   Macau Immigration Service or \n   Macau tourism websites for up-to-date information, well in advance of travel."}, "Madagascar": {"country-iso": "MG", "name": "Madagascar", "advisory-text": "High degree of caution", "visa-info": "na"}, "Malawi": {"country-iso": "MW", "name": "Malawi", "advisory-text": "Exercise normal safety precautions", "visa-info": "na"}, "Malaysia": {"country-iso": "MY", "name": "Malaysia", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australian passport holders can get a 90-day tourism visa on arrival. If you're visiting for business, volunteering, study or research – arrange your visa in advance. Contact a \n   High Commission or Embassy of Malaysia for the most up-to-date information on visa requirements and other entry and exit conditions (such as currency, customs and quarantine regulations). If you breach your visa conditions or overstay your visa, you could face penalties including fines, detention and/or deportation."}, "Maldives": {"country-iso": "MV", "name": "Maldives", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can get a 30-day visa-on-arrival if: In other situations, you'll need to get a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Department of Immigration and Emigration of the Republic of Maldives for up-to-date information."}, "Mali": {"country-iso": "ML", "name": "Mali", "advisory-text": "Do not travel", "visa-info": " You will need a visa to enter Mali. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Mali for up-to-date information."}, "Malta": {"country-iso": "MT", "name": "Malta", "advisory-text": "Exercise normal safety precautions", "visa-info": " Malta is a part of the Schengen area, along with a number of other European countries. This allows you to enter Malta without a visa in some circumstances. In other circumstances, you'll need a visa. More information: \n   Schengen Convention Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. More information:"}, "Marshall Islands": {"country-iso": "MH", "name": "Marshall Islands", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australians are eligible for a 30-day visitor visa-on-arrival. You can extend this at the Immigration Division for a fee. Visitors wishing to travel to Kwajalein must hold an Entry Authorisation issued by the US Military. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. For up-to-date visa information for the Marshall Islands, contact: Division of ImmigrationPO Box 890 Majuro, Marshall Islands 96960 \n   Tel: (+692) 625 8633/4572 \n   Fax: (+692) 625 4246 \n   Email: \n   rmi_majuro@rmi-immigration.com If you transit through the US on the way to the Marshall Islands you must meet US entry/transit requirements. Check with your nearest \n    US Embassy or Consulate for information well in advance of your travel and read our travel advice for the \n    United States of America."}, "Mauritania": {"country-iso": "MR", "name": "Mauritania", "advisory-text": "Reconsider your need to travel", "visa-info": "na"}, "Mauritius": {"country-iso": "MU", "name": "Mauritius", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don’t need a visa for staying less than 60 days for tourism. For other types of visits you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Mauritius for up-to-date information. Embassy or Consulate of Mauritius"}, "Mexico": {"country-iso": "MX", "name": "Mexico", "advisory-text": "High degree of caution", "visa-info": " If you're visiting for 180 days or less, you generally won't need a visa. You must complete a Multiple Immigration Form (FMM) and make sure your passport is stamped by immigration officials on arrival. If you fail to complete this form or to have your passport stamped, you could be detained and deported. If you're entering by land, you can complete the FMM in advance online or get a form from the immigration office (Instituto Nacional de Migración) usually located near, not directly at, a border crossing. If you're entering by air, you can either complete the FMM in advance online or on arrival. Present your completed FMM for inspection at immigration. Keep the FMM safe as you’ll need to present it when you depart. Visa and other entry and exit conditions (such as customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Mexico for up-to-date information. If you're travelling or transiting through the United States, you'll need to meet US entry/transit requirements. Make sure you check your visa requirements with a \n   US Embassy or Consulate well before you travel. Allow at least four days to apply for a US transit visa from Mexico. If you fly via Canada, you'll need an electronic Travel Authorisation (eTA) for Canada. Apply via the \n   Visit Canada website. More information:"}, "Moldova": {"country-iso": "MD", "name": "Moldova", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're visiting Moldova for up to 90 days (within a six month period), you won't need a visa. For longer stays, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Moldova, or visit the \n   Moldova Government website for up-to-date information. Record your entry date and, where applicable, check your visa dates carefully. Penalties for overstays include deportation."}, "Monaco": {"country-iso": "MC", "name": "Monaco", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Mongolia": {"country-iso": "MN", "name": "Mongolia", "advisory-text": "Exercise normal safety precautions", "visa-info": " You need a visa to enter Mongolia. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Mongolia for the up-to-date information."}, "Montenegro": {"country-iso": "ME", "name": "Montenegro", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don't need a visa for visits up to 90 days within a six month period from the date of first entry. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice, contact the nearest \n   Embassy of Montenegro for up-to-date information."}, "Morocco": {"country-iso": "MA", "name": "Morocco", "advisory-text": "High degree of caution", "visa-info": " You won't need a visa if you plan to visit Morocco for less than three months. In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Embassy of Morocco for up-to-date information or to apply for a visa."}, "Mozambique": {"country-iso": "MZ", "name": "Mozambique", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to enter Mozambique. If you meet certain conditions, you may be eligible for a visa on arrival. Some travellers have faced difficulties getting a visa on arrival. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or High Commission of Mozambique to apply for a visa before you travel or for up-to-date information on entry and exit conditions."}, "Myanmar": {"country-iso": "MM", "name": "Myanmar", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to enter Myanmar. Apply for a visa at your closest Embassy of The Republic of the Union of Myanmar prior to travel. From 1 October 2019 to 30 September 2020, Australian passport holders will be eligible to apply for tourist Visa on arrival. More information: Ministry of Hotels and Tourism Ministry of Hotels and Tourism Alternatively, if you are travelling for tourism or business you can apply for an e-Visa online for use at select entry points. Apply for an e-Visa directly through the \n   Ministry of Labour, Immigration and Population website. Print out the e-Visa approval letter and present it to Myanmar immigration authorities on arrival. E-Visas can be used to enter Myanmar at: E-Visas can't be used for entry at seaports. Cruise passengers must arrange visas in advance. Be aware of unauthorised websites that claim to offer e-Visas. While some websites will provide a legitimate visa for an additional fee, there are other websites that are fraudulent. Be careful about using links in emails or other websites to access the official site. To avoid such scams, only use official Myanmar Government services to arrange your visa. Travel to parts of Myanmar is strictly controlled by government authorities, including through visa conditions. Australians have been deported and detained for visa offences. If you overstay your visa, you won't be allowed to leave until you pay a fine. You can also be arrested or deported. Myanmar authorities can blacklist you, which means you may never be allowed to return to Myanmar. If you breach your visa conditions, you could be arrested or deported. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of The Republic of the Union of Myanmar for up-to-date information."}, "Namibia": {"country-iso": "NA", "name": "Namibia", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can visit Namibia for tourism for up to 3 months without a visa. For other visits you need to get a visa in advance. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the Consulate-General of Namibia in Sydney or visit the website of the Ministry of Home Affairs and Immigration for up-to-date visa and other travel information. Make sure the correct visa and entry period is stamped in your passport, even if you are just transiting. Check your visa before leaving the immigration counter. If you don't comply with your visa conditions or other immigration requirements, you could face detention and/or fines."}, "Nauru": {"country-iso": "NR", "name": "Nauru", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Nepal": {"country-iso": "NP", "name": "Nepal", "advisory-text": "High degree of caution", "visa-info": "na"}, "Netherlands": {"country-iso": "NL", "name": "Netherlands", "advisory-text": "Exercise normal safety precautions", "visa-info": " The Netherlands is a part of the Schengen area. This allows you to enter without a visa in some circumstances. Read the Smartraveller \n   Schengen Convention bulletin before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of the Netherlands, or visit their \n   website for up-to-date information."}, "Netherlands Antilles": {"country-iso": "NL", "name": "Netherlands Antilles", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "New Caledonia": {"country-iso": "NC", "name": "New Caledonia", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you are visiting New Caledonia for tourism and you have a return ticket, you generally won't need a visa. In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. New Caledonia is an overseas territory of France. Visit the website of the French \n   Consulate-General in Sydney  or contact an \n   Embassy or Consulate of France for up-to-date information. Consulate-General in Sydney"}, "New Zealand": {"country-iso": "NZ", "name": "New Zealand", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're travelling on your Australian passport, or you hold a current Australian resident return visa, you don't need a visa or permit to visit New Zealand unless: If that is the case, contact \n   New Zealand Visa Application Centre well before you travel for advice on your visa requirements. From 1 October 2019, Australian permanent residents need a New Zealand Electronic Travel Authority (NZeTA) to enter New Zealand. Australian citizens are exempt from this requirement. You can apply online from July 2019. More information: New Zealand Immigration New Zealand Visa Application Centre Suite 9.03, Level 9,\n139 Macquarie Street,\nSydney, New South Wales 2000. Telephone \n   1800 388 718\nWebsite:  \n   \nwww.ttsnzvisa.com\nEmail : \n   ttssydneynz@ttsvisas.com (For visa application enquiries) www.ttsnzvisa.com Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. More information:  \n    New Zealand Immigration."}, "Nicaragua": {"country-iso": "NI", "name": "Nicaragua", "advisory-text": "High degree of caution", "visa-info": " Tourists must carry a tourist card, which can be purchased on entry. Nicaragua is part of the Central America Border Control Agreement (CA-4). Under the agreement, foreigners may travel for up to 90 days between Nicaragua, Honduras, El Salvador and Guatemala without completing entry and exit formalities. The period begins at the first point of entry to any of these countries. This waiver is issued once per year, but you can request an extension prior to its expiry. If you stay more than 90 days without permission, you could be fined and expelled from any of the four countries. If you're expelled from one country, you may be refused entry to the others. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest Embassy of Nicaragua for the most up-to-date information. More information: \n   Embassy of Nicaragua (Japan)"}, "Niger": {"country-iso": "NG", "name": "Niger", "advisory-text": "Do not travel", "visa-info": " You'll need a visa to enter Niger. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Niger for up-to-date information."}, "Nigeria": {"country-iso": "NG", "name": "Nigeria", "advisory-text": "Reconsider your need to travel", "visa-info": " You need a visa or Residence Permit (CERPAC or Green Card) to visit Nigeria. Visa on arrival services are available to certain categories of travellers, subject to strict conditions including getting a letter before travelling. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Nigeria or visit the \n   Nigeria Immigration Service website for the latest information."}, "Niue": {"country-iso": "NU", "name": "Niue", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "North Korea (Democratic People's Republic of Korea)": {"country-iso": "KP", "name": "North Korea (Democratic People's Republic of Korea)", "advisory-text": "Reconsider your need to travel", "visa-info": " You'll need a visa for all types of travel to the DPRK. Foreigners arriving without a valid visa may be detained, arrested, fined or denied entry. Because there is no longer a DPRK embassy or consulate in Australia, you'll need to travel to another country, such as China, to get your visa for the DPRK. You may need to provide your recent international travel itineraries as part of the visa application process and, possibly, on arrival in the DPRK. Business travellers generally require sponsorship by a DPRK organisation and permission from the DPRK Ministry of Foreign Affairs. Professional journalists must apply for special permission to visit the DPRK and are not permitted to enter the country on a tourist visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the nearest \n   Embassy or Consulate of the Democratic People's Republic of Korea for up-to-date information. Almost all travel into the DPRK is routed through Beijing. You must  get a double or multiple-entry visa for China so that you can re-enter China on departure from the DPRK. Contact an \n   Embassy or Consulate of the People's Republic of China for the most up-to-date visa information for China. More information: \n   China"}, "North Macedonia (Republic of North Macedonia)": {"country-iso": "MK", "name": "North Macedonia (Republic of North Macedonia)", "advisory-text": "High degree of caution", "visa-info": " You don't need a visa for visits up to 90 days within a six-month period from the date of first entry. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of the Republic of North Macedonia or visit \n   the Republic of North Macedonia Ministry of Foreign Affairs website for up-to-date information."}, "Northern Mariana Islands": {"country-iso": "MP", "name": "Northern Mariana Islands", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Norway": {"country-iso": "NO", "name": "Norway", "advisory-text": "Exercise normal safety precautions", "visa-info": " Norway is part of the Schengen area, along with a number of other European countries. This allows you to enter Norway without a visa in some circumstances. In other circumstances you'll need a visa. More information: \n   Schengen Convention The Norwegian territory of Svalbard is not part of the Schengen area. If you are planning to travel to Svalbard, you will need a valid passport to enter and you will need to meet Schengen area entry requirements when returning to Norway's mainland. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Norway for up-to-date information."}, "Oman": {"country-iso": "OM", "name": "Oman", "advisory-text": "Exercise normal safety precautions", "visa-info": " You need a visa to enter Oman. Apply for an e-visa \n   online. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of the Sultanate of Oman for up-to-date information."}, "Pakistan": {"country-iso": "PK", "name": "Pakistan", "advisory-text": "Reconsider your need to travel", "visa-info": " You'll need a visa to enter Pakistan. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Pakistan High Commission for up-to-date information. To exit Pakistan, you must have a valid visa, a Pakistani national identity card or a valid Pakistani passport. You won't be allowed to board your flight if your visa has expired. You could also face heavy penalties, including fines and  detention. Take care not to overstay your visa. If your visa has expired, contact the Ministry of Interior to get an exit visa."}, "Palau": {"country-iso": "PW", "name": "Palau", "advisory-text": "Exercise normal safety precautions", "visa-info": " Visitor visas (entry permits) for stays of up to 30 days are issued on arrival subject to evidence of an onward or return ticket. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Palau doesn't have an embassy or consulate in Australia. For up-to-date visa information, contact the \n   Palau Bureau of Immigration (phone: +680 488 2498/2678, email: \n   imm@palaunet.com) or \n   Ministry of State (phone: +680 767 2490). If you travel via the United States (US), including Guam and Hawaii, you'll need to meet US entry or transit requirements. Check visa requirements with a US Embassy or Consulate well in advance of your travel."}, "Panama": {"country-iso": "PA", "name": "Panama", "advisory-text": "High degree of caution", "visa-info": " You only need a visa if you arrive by sea. To enter, you'll need the equivalent of USD500 or a credit card and a return or onward travel ticket. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \nembassy or consulate of Panama for up-to-date information. If you're travelling or transiting through the United States of America you must meet US entry/transit requirements. Check your visa requirements with an \nembassy or consulate of the United States well in advance of your travel. More information: \n   United States of America. If you're flying via Canada, get an eTA (electronic Travel Authorisation) for Canada. More information:"}, "Papua New Guinea": {"country-iso": "PG", "name": "Papua New Guinea", "advisory-text": "High degree of caution", "visa-info": " You need a visa to enter. Australians can apply for tourist visas on arrival. However, visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n   High Commission, Embassy or Consulate of Papua New Guinea for up-to-date information. Make sure your visa is appropriate for your intended travel. It's illegal to work in PNG on a tourist visa. If you breach PNG's immigration regulations, you can be fined, jailed, deported or banned from re-entry."}, "Paraguay": {"country-iso": "PY", "name": "Paraguay", "advisory-text": "High degree of caution", "visa-info": " You need a visa to visit Paraguay. Australian passport holders can get a 90-day multiple-entry visa on arrival at the Silvio Pettirossi Asunción International Airport for a fee (payable in cash only). The Asunción International Airport is the only port of entry into Paraguay where visas on arrival can be granted. If you're entering the country from a land or water border crossing, or another airport, you must get a visa before you arrive. Contact the nearest \n   Embassy or Consulate of Paraguay for further information on how to apply for a visa before you travel. Ensure your passport is stamped by an immigration official if entering Paraguay overland or you will be subject to a fine when departing the country. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Paraguay for up-to-date information."}, "Peru": {"country-iso": "PE", "name": "Peru", "advisory-text": "High degree of caution", "visa-info": " If you're visiting for tourism, and less than six months, you don't need a visa. Permission is granted on arrival. You can't extend this period. In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   Embassy of Peru for up-to-date information. Embassy of Peru If you're travelling or transiting through the United States, you must meet US entry/transit requirements. Check your visa requirements with a \n   US Embassy or Consulate well in advance of your travel. More information: \n   United States of America. US Embassy or Consulate United States of America"}, "Philippines": {"country-iso": "PH", "name": "Philippines", "advisory-text": "High degree of caution", "visa-info": " If you're visiting the Philippines for tourism or business purposes and for less than 30 days, you won't need a visa. If you're staying for longer or visiting for another reason (such as for work or study), you'll need a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of the Philippines or \n   Philippines Bureau of Immigration website for up-to-date information."}, "Poland": {"country-iso": "PL", "name": "Poland", "advisory-text": "Exercise normal safety precautions", "visa-info": " Poland is part of the Schengen Area, which allows you to enter Poland without a visa in some circumstances. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Poland for up-to-date information. More information: \n   Schengen Convention"}, "Portugal": {"country-iso": "PT", "name": "Portugal", "advisory-text": "Exercise normal safety precautions", "visa-info": " Portugal is part of the Schengen area, along with a number of other European countries. This allows you to enter Portugal without a visa in some circumstances. In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the\n   Portuguese Immigration and Border Service or the nearest \n   Embassy or Consulate of Portugal for up-to-date information, including information about the Work and Holiday visa program. More information:"}, "Qatar": {"country-iso": "QA", "name": "Qatar", "advisory-text": "Exercise normal safety precautions", "visa-info": "na"}, "Reunion": {"country-iso": "RE", "name": "Reunion", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Romania": {"country-iso": "RO", "name": "Romania", "advisory-text": "Exercise normal safety precautions", "visa-info": " You don't need a visa for stays of less than 90 days for tourism. For other kinds of travel you need a visa. Romania isn't a party to the \n   Schengen Convention, but it's working towards becoming a member of the Schengen area. Visa and other entry and exit conditions (such as customs and quarantine regulations) may change as they're realigned with those of the Schengen area. Contact an \n   Embassy or Consulate of Romania for up-to-date information. More information:"}, "Russia": {"country-iso": "RU", "name": "Russia", "advisory-text": "High degree of caution", "visa-info": " You need a visa to enter Russia with the exception of some commercial cruise ship passengers (see below). You cannot get a visa on arrival. If you arrive in Russia without a valid visa, you will be fined, detained and deported at your own expense. You could be barred from re-entering Russian territory. Apply for the correct visa type, such as 'tourist' and 'visitor' visas. Make sure your visa type reflects your intended activities. If your visa type doesn't match the purpose of your visit, you may be denied entry into the country and detained. You may need to provide biometric fingerprints as part of the visa application process. When you receive your Russian visa, check your passport details are correct, including name, passport number, date of birth, visa type, intention of stay and validity dates. If not correct , return it to the Russian Embassy or Consulate for correction as it's impossible to amend visa details once you're in Russia. Special visa-free entry permissions apply to travellers who arrive by commercial cruise ships that dock for less than 72 hours in some port cities, including St Petersburg. Visa-free entry permissions allow you to disembark for short periods as part of an officially recognised tour organised by a cruise company or registered tour operator. Discuss your travel plans with your cruise operator well in advance of travel and check whether you need to obtain a Russian visa. If your passport is lost or stolen while ashore, you will need to obtain an emergency passport and an exit visa to leave Russia within the 72- hour visa-free period. If it’s not done within 72 hours, you will face a court hearing and possible fine, deportation and entry ban. If you transit through Russia on the way to a third country, check transit visa requirements. If you're travelling between Russia and Belarus, you must have visas for both countries. Visa-free entry into Belarus doesn’t apply to travellers arriving from, or travelling to, Russia. For information on Belarusian visas, contact the Ministry of Foreign Affairs of Belarus. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice, contact the \n   Embassy or Consulate of Russia for up-to-date information. More information: \n   Russian Ministry of Internal Affairs"}, "Rwanda": {"country-iso": "RW", "name": "Rwanda", "advisory-text": "High degree of caution", "visa-info": " Australiana  are eligible for a visa on arrival. A visa fee applies. However, visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy of Rwanda, in Japan, for up-to-date information. Australian emergency passports are only accepted with prior approval from the Rwandan immigration department. Do not cross the border into Burundi or DRC."}, "Saint Kitts and Nevis": {"country-iso": "KN", "name": "Saint Kitts and Nevis", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Saint Lucia": {"country-iso": "LC", "name": "Saint Lucia", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Saint Vincent and the Grenadines": {"country-iso": "VC", "name": "Saint Vincent and the Grenadines", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Samoa": {"country-iso": "WS", "name": "Samoa", "advisory-text": "Exercise normal safety precautions", "visa-info": "na"}, "San Marino": {"country-iso": "SM", "name": "San Marino", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Sao Tome and Principe": {"country-iso": "ST", "name": "Sao Tome and Principe", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Saudi Arabia": {"country-iso": "SA", "name": "Saudi Arabia", "advisory-text": "Reconsider your need to travel", "visa-info": " You'll need a visa to enter Saudi Arabia. You can now apply for an online visa for tourism and Umrah pilgrimage. If you're visiting for Hajj or Umrah pilgrimage, contact an \n   Embassy or Consulate of Saudi Arabia for information about special visa requirements. Only Muslims are allowed to enter Makkah (Mecca) and Madinah. Entering by a land entry port (for example the King Fahd Causeway from Bahrain) on a business/visit visa that is annotated “via air’’ may not be allowed. Carefully read and understand the restrictions of your Saudi business/visit visa. If you are planning to enter by land you will need to ensure your visa is not limited for entry “via air” (noting that this may be written in Arabic). Authorities may refuse entry for travellers with this annotation. If you’re transiting through Saudi Arabia, you may need a transit visa. If you overstay your visa, you'll face a fine of 10,000 Saudi Riyals and imprisonment pending deportation proceedings. Visa and other entry and exit conditions (including currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Saudi Arabia for up-to-date information."}, "Senegal": {"country-iso": "SN", "name": "Senegal", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Senegal for up-to-date information."}, "Serbia": {"country-iso": "RS", "name": "Serbia", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you visit for tourism purposes for 90 days or less within a six month period (from the date of first entry), you won't need a visa. For longer stays, or for other kinds of travel (business or study) you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Serbia for up-to-date information."}, "Seychelles": {"country-iso": "SC", "name": "Seychelles", "advisory-text": "Exercise normal safety precautions", "visa-info": " You won't need a visa to enter Seychelles for tourism purposes. You may need to provide evidence of accommodation bookings for your stay on arrival. Entry and exit conditions (such as visa requirements, currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   High Commission or Consulate of the Republic of Seychelles for up-to-date information."}, "Sierra Leone": {"country-iso": "SL", "name": "Sierra Leone", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to enter Sierra Leone. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Sierra Leone for up-to-date information."}, "Singapore": {"country-iso": "SG", "name": "Singapore", "advisory-text": "Exercise normal safety precautions", "visa-info": " You only need a visa for business or tourism if your visit is over 90 days. For employment or study, you must get a visa before going. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy, High Commission or Consulate of Singapore for up-to-date information. For immigration clearance at Singapore, you may have to show: • a passport with at least six months validity • you have enough money for your stay • an onward or return flight ticket •  a visa to enter your next destination • a yellow fever vaccination certificate (if applicable). Singapore has severe penalties for illegal immigration and visa overstay, including fines, imprisonment and caning."}, "Solomon Islands": {"country-iso": "SB", "name": "Solomon Islands", "advisory-text": "Exercise normal safety precautions", "visa-info": " Visitor visas are available on arrival for stays of up to 90 days. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n   High Commission, Embassy or Consulate of Solomon Islands for up-to-date information."}, "Somalia": {"country-iso": "SO", "name": "Somalia", "advisory-text": "Do not travel", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n   Consulate-General of Somalia for up-to-date information. Consulate-Generals and other diplomatic missions of Somalia are affiliated with the central government of Somalia. The authority of the central government isn't established throughout all of Somalia. The validity or effectiveness of a visa could be questioned in areas where the central government's authority is challenged. More information: Permanent Representative of the Somali Republic to the United Nations, 425 East 61st Street, Suite 702, New York, United States, NY10021, telephone (212) 688-9410/5046; fax (212) 759-0651."}, "South Africa": {"country-iso": "ZA", "name": "South Africa", "advisory-text": "High degree of caution", "visa-info": " If you're visiting South Africa for tourism purposes for a period of up to 90 days, you don't need a visa. In other circumstances, you'll need a visa. Leaving South Africa and re-entering South Africa will not automatically give you another 90 days. Be aware that significant changes have been made to some regulations governing immigration issues, including but not limited to: South Africa no longer issues fines to travellers who have overstayed. Travellers are instead declared undesirable and will not be able to re-enter South Africa for a period of one to five years. The undesirable status can be appealed. For more information contact the South African High Commission of the South African Department of Home Affairs. More information: South African Department of Home Affairs"}, "South Korea (Republic of Korea)": {"country-iso": "KR", "name": "South Korea (Republic of Korea)", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can get a visa-on-arrival to visit South Korea for up to 90 days. For longer visits, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the nearest \n      Embassy or Consulate of the Republic of Korea or the Korean Immigration Service for up-to-date information."}, "South Sudan": {"country-iso": "SS", "name": "South Sudan", "advisory-text": "Do not travel", "visa-info": " If you plan to travel to South Sudan despite our advice, you'll need a visa issued in advance. You won't be allowed to fly to Juba without a valid visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy or Consulate for South Sudan for up-to-date information."}, "Spain": {"country-iso": "ES", "name": "Spain", "advisory-text": "Exercise normal safety precautions", "visa-info": " Spain is a part of the Schengen area, along with a number of other European countries. This allows you to enter without a visa in some circumstances.  You’ll need a visa if you are visiting for reasons other than tourism or more than 90 days. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of Spain for up-to-date information. More information: \n   Schengen Convention"}, "Sri Lanka": {"country-iso": "LK", "name": "Sri Lanka", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa, in the form of an \n   Electronic Travel Authority (ETA), to visit Sri Lanka. There is a non-refundable processing fee for some categories of the ETA. Make sure you select the correct visa category for your circumstances. If you engage in activities that breach your visa conditions, you could be detained or deported. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n      High Commission of Sri Lanka for up-to-date information. Pay close attention to the date your visa expires – you could receive  a large fine if you overstay your visa."}, "Sudan": {"country-iso": "SD", "name": "Sudan", "advisory-text": "Reconsider your need to travel", "visa-info": " You need a visa to enter Sudan. Visas can take several months to be issued and are not automatically granted. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy of Sudan for up-to-date information."}, "Suriname": {"country-iso": "SR", "name": "Suriname", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Sweden": {"country-iso": "SE", "name": "Sweden", "advisory-text": "Exercise normal safety precautions", "visa-info": " Sweden is part of the \n   Schengen area, along with a number of other European countries. This allows you to enter Sweden without a visa in some circumstances. Monitor border conditions by checking local news sources and asking transport providers directly. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of Sweden for up-to-date information."}, "Switzerland": {"country-iso": "CH", "name": "Switzerland", "advisory-text": "Exercise normal safety precautions", "visa-info": " Switzerland is party to the Schengen Convention. This allows you to enter Switzerland without a visa in some circumstances. In other circumstances, you need a visa unless you're travelling for tourism or business purposes for 90 days or less. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of Switzerland for up-to-date information. More information: \n   Schengen Convention"}, "Syria": {"country-iso": "SY", "name": "Syria", "advisory-text": "Do not travel", "visa-info": "na"}, "Taiwan": {"country-iso": "TW", "name": "Taiwan", "advisory-text": "Exercise normal safety precautions", "visa-info": " You won't need a visa if all of the following conditions are met: In other circumstances, you'll need a visa. Australians can now use Taiwan’s e-Gate service. To register for e-Gate, visit the e-Gate Enrolment Counters at the airport, found next to the e-Gate lanes at passport control. Your passport will need to have at least six months validity. See the National Immigration Agency for more information. Working Holiday Makers (WHM) must apply for the WHM visa before arrival. WHM visas are also valid as a work permit. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a Taiwan representative office well in advance of travel for up-to-date information and to arrange your visa, if needed. More information: \n   Taipei Economic and Cultural Office (TECO)"}, "Tajikistan": {"country-iso": "TJ", "name": "Tajikistan", "advisory-text": "High degree of caution", "visa-info": " You need a visa to visit Tajikistan. Ensure your passport is valid for at least 6 months from the date you plan to enter Tajikistan and has two empty pages. Visas can be obtained at the Embassy or Consulate of Tajikistan or on arrival at the Dushanbe International Airport. You must submit a visa application form online through the electronic information network for standard visas or through the eVisa system. More information: Ensure you have the correct visa type. If you plan to visit relatives or friends, you'll need to apply for a Private (XC1) visa, which is different to a Tourist (T) visa. If you plan to visit relatives or friends, you'll need to apply for a Private (XC1) visa, which is different to a Tourist (T) visa. Tourist visas are issued for a maximum of 45 days and cannot be extended or replaced. Make sure you leave the country before your visa expires. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n   Embassy or Consulate of Tajikistan or check the \n   Website of the Ministry of Foreign Affairs of Tajikistan (Consular Service Section) for up-to-date information."}, "Tanzania": {"country-iso": "TZ", "name": "Tanzania", "advisory-text": "High degree of caution", "visa-info": "na"}, "Thailand": {"country-iso": "TH", "name": "Thailand", "advisory-text": "High degree of caution", "visa-info": " If you're travelling for tourism, you may be eligible for a visa exemption which allows you to enter Thailand for a limited period without getting a visa in advance. This is available for Australians: For longer stays, or if you're travelling for a purpose other than tourism, you'll need to apply for a visa in advance. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the nearest \n         Embassy or Consulate of Thailand for up-to-date information."}, "The Bahamas": {"country-iso": "BS", "name": "The Bahamas", "advisory-text": "High degree of caution", "visa-info": " If your visit is for 90 days or less and you have a valid return or onward ticket, you won't need a visa to enter the Bahamas. In other circumstances, you may need to get a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an Embassy or Consulate of the Bahamas for up-to-date information. The Bahamas doesn't have an Embassy or Consulate in Australia. Its nearest mission is the \n   \nEmbassy of the Commonwealth of the Bahamas in Beijing, China (phone: +86 10 6532 2922). Embassy of the Commonwealth of the Bahamas in Beijing If you're travelling to the Bahamas through the United States (US), or transiting the US, you'll need to meet US entry/transit requirements. Check your visa requirements with a \n   \nUS Embassy or Consulate well in advance of your travel. More information: \n   \nUnited States of America US Embassy or Consulate United States of America"}, "The Gambia": {"country-iso": "GM", "name": "The Gambia", "advisory-text": "High degree of caution", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy of The Gambia for up-to-date information."}, "The Republic of Slovenia": {"country-iso": "SI", "name": "The Republic of Slovenia", "advisory-text": "Exercise normal safety precautions", "visa-info": " Slovenia is part of the \n   \nSchengen area. This allows you to enter Slovenia without a visa in some circumstances. Schengen area Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   \nEmbassy or Consulate of Slovenia  for up-to-date information. Embassy or Consulate of Slovenia"}, "The Republic of the Congo": {"country-iso": "CG", "name": "The Republic of the Congo", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "The Slovak Republic": {"country-iso": "SK", "name": "The Slovak Republic", "advisory-text": "Exercise normal safety precautions", "visa-info": " The Slovak Republic is a part of the \n   \nSchengen area. This allows you to enter Slovakia without a visa in some circumstances. Schengen area Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change, contact the nearest \n   \nEmbassy or \n      Consulate of \nSlovakia for up-to-date information. Embassy or \n      Consulate of Slovakia"}, "Timor-Leste": {"country-iso": "TL", "name": "Timor-Leste", "advisory-text": "High degree of caution", "visa-info": " If you're visiting Timor-Leste for tourism and you arrive via Nicolau Lobato International Airport or Dili Seaport, you can apply for a visa on arrival (of up to 30 days duration). There is a charge for a visa on arrival. There are no money exchange facilities at the airport. In other circumstances, including if you enter Timor-Leste by land, you'll need to get a visa before you arrive. If you can demonstrate you have a valid reason for extending your stay in Timor-Leste beyond 30 days, you may be able to extend your visa. Apply to the \n   Immigration Department of Timor-Leste located at Vila Verde, Dili, to extend your visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or Consulate of Timor-Leste or \n   Timor-Leste Immigration for up-to-date information or to arrange your visa."}, "Togo": {"country-iso": "TG", "name": "Togo", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Tonga": {"country-iso": "TO", "name": "Tonga", "advisory-text": "Exercise normal safety precautions", "visa-info": " You can get a tourist visa on arrival for stays of up to one month, provided you have an onward ticket. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n      High Commission of Tonga for up-to-date information."}, "Trinidad and Tobago": {"country-iso": "TT", "name": "Trinidad and Tobago", "advisory-text": "High degree of caution", "visa-info": " If your visit is for tourism, you won't need a visa but you'll need to pay a visa waiver fee. Pay the fee in cash in Trinidad and Tobago dollars or US dollars to Immigration Services upon arrival. In other circumstances, you'll need a visa. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact a \n   High Commission, Embassy or Consulate of Trinidad and Tobago for up-to-date information. Trinidad and Tobago doesn't have a High Commission, Embassy or Consulate in Australia. Its nearest mission is the \n   Embassy of the Republic of Trinidad and Tobago in Beijing, China. If you're travelling through the United States you must meet US entry or transit requirements. Check your visa requirements with a \n   US Embassy or Consulate well in advance of your travel. More information: \n   United States of America"}, "Tunisia": {"country-iso": "TN", "name": "Tunisia", "advisory-text": "High degree of caution", "visa-info": " Tourists may be eligible for a visa exemption for stays of up to 90 days. For other types of travel, obtain a visa before you arrive. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy of Tunisia for up-to-date information."}, "Turkey": {"country-iso": "TR", "name": "Turkey", "advisory-text": "High degree of caution", "visa-info": " If you are visiting Turkey for tourism or business and for less than 90 days in a 180 day period, you'll need to get an electronic visa ('e-visa'). Apply online at the Turkish government's official \n   e-visa website. There have been reports of unauthorised visa websites charging for information on e-visas. If you're not eligible for an e-visa, you'll need to arrange your visa through an \n   Embassy or Consulate of Turkey before you arrive. If you don't, you could be refused entry. If you arrive by sea for tourism you may be able to visit the surrounding provinces, for up to 72 hours, without a visa. You should check visa requirements with your travel operator in advance. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or Consulate of Turkey, or visit the \n   Turkish government website for up-to-date information."}, "Turkmenistan": {"country-iso": "TM", "name": "Turkmenistan", "advisory-text": "Exercise normal safety precautions", "visa-info": " You need a visa to enter Turkmenistan, including for transit. You must get a visa prior to arriving in Turkmenistan. Ensure you have the appropriate visa for the purpose of your visit, especially for business and work visas. Ensure that your passport number, date of birth and validity of your visa are correct on the visa before travelling. Visas for Turkmenistan specify the validity of the visa, the number of entries permitted and the duration of stay permitted. You are only allowed to stay in Turkmenistan for the number of days specified on the visa. Penalties for visa infringements, including over-staying your visa, include fines, arrest and deportation. Transit visa holders must register at entry and exit points and must notify authorities of any changes to their route through the country. You can't change a transit visa to another class of visa in-country. Visa conditions can change at short notice. Contact your nearest \n   Embassy or Consulate of Turkmenistan to confirm visa arrangements before departure."}, "Tuvalu": {"country-iso": "TV", "name": "Tuvalu", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Uganda": {"country-iso": "UG", "name": "Uganda", "advisory-text": "High degree of caution", "visa-info": "  You need a visa to visit Uganda. One option is the East African Community's EAC Tourist Visa, which allows travellers multiple entries to Kenya, Rwanda and Uganda for a period of 90 days. Apply for the EAC Tourist Visa or a Ugandan visa using Uganda's \n   online visa application portal. Otherwise you will need to apply for a visa from the Government of Uganda. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the \n   High Commission of Uganda for up-to-date information."}, "Ukraine": {"country-iso": "UA", "name": "Ukraine", "advisory-text": "High degree of caution", "visa-info": " You need a visa to enter Ukraine. In 2018, Ukraine introduced e-Visas for Australian tourist and business visitors. Register and apply at the \n   Ministry of Foreign Affairs e-Visa website. You can no longer get a visa on arrival. If you need to extend your visa or wish to apply for temporary, long-term or permanent residence, contact the \n   State Migration Service of Ukraine at the location where you reside. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of Ukraine for up-to-date information."}, "United Arab Emirates": {"country-iso": "AE", "name": "United Arab Emirates", "advisory-text": "Exercise normal safety precautions", "visa-info": " Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate-General of the United Arab Emirates for up-to-date information. Australians are eligible for a free 30-day visitor visa-on-arrival. You can extend this at a UAE immigration office for a further 30 days for United Arab Emirates Dirhams (AED) 600. If you're visiting the UAE for business you must apply for a different visa. If you're travelling to the UAE on a diplomatic and official passport, you must have a visa before travelling."}, "United Kingdom": {"country-iso": "GB", "name": "United Kingdom", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're travelling as a tourist for less than six months, you usually won't need a visa. However, UK authorities can refuse visa-free entry to anyone who they believe is trying to enter for a purpose other than tourism. If you're planning to do paid or unpaid work, volunteer or get married, you need to get a visa before you travel. If you're planning to visit for more than six months, or for any purpose other than tourism, consult the UK Visas and Immigration to ensure you apply for the appropriate visa. Australian Government officials can't intervene on your behalf to change your UK visa status. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. More information:"}, "United States of America": {"country-iso": "US", "name": "United States of America", "advisory-text": "Exercise normal safety precautions", "visa-info": " The US has strict entry requirements that also apply to transit passengers. You'll be refused entry if you don't comply. If you're visiting for less than 90 days, you may be eligible to apply for an Electronic System for Travel Authorization (ESTA) and enter under the Visa Waiver Program (VWP). See below. In all other circumstances, you'll need to get a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or Consulate of the United States for up-to-date information. More information: Australians visiting the US (including the US Virgin Islands and Puerto Rico) for less than 90 days may be able to travel under the Visa Waiver Program (VWP). You can’t enter under the VWP if you have: Before travelling under the VWP, you must apply and be pre-approved for the VWP via the Electronic System for Travel Authorization (ESTA). US authorities recommend that you apply for the ESTA as soon as you know you will be travelling there. ESTA approvals can take up to 72 hours. Approved ESTAs are valid for two years and multiple entries. If you renew your passport within the two-year period you’ll need to apply for a new ESTA. Discrepancies between the ESTA, passport or ticket information could lead to you being denied entry or referred for secondary inspection (see below). \n   You also need to reapply for an ESTA if the circumstances relating to any of the VWP eligibility criteria change. If your ESTA application is denied, you’ll need to apply for a visa from a US Embassy or Consulate (see below). US authorities generally won’t disclose why an ESTA application is rejected and there's no scope for appeal. If you provide false or incorrect information on an ESTA you may be permanently ineligible for travel to the US. More information:  United States Customs and Border Protection If you’re ineligible to travel under the VWP or your ESTA application is denied, you’ll need to obtain a visa. Visitors can apply for tourist or business visitor visas (B-1/B-2 visas), but there are visa categories for every purpose of travel. Contact a US Embassy or Consulate for further information. More information: US authorities at your port of entry decide the date until which you can legally remain in the US.\n   This may not be the same as the expiry date of your ESTA or visa. Upon entry, US authorities will stamp your passport and usually write the date you must leave on the stamp. You'll also be issued an electronic (or hardcopy) Form I-94 Entry / Departure Record. Your I-94 is evidence of your legal status in the US and also indicates the date by which you must depart. You can check your I-94 on the US Customs and Border Protection website each time you enter the US. If you stay beyond your I-94 expiry date, you can be detained, deported and barred from re-entering the US in future. You cannot extend or renew your I-94 by traveling to Canada, Mexico or the Caribbean for a short period of time (30 days or less) and then re-entering the US. If you have an unexpired I-94 when you travel from the US to Canada, Mexico or the Caribbean you will only be re-admitted to the US for the balance of time remaining on your original I-94. If you have a recently expired I-94 and US authorities suspect that the purpose of your trip outside the US was simply to extend your stay in the US, you can be refused entry and held until arrangements can be made for your removal. If you're issued a hard copy I-94 on arrival, you should give it to the airline, cruise line or US Customs and Border Patrol when you leave the US. More information: \n   \nUS Customs and Border Protection"}, "Uruguay": {"country-iso": "UY", "name": "Uruguay", "advisory-text": "Exercise normal safety precautions", "visa-info": " Australian tourists can enter Uruguay without a visa for up to 90 days.  Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. For up-to-date information contact the nearest \n   \n   Embassy or Consulate of Uruguay."}, "Uzbekistan": {"country-iso": "UZ", "name": "Uzbekistan", "advisory-text": "High degree of caution", "visa-info": " From 1 February 2019, Australians can enter Uzbekistan under a new visa-free arrangement for single-entry stays of up to 30 days. You'll still need a visa to enter Uzbekistan if you are staying for more than 30 days or require multiple entries. More information is available from the Uzbek Ministry of Foreign Affairs. Visa and other entry and exit conditions can change at short notice. Contact the Embassy of Uzbekistan in Singapore (accredited to Australia) for up-to-date information. Uzbek visas specify validity, number of entries allowed, and the duration of stay. Check your visa details once issued. The duration of stay on your visa may differ from the duration of stay requested in your visa application. Do not arrive in the country before the validity period or overstay your visa as this might result in fines, detention and deportation."}, "Vanuatu": {"country-iso": "VU", "name": "Vanuatu", "advisory-text": "Exercise normal safety precautions", "visa-info": " If you're visiting for 30 days or less and you have a return or onward ticket (which can be proven by showing your e-ticket email confirmation), you'll be able to apply for a visa on arrival. In other circumstances, you'll need to get a visa before you travel. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact an \n      Embassy or Consulate of Vanuatu or the Vanuatu Department of Immigration for up-to-date information."}, "Venezuela": {"country-iso": "VE", "name": "Venezuela", "advisory-text": "Do not travel", "visa-info": " You don't need a visa for tourist visits under 90 days. Your will need a passport valid for at least six months and proof of return or onward travel. You can be detained or deported if you don't comply with your visa conditions. Ensure your visa status is up to date by contacting the \n   Venezuelan migration department (in Spanish). Entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n      Embassy or Consulate of Venezuela for up-to-date information. If you're transiting via the USA, you must meet US entry/transit requirements.  More information: \n   United States"}, "Vietnam": {"country-iso": "VN", "name": "Vietnam", "advisory-text": "Exercise normal safety precautions", "visa-info": " Every country or territory decides who can enter or exit through its borders. The Australian Government cannot intervene on your behalf if you do not meet your destination's entry or exit requirements. You must have a visa, a visa exemption certificate or an approval letter for a visa-on-arrival. More information: \n   Government of Vietnam's online information website You can apply for an e-visa through the \n   Web Portal on Immigration. You can also apply for a tourist visa through the \n   Vietnamese Embassy’s website. The costs and processes differ between these two websites. Make sure you correctly enter your details when applying or you may have to pay a second fee on arrival. Print a copy of your application and carry it with you. For stays longer than 30 days or for multiple entries, apply for a visa directly from the nearest Embassy or Consulate of Vietnam. Complete the \n             visa application form and take it to the nearest \n      Embassy or Consulate of Vietnam. If you arrive in Vietnam with a written approval letter for a visa to be issued on arrival, you must pay the fee in cash, either in USD or Vietnamese dong. To avoid online visa or travel agent scams, apply for your visa through the Government of Vietnam’s official website or offices. If your spouse or parent is a national of Vietnam, you can apply for a visa exemption certificate. The certificate is valid for five years and allows multiple entries into Vietnam for up to six months. If your visa expires or is otherwise invalid, you will face delays and fines when leaving. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the nearest \n      Embassy or Consulate of Vietnam for up-to-date information."}, "Wallis and Futuna": {"country-iso": "WF", "name": "Wallis and Futuna", "advisory-text": "No advisory from the australian government", "visa-info": "na"}, "Yemen": {"country-iso": "YE", "name": "Yemen", "advisory-text": "Do not travel", "visa-info": "na"}, "Zambia": {"country-iso": "ZM", "name": "Zambia", "advisory-text": "Exercise normal safety precautions", "visa-info": "  You'll need a visa to enter Zambia. If you're visiting Zambia for tourism and staying for less than 90 days, you can get a 30-day 'KAZA visa' on arrival in the following circumstances: The KAZA visa can be used to travel between Zambia and Zimbabwe and for day trips into Botswana. In other circumstances, you'll need to get an entry visa before you travel to Zambia. A maximum of two, 30-day extensions (for a total of 90 days) is allowed on entry visas. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) change regularly. Contact the nearest    Embassy or Consulate of Zambia for up-to-date information or to apply for a visa. More information: \n   Zambian Department of Immigration"}, "Zimbabwe": {"country-iso": "ZW", "name": "Zimbabwe", "advisory-text": "High degree of caution", "visa-info": " You'll need a visa to enter Zimbabwe. In most circumstances, including when your visit is for tourism, you can get a get a Zimbabwean visa on arrival. It is valid for 30 days. You can apply for an extension through Zimbabwe's \n   Department of Immigration website or an Immigration Office. Allow sufficient time for an extension review. You can also apply for a double-entry tourist visa, which is valid for 30 days from each date of entry. A KAZA UniVisa is valid for travel between Zimbabwe and Zambia and for day trips to Botswana. It is available at Harare, Bulawayo and Victoria Falls airports and at the land border at Victoria Falls (Zambia border) and Kazlunga (Botswana border). UniVisa holders can visit Zambia and Zimbabwe multiple times within the 30-day validity period. The UniVisa is not extendable. The availability of the KAZA Univisa can change at short notice. If you plan to live, work, study, invest or do business in Zimbabwe, you'll also need to get the relevant permit, approved by the Zimbabwe Chief Immigration Officer, usually before you travel to Zimbabwe. Be careful if you are arranging visas and work permits through local migration agents. Consider getting these directly, or through your sponsor, from the relevant Zimbabwean immigration office. Visa and other entry and exit conditions (such as currency, customs and quarantine regulations) can change at short notice. Contact the nearest \n   Embassy or Consulate of Zimbabwe for up-to-date information. You could be jailed if you overstay your visa. Departure options may be very restricted if the general security situation deteriorates quickly. Valid passports, visas and vehicle police clearances are essential if you need to depart Zimbabwe. Keep your documentation up-to-date."}}