{"Afghanistan": {"country-iso": "AF", "name": "Afghanistan", "advisory-text": "Avoid all travel", "visa-info": "<br>You must obtain a visa to visit Afghanistan.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>If your emergency contingency plan involves a possible evacuation to a third country by air or road, be sure to maintain a valid visa for that country."}, "Albania": {"country-iso": "AL", "name": "Albania", "advisory-text": "Exercise normal security precautions (with regional advisories)", "visa-info": "<br>Tourist visa: not required for stays up to 90 days per six-month period<br>Business visa: not required for stays up to 90 days per six-month period<br>Student visa: not required for stays up to 90 days per six-month period<br>If you wish to stay or work in Albania for more than 90 days, you must apply for a resident permit (leje qëndrimi) or a work permit (leje pune)."}, "Algeria": {"country-iso": "DZ", "name": "Algeria", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Algeria.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Students are issued a tourist visa."}, "American Samoa": {"country-iso": "AS", "name": "American Samoa", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Canadians can visit American Samoa without an entry permit or visa for a period of up to 30 days.<br>At least 48 hours prior to your arrival, you must apply for and receive authorization from the Entry Permit Waiver Program. Cruise ship passengers need not apply.<br>Online application - Entry Permit Waiver Program"}, "Andorra": {"country-iso": "AD", "name": "Andorra", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required<br>Business visa: not required<br>Student visa: not required for stays up to 90 days<br>Andorra is not a member of the Schengen area. If you require a visa to enter the Schengen area and are planning to travel to Andorra, ensure you are in possession of a multiple-entry visa. Holders of a single-entry visa will face delays and may be refused re-entry when trying to return to France or Spain."}, "Angola": {"country-iso": "AO", "name": "Angola", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>You must be in possession of a visa and an onward or return ticket to enter Angola.<br>To obtain a visa, you must first get a Canadian criminal clearance certificate, which can only be obtained while in Canada from your local police or the RCMP, before travelling. The police clearance must be submitted, along with your visa application, in both English and a Portuguese translation, which must be notarized.<br>The length of stay on your tourist visa may not exceed 30 days, but the visa can be renewed once, for a maximum of 30 days.<br>Angolan visas take an entire page in your passport and are preferably followed by one blank page. Ensure you have enough pages remaining in your passport, as additional pages cannot be added to a passport and issuing a new passport may take several weeks. While in Angola with family members, including children, ensure that their documentation is up-to-date at all times.<br>Airport and road check procedures have been reinforced. Any issue relating to documentation or identification, including visas and vaccination cards, can lead to delays or denial of entry. Ensure that you have obtained the appropriate visa before arriving in Angola. You cannot obtain a visa at the airport.<br>If you arrive in Angola without the required visa, you could face arrest and/or deportation. Travellers who overstay their visa are subject to heavy fines and possible arrest.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Employment visa: Required<br>Transit visa: Required"}, "Anguilla": {"country-iso": "AI", "name": "Anguilla", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required<br>Business visa: not required<br>Student visa: not required"}, "Antarctica": {"country-iso": "AQ", "name": "Antarctica", "advisory-text": "Exercise normal security precautions", "visa-info": ""}, "Antigua and Barbuda": {"country-iso": "AG", "name": "Antigua and Barbuda", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required<br>Business visa: not required<br>Student permit: required"}, "Argentina": {"country-iso": "AR", "name": "Argentina", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required <br>Student visa: Required"}, "Armenia": {"country-iso": "AM", "name": "Armenia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must have a visa to visit Armenia.<br>Transit visa: Required for stays up to three days<br>Visitor visa (tourism and business travel): Required for stays up to 120 days<br><br>There are 3 ways of obtaining a visa:<br>Apply for an e-visa - Armenia’s Ministry of Foreign Affairs"}, "Aruba": {"country-iso": "AW", "name": "Aruba", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required (for stays of up to 30 days)<br>Business visa: not required<br>Work permit: required<br>Student visa: required"}, "Australia": {"country-iso": "AU", "name": "Australia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: required <br>Business visa: required <br>Student visa: required<br>Canadians must also be in possession of an electronic travel authority (ETA) to visit Australia. Ensure that you travel with the same passport used to apply for your ETA.<br>A health examination might be necessary to obtain certain visas."}, "Austria": {"country-iso": "AT", "name": "Austria", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up 90 days<br>Work visa: Required<br>Student visa: Required"}, "Azerbaijan": {"country-iso": "AZ", "name": "Azerbaijan", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Azerbaijan.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Transit visa: Required<br>If you plan to visit Azerbaijan, you must have a visa before arriving in the country. As a tourist, you can apply for an e-visa through Azerbaijan’s online visa portal. You should do so at least 3 days before your planned arrival date.<br>If you require any other type of visa, you must apply for it from the Embassy of the Republic of Azerbaijan prior to departure.<br>To obtain any type of visa, you must present a letter of invitation from a contact in Azerbaijan, such as an employer or educational institution. If you do not have a contact in Azerbaijan, the invitation letter should be submitted by the travel agency in Azerbaijan.<br>If you plan to stay for more than 10 days, you must register with police upon arrival and ensure that your passport is stamped with a residency stamp. You may also register your stay online through the State Migration Service. Failure to register could result in a fine. You may be stopped from leaving Azerbaijan until the fine is paid."}, "Azores": {"country-iso": "PT-20", "name": "Azores", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days*<br>Business visa: Not required for stays up 90 days*<br>Residency visa: Required for long-term stays and employment<br>Student visa: Required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Bahamas": {"country-iso": "BS", "name": "Bahamas", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: not required for stays up to 8 months<br>Business visa: not required<br>Student permit: required"}, "Bahrain": {"country-iso": "BH", "name": "Bahrain", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must have a visa to visit Bahrain.<br>Tourist visa: Required <br>Business visa: Required<br>Student visa: Required<br>You should obtain a visa from the nearest Bahraini government office prior to arrival. Tourists can also obtain their visa online from Bahrain eVisas."}, "Bangladesh": {"country-iso": "BD", "name": "Bangladesh", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: required (for stays up to 30 days)<br>Business visa: required (for stays up to 30 days)<br>Student visa: Required<br>You should obtain a visa before travelling to Bangladesh. While you can apply for single-entry tourist and business visas upon arrival at the airport in Bangladesh, there is a risk of being denied entry into the country."}, "Barbados": {"country-iso": "BB", "name": "Barbados", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required <br>Business visa: not required<br>Work visa: required<br>Student visa: required"}, "Belarus": {"country-iso": "BY", "name": "Belarus", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of up to 30 days<br>Business visa: Required<br>Student visa: Required<br>Transit visa: Required<br>You can enter Belarus without a visa for a period of up to 30 days, which cannot be extended, at the following conditions:<br>Those conditions don’t apply if you are flying in from Russia as these flights are considered internal flights with no border control.<br>Obtaining a visa for Belarus - Belarus Ministry of Foreign Affairs"}, "Belgium": {"country-iso": "BE", "name": "Belgium", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days<br>Work visa: Required<br>Canadians must obtain a resident visa for stays exceeding 90 days."}, "Belize": {"country-iso": "BZ", "name": "Belize", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required for stays up to 30 days<br>Business visa: Required <br>Student visa: Required"}, "Benin": {"country-iso": "BJ", "name": "Benin", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa prior to arriving in Benin.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Bermuda": {"country-iso": "BM", "name": "Bermuda", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required <br>Business visa: Not required <br>Student visa: Required"}, "Bhutan": {"country-iso": "BT", "name": "Bhutan", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>You must obtain a visa by purchasing a travel package from an authorized travel agent before you leave. A daily rate covers most services in the package, including accommodation, meals, internal transportation (except flights), guides and cultural programs. You must pay for the package and the airfare in advance to get your visa. Contact the Tourism Council of Bhutan or an authorized travel agent for more information.<br>Tourism Council of Bhutan"}, "Bolivia": {"country-iso": "BO", "name": "Bolivia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: not required for stays up to 30 days<br>Business visa: required <br>Student visa: required<br>If you’re a Canadian citizen travelling to Bolivia for volunteer work, you should obtain the Visa of Determined Purpose from the Bolivian embassy or consulate in Canada prior to your trip.<br>Foreign diplomatic missions and consulates in Canada"}, "Bonaire": {"country-iso": "BQ", "name": "Bonaire", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays of up to 90 days in a 180-day period)<br>Business visa: Not required<br>Student visa: Required"}, "Bosnia and Herzegovina": {"country-iso": "BA", "name": "Bosnia and Herzegovina", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days"}, "Botswana": {"country-iso": "BW", "name": "Botswana", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Work visa:<br>If you stay in the country for more than 90 days, you must request an extension from local immigration authorities."}, "Brazil": {"country-iso": "BR", "name": "Brazil", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: required<br>Business visa: required <br>Student visa: required<br>Tourist visa<br>Tourist visas issued to Canadian passport holders are valid for multiple entries and usually for a 5-year period.<br>When applying for a Brazilian entry visa, ensure the names on the Canadian passport and visa application are identical. Federal police will not accept applications with missing names or initials. This rule also applies to the names of the parents.<br>You can obtain your visa online from Brazil eVisas.<br>Length of stay<br>Stays are for a maximum of 90 days per visit.<br>If you intent to stay more than 30 days, you must validate your visa at a local police station.<br>If you intent to stay more than 90 days, you must obtain an extension from the Federal Police for a maximum stay of 180 days per year.<br>To request a visa extension, you will have to :<br>In order for your Canadian long form birth certificate to be accepted in Brazil, it must be presented to the Brazilian Embassy or one of its consulates prior to departure from Canada.  Neither the Embassy of Canada nor its consulates in Brazil can authenticate a Canadian birth certificate outside of Canada."}, "British Virgin Islands": {"country-iso": "VG", "name": "British Virgin Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 30 days<br>Business visa: Not required for stays up to 30 days <br>Student visa: Not required for stays up to 30 days<br>Canadians can enter the British Virgin Islands without a visa for a maximum stay of 30 days. If you wish to stay longer than 30 days, you must obtain proper authorization from the Chief Immigration Officer. Stays can be extended up to 6 months."}, "Brunei": {"country-iso": "BN", "name": "Brunei", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: required for stays of more than 14 days<br>Business visa: required for stays of more than 14 days<br>Student visa: required<br>If you need a visa, you must have at least 6 blank pages in your passport."}, "Bulgaria": {"country-iso": "BG", "name": "Bulgaria", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of fewer than 90 days in any 180-day period<br>Business visa: Not required for stays of fewer than 90 days in any 180-day period<br>Student visa: Not required for stays of fewer than 90 days in any 180-day period<br>You must obtain a visa before travelling if you plan to stay in Bulgaria for more than 90 days. Bulgaria doesn’t grant extensions once you’re in the country, except in cases of emergency or marriage to a Bulgarian citizen."}, "Burkina Faso": {"country-iso": "BF", "name": "Burkina Faso", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>You must have a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Burundi": {"country-iso": "BI", "name": "Burundi", "advisory-text": "Avoid all travel", "visa-info": "<br>Tourist: required<br>Business: required"}, "Cabo Verde": {"country-iso": "CV", "name": "Cabo Verde", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must also be in possession of a visa, which can be obtained on arrival at any point of entry. The visa is valid for up to 30 days.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Cambodia": {"country-iso": "KH", "name": "Cambodia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Tourist and business visas allow entry to Cambodia for 30 days only, counting from the date of entry.<br>Travellers must pay a fee in cash of US$30 for tourist visas or US$35 for business visas and provide two passport-sized photos. The photos can be purchased at the airport for US$3 each.<br>E-visa<br>You can request a single-entry tourist visa online through Cambodia’s e-Visa service.<br>Apply for an e-visa - Cambodian Ministry of Foreign Affairs and International Cooperation<br>Visa expiry date<br>When issued outside Cambodia, visas have an expiry date, which refers to the date by which the visa must be used, not the length of time allowed in the country. Visas must be renewed for stays in excess of 30 days and may only be extended once.<br>Where to get a visa<br>Tourist and business visas can be obtained at:<br>You can get a 30-day visa at any of these Cambodian-Thai border crossing points:<br>If entering Cambodia from Vietnam, you can get a visa at the international crossing points at:<br>You can’t purchase Cambodian and Laotian visas at the Cambodia–Laos border."}, "Cameroon": {"country-iso": "CM", "name": "Cameroon", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must have a visa and an onward or return ticket.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Canadians who are going to Cameroon to work must obtain a resident card shortly after arrival."}, "Canary Islands": {"country-iso": "IC", "name": "Canary Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Business visa: not required<br>Student visa: required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Cayman Islands": {"country-iso": "KY", "name": "Cayman Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to six months<br>Work permit: Required<br>Student visa: Required"}, "Central African Republic": {"country-iso": "CF", "name": "Central African Republic", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must also have a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Chad": {"country-iso": "TD", "name": "Chad", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>You must have a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Chile": {"country-iso": "CL", "name": "Chile", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required<br>Business visa: not required<br>Student visa: required<br>Work visa: required"}, "China": {"country-iso": "CN", "name": "China", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required <br>Working visa: Required<br>Canadians must have a visa. You may not need a visa if you are:<br>If you are transiting through China, you must present all the documents you need to enter your onward destination when you arrive in China.<br>Contact the nearest Chinese diplomatic or consular office for more information on visa exceptions.<br>If you do not obtain a Chinese visa before you leave Canada, check with the Chinese embassy or consulate at your destination to make sure they issue visas to Canadians at that location.<br>Visa issuance process<br>Thoroughly review all information available regarding the visa issuance process, Consult the local visa issuing office and plan accordingly if you are travelling to or residing in China. Pay particular attention to the length of stay permitted after each entry on your Chinese visa. Overstaying can lead to fines and administrative detention for up to 15 days.<br>Visiting Hong Kong and Macao<br>If you plan to travel between Hong Kong, Macao and mainland China, obtain a visa allowing multiple entries.<br>Applying for visas for mainland China in Hong Kong - China’s Ministry of Foreign Affairs, in Hong Kong"}, "Colombia": {"country-iso": "CO", "name": "Colombia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: not required (for stays of up to 90 days)<br>Business or work visa: required<br>Student visa: required"}, "Comoros": {"country-iso": "KM", "name": "Comoros", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You must obtain a visa to visit the Comoros. You may obtain a 45-day tourist visa on arrival at the Prince Said Ibrahim International Airport in Moroni or at other points of entry. If required, you may extend your visa in Moroni.<br>Comoros passport and visa information"}, "Cook Islands": {"country-iso": "CK", "name": "Cook Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for up to 31 days)<br>Business visa: Required <br>Student visa: Not applicable; it is not possible to travel to the Cook Islands to study."}, "Costa Rica": {"country-iso": "CR", "name": "Costa Rica", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: not required for stays up to 90 days<br>Business visa: required<br>Student visa: required<br>You may stay in Costa Rica for up to 90 days without a visa, but the length of your stay upon entering the country is determined by immigration officers. If you wish to apply for residency status, you must contact the Dirección General de Migración y Extranjería (Costa Rica’s immigration department). Overstaying the 90-day period is punishable by possible deportation. Persons deported from Costa Rica will not be allowed to re-enter the country for five to ten years.<br>Students must obtain a visa from the Costa Rican immigration department. They must provide confirmation of enrollment in an accredited school."}, "Côte d'Ivoire (Ivory Coast)": {"country-iso": "CI", "name": "Côte d'Ivoire (Ivory Coast)", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa before arrival.<br>You can get a visa at Félix-Houphouët-Boigny International Airport. However, you must first get a “receipt of pre-enrolment” online, as well as a “certificate of approval of the authority” (which is proof of authorization), before you board your flight to Abidjan.<br>Get an e-visa - Côte d’Ivoire’s official application service<br>Tourist visa: required<br>Business visa: required<br>Student visa: required"}, "Croatia": {"country-iso": "HR", "name": "Croatia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days.<br>Student visa: Not required for stays up to 90 days."}, "Cuba": {"country-iso": "CU", "name": "Cuba", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: required<br>Family visa: required<br>Business visa: required<br>Press visa for journalist: required<br>Tourist visa<br>Canadian tourists travelling to Cuba must to fill out a tourist visa, also known as a tourist card.<br>The tourist card is generally provided by tour operators or airlines. If you go to Cuba on your own, you can obtain it from a Cuban government office in Canada. It is also available at some airports in Canada.<br>Visitors are prohibited from undertaking business and/or press activities when travelling on a tourist card."}, "Curaçao": {"country-iso": "CW", "name": "Curaçao", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays of 30 days or less)<br>Business visa: Not required<br>Work permit: Required<br>Student visa: Required<br>Canadians can stay in Curaçao without a visa for a maximum of 30 days. Furthermore, Canadians can stay in the Caribbean Netherlands (Aruba, Curaçao and Sint Maarten) for 30 days per island for a maximum of 90 days per year."}, "Cyprus": {"country-iso": "CY", "name": "Cyprus", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: required<br>Working in Cyprus<br>If you wish to work in Cyprus, contact the High Commission for the Republic of Cyprus in Canada for information on specific requirements.<br>Foreign diplomatic missions and consulates in Canada"}, "Czech Republic": {"country-iso": "CZ", "name": "Czech Republic", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Required<br>Student visa: Not required for stays up to 90 days<br>Work visa: Required"}, "Democratic Republic of Congo (Kinshasa)": {"country-iso": "CD", "name": "Democratic Republic of Congo (Kinshasa)", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required (Students must obtain a tourist visa) <br>Transit visa: Required<br>To enter the DRC, Canadians must obtain a visa from the DRC embassy in Ottawa before leaving Canada.<br>Visas are not available at ports of entry, and it is not possible to obtain a visa at DRC embassies outside of one’s country of residence.<br>A multiple-entry visa is required for foreigners who want to enter the DRC more than once (this is often the case with travellers using the ferry service between Kinshasa and Brazzaville, Congo). The multiple-entry visa is available at the embassy of the DRC in Ottawa or in Gombe, Kinshasa, at the DRC’s immigration department (Direction générale de migration), 65 Boulevard du 30 juin (next to the Regideso building).<br>Foreign diplomatic missions and consulates in Canada"}, "Denmark": {"country-iso": "DK", "name": "Denmark", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days within any 180-day period<br>Business visa: Not required<br>Work visa: Required<br>Student visa: Required. You must also show proof of sufficient funds for your stay."}, "Djibouti": {"country-iso": "DJ", "name": "Djibouti", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Djibouti.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required (a tourist visa is issued to students)"}, "Dominica": {"country-iso": "DM", "name": "Dominica", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays of up to 6 months<br>Business visa: not required<br>Student visa: required"}, "Dominican Republic": {"country-iso": "DO", "name": "Dominican Republic", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: not required<br>Work visa: required<br>Student visa: required<br>Residence visa: required"}, "Ecuador": {"country-iso": "EC", "name": "Ecuador", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required <br>Business visa: Not required <br>Student visa: Not required<br>Canadians do not require a visa for stays of less than 90 days in a 365-day period.<br>You must leave Ecuador before the departure date stipulated on the entry stamp that you received in your passport upon arrival. If you remain in Ecuador past this date, you may be deported and must then request a visa at an Ecuadorian embassy or consulate before re-entering the country. Your name may also be added to immigration records. Attempting to re-enter Ecuador without a visa pre-issued by Ecuadorian authorities in Canada will result in exclusion and you will be returned to your port of embarkation.<br>If you wish to stay longer than 90 days, you must obtain a visa before your entry permit expiries. If you enter Ecuador by land from Colombia or Peru, you are required to register with the Ecuadorian immigration office at the border. You must provide your passport and indicate where you are going and how long you intend to remain in Ecuador. Ensure you receive an entry stamp in your passport. Failure to do so may cause significant problems when trying to exit the country.<br>Virtual Consulate of Ecuador - Ministry of Foreign Affairs and Human Mobility, Ecuador government (in Spanish)"}, "Egypt": {"country-iso": "EG", "name": "Egypt", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Egypt.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>You may purchase a tourist visa at the airport on arrival. However, you should obtain your visa from an Egyptian embassy or consulate before arrival to avoid lengthy delays or the possibility of being refused entry. All other visas must be obtained from an Egyptian embassy or consulate before arrival.<br>If you intend to stay for more than one month and have obtained a visa from an Egyptian embassy or consulate abroad, a 30-day visa will be stamped in your passport regardless of the visa previously granted. You are responsible for renewing this visa."}, "El Salvador": {"country-iso": "SV", "name": "El Salvador", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Not required"}, "Equatorial Guinea": {"country-iso": "GQ", "name": "Equatorial Guinea", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Canadians must have a visa. You must also obtain a police clearance certificate for personal or tourist travel."}, "Eritrea": {"country-iso": "ER", "name": "Eritrea", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>You need a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Official visa: Required<br>In-transit visa: Required<br>All visas must be obtained prior to travel. Obtaining a visa can take a very long time. Apply well in advance of your planned departure."}, "Estonia": {"country-iso": "EE", "name": "Estonia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays of fewer than 90 days in any 180-day period*<br>Transit visa: not required<br>Business visa: not required for stays of fewer than 90 days in any 180-day period*<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Eswatini": {"country-iso": "SZ", "name": "Eswatini", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Not required"}, "Ethiopia": {"country-iso": "ET", "name": "Ethiopia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Transit visa: Required<br>Canadians must have a valid visa to enter the country. You may obtain a visa online or on arrival at Addis Ababa Bole International Airport. This is subject to change without warning. Obtain a visa before arrival to avoid possible complications.<br>Verify carefully that your visa is valid. If you overstay your visa, you may face daily fines and imprisonment. Ensure that your activities in the country adhere to the type of visa you have obtained. Authorities will consider any business activity, even volunteering, illegal, and may impose fees and jail time.<br>To obtain an Ethiopian evisa – Federal Democratic Republic of Ethiopia<br>Land border entry requirements<br>Canadians arriving through a land border may be denied entry if they do not have a valid visa. Authorities may request additional documents if you attempt to enter Ethiopia by vehicle at certain border crossings. Contact the Embassy of Canada in Addis Ababa to determine specific entry requirements at land borders."}, "Falkland Islands": {"country-iso": "FK", "name": "Falkland Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist Visa: Not required for stays up to 4 months<br>Business Visa: Required"}, "Fiji": {"country-iso": "FJ", "name": "Fiji", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visas are issued upon arrival for stays of up to four months.<br>Tourist visa: Required<br>Business visa: Required<br>Work visa: Required"}, "Finland": {"country-iso": "FI", "name": "Finland", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days"}, "France": {"country-iso": "FR", "name": "France", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Long-stay or residency visa: Required for stays longer than 90 days<br>Work permit: Required<br>Student visa: Required for stays longer than 90 days"}, "French Guiana": {"country-iso": "GF", "name": "French Guiana", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days<br>Long-stay or residency visa: required for stays more than 90 days<br>Professional visa: required<br>Student visa: required"}, "French Polynesia": {"country-iso": "PF", "name": "French Polynesia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Professional visa: Required<br>Student visa: Required"}, "Gabon": {"country-iso": "GA", "name": "Gabon", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to visit Gabon. Consult the Embassy of the Gabonese Republic for information on how to obtain a visa.<br>Tourist/Family visits visa: Required<br>Business visa: Required<br>Transit visa: Required<br>If you reside in Gabon, you must obtain an exit visa a few weeks before departure."}, "Gambia, The": {"country-iso": "GM", "name": "Gambia, The", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required <br>Business visa: Required<br>Employment permit: Required"}, "Georgia": {"country-iso": "GE", "name": "Georgia", "advisory-text": "Exercise normal security precautions (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to 365 days<br>Business visa: Not required for stays up to 365 days<br>Student visa: Not required for stays up to 365 days<br>If you are planning to stay in Georgia for more than 365 days, you must obtain a visa before entering the country."}, "Germany": {"country-iso": "DE", "name": "Germany", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Required<br>The extension of tourist visits longer than 90 days is not possible. You must apply for a residence permit and provide a valid reason. If you must stay beyond the 90-day limit unexpectedly (for example, due to illness), contact the Foreigners Registration Office (Ausländerbehörde) in the district in which you are staying for information on how to legalize your extended stay."}, "Ghana": {"country-iso": "GH", "name": "Ghana", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Gibraltar": {"country-iso": "GI", "name": "Gibraltar", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 180 days<br>Work permit: Required<br>Student visa: Required<br>If you stay more than one month in Gibraltar, you must register your stay with Gibraltar’s immigration authorities."}, "Greece": {"country-iso": "GR", "name": "Greece", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Work visa: Required<br>Student visa: Required<br>Canadians must have a visa to stay in Greece for more than 90 days.<br>Contact the Embassy of Greece in Canada prior to travel to obtain the necessary visas.<br>Foreign diplomatic missions and consulates in Canada<br>Overstays<br>In cases where you must stay in Greece past 90 days (for example, for a serious medical reason), the Greek aliens police may grant you an extension. Apply at least 15 days before your 90-day, visa-free period expires."}, "Greenland": {"country-iso": "GL", "name": "Greenland", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days"}, "Grenada": {"country-iso": "GD", "name": "Grenada", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days <br>Business visa: Not required<br>Student visa: Not required<br>Canadians can enter Grenada without a visa for a maximum stay of 90 days. If you wish to stay longer than 90 days, you must obtain proper authorization at the Immigration Authorities Office in Grenada.<br>You must also be in possession of a return or onward airline ticket to enter Grenada."}, "Guadeloupe": {"country-iso": "GP", "name": "Guadeloupe", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Long-stay or residency visa: Required for stays more than 90 days<br>Professional visa: Required<br>Student visa: Required<br>A Schengen visa is not valid for visits to French overseas departments such as Guadeloupe."}, "Guam": {"country-iso": "GU", "name": "Guam", "advisory-text": "Exercise normal security precautions", "visa-info": ""}, "Guatemala": {"country-iso": "GT", "name": "Guatemala", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: not required<br>Business visa: required<br>Student visa: required<br>Canadians intending to conduct business in Guatemala or wishing to stay in Guatemala for a period exceeding 6 months require a visa."}, "Guinea": {"country-iso": "GN", "name": "Guinea", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You must obtain a visa prior to your departure for Guinea.<br>Tourist visa: Required <br>Business visa: Required <br>Transit visa: Required"}, "Guinea-Bissau": {"country-iso": "GW", "name": "Guinea-Bissau", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must have a visa to enter Guinea-Bissau.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Guyana": {"country-iso": "GY", "name": "Guyana", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required (up to 90 days)<br>Business visa: Not required<br>Student visa: Not required<br>If you are travelling to Guyana on business, you must bring a business letter with all pertinent information concerning the reason for your visit."}, "Haiti": {"country-iso": "HT", "name": "Haiti", "advisory-text": "Avoid all travel", "visa-info": "<br>Work permit: Required<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Required<br>A residency permit (“permis de séjour”) is required for stays of more than 90 days. If you plan to extend your stay beyond 90 days, you must apply to the Haitian Immigration Service before the 90 days have expired. Do not wait until the last minute. Canadians of non-Haitian origin who have been in the country for more than 90 days and did not apply for an extension of stay must obtain an exit visa before leaving the country.<br>Canadian investors, exporters/importers and workers must apply to the Haitian Immigration authorities for the residency permit through their employer for stays of more than 6 months. This document must be obtained before leaving Canada.<br>How to obtain a visa - Embassy of Haiti in Canada (in French)"}, "Honduras": {"country-iso": "HN", "name": "Honduras", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Required<br>Travellers intending to study in Honduras can apply to the immigration authorities for a student permit once they have arrived in the country."}, "Hong Kong": {"country-iso": "HK", "name": "Hong Kong", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of up to 90 days<br>Business visa: Not required for stays of up to 90 days<br>Student visa: Required<br>Canadians travelling to mainland China via Hong Kong must obtain a Chinese visa before arrival.<br>Canadian travellers who are not Hong Kong residents should seek information from the nearest Chinese embassy or consulate and apply for entry visas before leaving Canada.<br>Canadians who reside in Hong Kong are encouraged to seek detailed information from the Office of the Commissioner of China’s foreign ministry in Hong Kong.<br>If entering and leaving Hong Kong via mainland China, make sure you have a visa for re-entry into China.<br>More about entering/exiting China"}, "Hungary": {"country-iso": "HU", "name": "Hungary", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays less than 90 days in any 180-day period*<br>Business visa: Not required for stays less than 90 days in any 180-day period*<br>Student visa: Not required for stays less than 90 days in any 180-day period*<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Iceland": {"country-iso": "IS", "name": "Iceland", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required (consultants may stay in Iceland for 4 weeks without a business visa, but employment authorization must be approved before arrival)<br>Student visa: Required<br>Work visa: Required"}, "India": {"country-iso": "IN", "name": "India", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourism visa: required<br>Work visa: required<br>Business visa: required<br>Student visa: required<br>As a Canadian citizen, you must obtain a visa for India prior to arrival or you will be refused entry into the country. Ensure you apply for the proper type of visa for the specific purpose of your trip.<br>If you are denied entry by immigration officials, you will be returned to your point of departure. Canadian-Pakistani citizens are subject to different visa application and registration procedures.<br>Tourist visas<br>If you are in possession of a tourist visa, you can only stay in India for up to 180 consecutive days, even when the validity of the visa exceeds 180 days.<br>If you’re going to India to execute projects or contracts, you must enter on an employment visa.<br>e-Tourist Visa<br>You can obtain an e-Tourist Visa for tourist visits if:<br>You can apply online for an e-visa. Do so at least 4 days prior to travelling. Carry a printed copy of the email confirmation of your e-visa.<br>E-tourist visa – Government of India<br>Stays of more than 180 days<br>If you are staying in India for more than 180 days, you must register within 14 days of arrival with the Foreigners Regional Registration Office (FRRO) closest to your place of residence. District Superintendents of Police are designated Foreigners Registration Officers (FROs) in certain cities.<br>If you have overstayed your visa, the local police must provide clearance to FRRO to issue an exit visa which can be a lengthy process.<br>You are required to schedule an online appointment with the Bureau of Immigration before visiting the FRRO for your visa related issues."}, "Indonesia": {"country-iso": "ID", "name": "Indonesia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Free visit (stays under 30 days): Not required<br>Free visit (stays under 30 days): Not required<br>Tourist visa (stays of 30 to 60 days): Required<br>Tourist visa (stays of 30 to 60 days): Required<br>Business visa: Required<br>Business visa: Required<br>Social-cultural visit visa: Required (e.g. for humanitarian work, educational field trips)<br>Social-cultural visit visa: Required (e.g. for humanitarian work, educational field trips)<br>Limited stay visa (see below): Required<br>Limited stay visa (see below): Required<br>Free visit<br>You do not need a visa if you are planning to stay in Indonesia for less than 30 days and are travelling for one of the following purposes:<br>Tourist visa<br>If you are travelling for tourism with a regular Canadian passport and plan on staying in Indonesia from 30 days to 60 days, you may obtain a visa in advance or on arrival at select points of entry. You may need to show a return or onward ticket.<br>Business and social-cultural visas<br>Canadians travelling to Indonesia for business or social-cultural purposes (e.g volunteer work) must be in possession of a visa prior to arrival. A business and social-cultural visit, single-entry visa is extendable from within Indonesia. A round-trip airline ticket is required to obtain all types of visas.<br>Canadians travelling for business or social-cultural purposes require a letter from both the sponsoring organization in Indonesia and the sending organization.<br>More information on visas - Embassy of the Republic of Indonesia<br>Limited stay visa<br>A limited stay visa can be issued to Canadians travelling to Indonesia for any of the following reasons:<br>Journalists and aid workers<br>Journalists visiting Indonesia for reporting and filming purposes must obtain authorization from the Directorate General of Immigration in Jakarta before applying for a visa. Aid workers are required to have a sponsor in Indonesia in order to obtain a visa. Aid workers going to Aceh require prior authorization from the Directorate General of Immigration in Aceh or Jakarta.<br>Canadians who travel to Indonesia for an extended stay must have their visa converted into a permit at the nearest immigration office upon arrival in Indonesia.<br>Indonesia strictly enforces its immigration and visa requirements. Foreigners have been detained in immigration detention centres for visa violations or overstays. Those in violation may be subject to substantial fines and deportation."}, "Iran": {"country-iso": "IR", "name": "Iran", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Iran.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Pilgrimage visa: Required<br>Press visa: Required<br>Transit visa: Required<br>Overstaying your visa may lead to detention, imprisonment and fines and you will be required to remain in Iran until the situation has been resolved.<br>The application process for an Iranian visa can be long. It should be started well in advance of your date of travel. One of the following third parties must submit a tourist visa application on your behalf:<br>Business visitors<br>You can obtain a business visa, which is valid for 72 hours, at any point of entry. The host company must contact the Passport and Visa Department of the Iranian Ministry of Foreign Affairs prior to your arrival to complete the necessary paperwork.<br>Your passport may be confiscated in business disputes."}, "Iraq": {"country-iso": "IQ", "name": "Iraq", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must have a visa to visit Iraq. After 10 days in the country, you must register your arrival with the Iraqi Residence Office (Ministry of Interior). After three months in Iraq, you must apply for a one-year residence permit.<br>Kurdistan Region of Iraq<br>Due to new federal measures being implemented at all airports and ports of entry, you must obtain an Iraqi visa to visit the Kurdistan Region of Iraq. If you are departing the Region, you may be required to obtain an Iraqi visa. If you are leaving via the airport in Baghdad without a visa, you may be required to pay a penalty fee at departure."}, "Ireland": {"country-iso": "IE", "name": "Ireland", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required<br>Work permit: Required (except for the Student Work Abroad Program)"}, "Israel, the West Bank and the Gaza Strip": {"country-iso": "IL", "name": "Israel, the West Bank and the Gaza Strip", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required<br>Student visa: Not required<br>Work visa: Required (must be arranged by Israeli employer)"}, "Italy": {"country-iso": "IT", "name": "Italy", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up 90 days<br>Work visa: Required<br>Student visa: Required"}, "Jamaica": {"country-iso": "JM", "name": "Jamaica", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Work visa: required<br>Tourist visa: not required (for stays up to six months)<br>Business visa: required <br>Student visa: required<br>You are generally granted visitor landed status for 90 days when visiting Jamaica, at the end of which you must seek an extension if you are planning to stay longer on island. You may obtain an extension for a visa at any immigration office.<br>Overstaying a visa or entry stamp also a criminal offence and can lead to jail time, heavy fines and deportation.<br>Persons found working illegally may be held in a local prison until arrangements for their return to Canada are made at their own cost.<br>Passport, Immigration & Citizenship Agency – Jamaican Government"}, "Japan": {"country-iso": "JP", "name": "Japan", "advisory-text": "Exercise normal security precautions (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to a maximum of 90 days<br>Business visa: Required<br>Work visa: Required<br>Student visa: Required<br>You cannot apply for a visa if you have already entered Japan as a tourist.<br>Business travellers need a visa if they are to receive compensation in addition to their regular salary for work carried out while in Japan.<br>Overstaying the 90-day, tourist visa-free limit or any other visa time limit is a criminal offence. If you overstay, you may be subject to fines, deportation and may be barred from re-entry to Japan.<br>For further information on visas, contact the Embassy of Japan in Ottawa or the Japanese consulate nearest you before departure.<br>Learn about laws that apply to work in Japan"}, "Jordan": {"country-iso": "JO", "name": "Jordan", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourism visa<br>Required, and valid for 30 days. If you arrive by air or through the Sheikh Hussein border crossing, you may obtain a visa upon arrival. If you enter the country via the King Hussein Bridge or Wadi Araba (Aqaba) border crossing, you must obtain a visa before travelling, either online or from a Jordanian diplomatic mission.<br>You can extend the validity of a visitor visa at any police station.<br>If you overstay your visa, you’ll be fined when leaving the country.<br>Business visa<br>First, you need a tourism visa to enter. Then, you must obtain a residency permit from Jordan’s Ministry of Interior upon arrival.<br>Residency Permit<br>First, you need a tourism visa to enter. Once in Jordan, you must obtain a residency permit from the Ministry of Interior.<br>Jordan only issues visas at:<br>Jordan doesn’t issue visas at:<br>Useful links<br><br>Health entry requirements<br>You must undergo medical exams to obtain a residency permit, including mandatory testing for tuberculosis, HIV and hepatitis C."}, "Kazakhstan": {"country-iso": "KZ", "name": "Kazakhstan", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians can enter Kazakhstan without a visa for up to 30 days.<br>For stays longer than 30 days, you must obtain either a single- or multiple-entry visa. Single-entry visas allow visitors to remain in Kazakhstan for up to 90 days, while multiple-entry visas are valid for up to three years with a maximum stay of 30 days per entry.<br>When obtaining a visa, ensure that the visa corresponds to the type of activity you plan to undertake. Visa infringement is punishable by prison terms and deportation.<br>You do not need a letter of invitation for stays longer than 30 days if you are applying for an A3, B1, B3, B10 or B12 visa. Travellers with all other categories of visa must obtain an invitation for stays longer than 30 days.<br>Visas for foreign citizens - Kazakh Ministry of Foreign Affairs"}, "Kenya": {"country-iso": "KE", "name": "Kenya", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to transit through, visit or work in Kenya.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Work Permit: Required<br>Transit visa: Required<br>To avoid problems on arrival, always check visa requirements with the High Commission of Kenya before you travel.<br>Tourist visas are valid for up to three months. To extend a tourist visa, contact immigration authorities once you are in the country.<br>You need to obtain a visa if you are transiting Kenya to another destination. Your stay may not exceed 72 hours. If you are connecting to a flight directly without leaving the airport, you do not need a transit visa.<br>Foreign diplomatic missions and consulates in Canada<br>How to obtain a visa<br>You should obtain a visa in advance through the High Commission for the Republic of Kenya or via the Kenyan Department of Immigration Services’ eVisa website.<br>Unofficial websites also offer visas but typically charge an additional service fee that is significantly higher than the cost of the actual visa. Official government of Kenya websites have an address that ends with “.go.ke”.<br>You can also obtain a visa at a Kenyan port of entry.<br>More information about Kenya’s eVisa - Kenyan Department of Immigration Services<br>Fees<br>You must pay all visa fees in exact cash and only in U.S. dollars, British pound sterling or euros. You can’t pay for a visa with a credit card.<br>There is no fee for visas for children under 16 years.<br>East African tourist visa<br>The East African Tourist Visa allows for multiple entries to Kenya, Uganda, and Rwanda.<br>This visa is valid for 90 days and cannot be extended.<br>You must obtain this visa from the authorities of the country that is your first entry point. If you plan to begin your trip in Kenya, you must obtain it from the High Commission for the Republic of Kenya or on arrival."}, "Kiribati": {"country-iso": "KI", "name": "Kiribati", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for visits of fewer than 28 days<br>Business visa: Not required<br>Student visa: Not required"}, "Kosovo": {"country-iso": "XK", "name": "Kosovo", "advisory-text": "Exercise normal security precautions (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days"}, "Kuwait": {"country-iso": "KW", "name": "Kuwait", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to visit Kuwait.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>You can obtain a tourist visa upon arrival. If you need a business or student visa, you must get it at an embassy or consulate of Kuwait before arrival.<br>Arriving without a visa could lead to refused entry or a lengthy delay.<br>E-Visa<br>Canadians travelling with a regular passport can also get a tourist, business or visit visa online. You must present a copy of this visa for verification on arrival.<br>Apply for a tourist, business or visit visa - Ministry of interior<br>Other requirements<br>A round-trip or onward travel ticket is required to obtain a transit visa."}, "Kyrgyzstan": {"country-iso": "KG", "name": "Kyrgyzstan", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required (for stays up to 60 days) <br>Business visa: Not required (for stays up to 60 days) <br>Student visa: Not required (for stays up to 60 days)<br>Transit visa: Not required<br>To visit for longer than 60 days, Canadians must obtain a visa. Depending on the type of visit, you may be eligible for an e-visa.<br>More about the Kyrgyzstan’s e-visa - Ministry of Foreign Affairs of Kyrgyzstan"}, "Laos": {"country-iso": "LA", "name": "Laos", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa.<br>A tourist visa can be obtained upon arrival at Wattay International Airport, Luang Prabang International Airport, Pakse International Airport and most “international” (that is, open to all foreign nationals) border crossings. Confirm whether tourist visas are available with the nearest Laotian embassy or consulate. A passport photo and US$42 are required to obtain a visa upon arrival.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Latvia": {"country-iso": "LV", "name": "Latvia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Business visa: not required for stays up to 14 days<br>Student visa: not required for stays up to 90 days*<br>Work permit: required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Lebanon": {"country-iso": "LB", "name": "Lebanon", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Lebanon. Visas are available at Lebanese diplomatic missions abroad or at any port of entry into Lebanon.<br>Make sure your visa is valid for the duration of your stay. An expired entry visa must be extended by Lebanese authorities or you will not be allowed to leave the country."}, "Lesotho": {"country-iso": "LS", "name": "Lesotho", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians do not require a visa for stays up to 14 days.<br>If you want to stay longer than 14 days but less than 44 days, you can apply for an extension with the Lesotho immigration authorities. You must apply for an extension before the end of the initial 14 days.<br>To stay beyond 44 days, you must apply for a temporary residence permit. The extension and issuance of residence permits is only done at the immigration office.<br>Visitor visa: Not required for stays up to 14 days, with possible extension of additional 30 days <br>Temporary residence permit: Required for stays beyond 44 days<br>Work permit: Required<br>Study permit: Required"}, "Liberia": {"country-iso": "LR", "name": "Liberia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required<br>Ordinary visa: Required<br>Official visa: Required"}, "Libya": {"country-iso": "LY", "name": "Libya", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must be in possession of a visa to visit Libya. You may have difficulties obtaining a visa if your passport expires before the visa’s 6-month validity period expires.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Libyan visas are issued to residents of the country in which the application is made. Expect a 20-working-day waiting period after submitting your passport and application in person at a Libyan embassy. Mailed applications are not accepted.<br>Tourist visas are not usually available to individual Canadians unless they are part of an organized tour group travelling under the auspices of an accredited travel agent in Libya."}, "Liechtenstein": {"country-iso": "LI", "name": "Liechtenstein", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days*<br>Long-stay or residency visa: Required for stays more than 90 days and must be obtained before arrival in Liechtenstein<br>Professional visa: Required<br>Student visa: Required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Lithuania": {"country-iso": "LT", "name": "Lithuania", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Student visa: required<br>Work permit: required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Luxembourg": {"country-iso": "LU", "name": "Luxembourg", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Business visa: not required for stays up 90 days*<br>Student visa: required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period.<br>Stays of more than 90 days require a residence permit, which must be obtained prior to arriving in Luxembourg."}, "Macao": {"country-iso": "MO", "name": "Macao", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>A visa is not required for stays of fewer than 30 days. For longer stays, you must apply for an extension of stay, which must be approved by the Immigration Department of the Macao SAR.<br>Canadians travelling to mainland China via Hong Kong must obtain a Chinese visa before arrival. Travellers entering Macao from mainland China and then leaving Macao via the mainland should have a Chinese visa for that re-entry.<br>Entry/exit requirements for China<br>Tourist visa: Not required (for stays of up to 30 days)<br>Business visa: Not required<br>Investment visa: Required<br>Student visa: Required"}, "Macedonia": {"country-iso": "MK", "name": "Macedonia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days<br>If you want to stay longer than 90 days but did not apply for a visa prior to arriving in Macedonia, you must leave the country and apply for the appropriate visa at a Macedonian embassy or consulate. The Macedonian Border Police strictly enforce entry and exit requirements. If you stay beyond the permitted number of days, you could be severely fined or barred from returning to Macedonia."}, "Madagascar": {"country-iso": "MG", "name": "Madagascar", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must also be in possession of a visa and a round-trip ticket.<br>Tourist visa: Required for stays up to 90 days<br>Business visa: Required for stays up to 90 days<br>Student visa: Required<br>You should apply for a visa before travelling to Madagascar, even though a tourist visa can be obtained at the airport for stays of up to 90 days, with no extensions. If you choose to obtain a visa at the airport, ensure your passport has two blank pages and expect long delays."}, "Malawi": {"country-iso": "MW", "name": "Malawi", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required<br>Canadians may be able to obtain a visa on arrival at the airport or border crossing. To avoid inconveniences at the port of entry, it is strongly recommended to obtain a visa in advance, at the nearest Malawian diplomatic mission.<br>Specific documents are required for Canadians volunteering in Malawi."}, "Malaysia": {"country-iso": "MY", "name": "Malaysia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required (for stays of up to 90 days) <br>Business visa: Required <br>Student visa: Required<br>For stays of over 90 days, you must apply for an extension at any Malaysian Immigration office.<br>Malaysian Immigration offices<br>A special visa is available to individuals who participate in the Malaysia My Second Home or Mm2h program."}, "Maldives": {"country-iso": "MV", "name": "Maldives", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required (issued upon arrival)<br>Business visa: Required<br>Student visa: Required<br>You can get a 30-day tourist visa on arrival. You can extend a tourist visa for a total stay of no more than 90 days.<br>To obtain a tourist visa, you must also show an onward or return ticket and proof of sufficient funds."}, "Mali": {"country-iso": "ML", "name": "Mali", "advisory-text": "Avoid all travel", "visa-info": "<br>You must have a visa to visit Mali. You should obtain prior to arrival.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Malta": {"country-iso": "MT", "name": "Malta", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Business visa: not required for stays up to 90 days<br>Student visa: not required for stays up to 90 days<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Marshall Islands": {"country-iso": "MH", "name": "Marshall Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>You can obtain a tourist visa upon arrival at the airport. For business or student visas, contact the Embassy of the Republic of the Marshall Islands.<br>Find foreign diplomatic missions and consulates in Canada."}, "Martinique": {"country-iso": "MQ", "name": "Martinique", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Long-stay or residency visa: Required for stays longer than 90 days<br>Professional visa: Required<br>Student visa: Required<br>A Schengen visa is not valid to visit Martinique, a French overseas department."}, "Mauritania": {"country-iso": "MR", "name": "Mauritania", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>Canadians can obtain a visa prior to or upon arriving in Mauritania.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Mauritius": {"country-iso": "MU", "name": "Mauritius", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of less than 90 days<br>Student visa: Required<br>Work permit: Required<br>A letter of authorization from the inviting organization is required for persons travelling to Mauritius on business."}, "Mayotte": {"country-iso": "YT", "name": "Mayotte", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Long-stay visa: Required if stays exceed 90 days<br>Student/work visa: Required<br>You must obtain a visa from a French embassy or consulate before arriving in Mayotte.<br>Other entry requirements<br>Customs officials may ask you to show them a return or onward ticket and proof of sufficient funds to cover your stay."}, "Mexico": {"country-iso": "MX", "name": "Mexico", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians seeking to enter Mexico as tourists do not require a visa.<br>If you are travelling to Mexico for purposes other than tourism, you may require a proper visa. Foreigners involved in unauthorized activities will be expelled. Consult the Embassy of Mexico in Canada for more information.<br>Canadians travelling to the northern border zone (within 21 kilometres of the U.S. border) for work do not require a visa for stays of 72 hours or less.<br>Business visa: required <br>Work visa: required <br>Student visa: required<br>You should apply for your visa yourself. If a prospective employer is processing your business (or work) visa for you, obtain copies of all correspondence between the employer and Mexican immigration authorities, and verify that these copies are stamped by the immigration authorities as proof that your papers are being processed. You should also request a receipt from your employer for any document (your Canadian passport, for example) that you provide for purposes of obtaining the visa. You should not surrender your passport to your employer."}, "Micronesia (FSM)": {"country-iso": "FM", "name": "Micronesia (FSM)", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of up to 30 days<br>Business visa: Required<br>Student visa: Required"}, "Moldova": {"country-iso": "MD", "name": "Moldova", "advisory-text": "Exercise normal security precautions (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days per six-month period<br>Business visa: Not required for stays up to 90 days per six-month period<br>Student visa: Not required for stays up to 90 days per six-month period"}, "Monaco": {"country-iso": "MC", "name": "Monaco", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days*<br>Business visa: Not required for stays up to 90 days*<br>Student visa: Required<br>*For stays longer than 90 days, you must obtain a visa, from one of the consulates general of France in Canada, prior to arrival in Monaco. A residency permit may also be required if staying longer than 90 days.<br>Customs officials may ask you to show them a return ticket or proof of onward travel."}, "Mongolia": {"country-iso": "MN", "name": "Mongolia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of up to 30 days<br>Business visa: Required<br>Student visa: Required"}, "Montenegro": {"country-iso": "ME", "name": "Montenegro", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days"}, "Montserrat": {"country-iso": "MS", "name": "Montserrat", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Not required<br>The Montserratian authorities charge a departure tax of EC$45 to all visitors who have been in the country for more than 24 hours. This is payable at your departure point, the airport or ferry."}, "Morocco": {"country-iso": "MA", "name": "Morocco", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required (for stays of less than 90 days)<br>Business visa: Not required (for stays of less than 90 days)<br>Student visa: Not required (for stays of less than 90 days)<br>You must secure proper authorization if you plan to extend your stay in Morocco beyond 90 days. Contact the Service to Foreigners Section (Section du service aux étrangers) at the local police station at least 15 days prior to the expiry of the 90-day limit. If you remain in the country beyond the 90-day limit, you will be forced to remain in Morocco until you are seen by a prosecutor and fined.<br>If you enter Morocco by private boat, you must do so at a recognized port of entry."}, "Mozambique": {"country-iso": "MZ", "name": "Mozambique", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must have a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Residency/employment visa: Required<br>Transit visa: Required<br>You can get a tourist visa on arrival at every international airport and at most international ports and land borders. You must pay visa fees in cash (in Mozambican metical or U.S. dollars). The visa validity period ranges from 30 days to six months. No single stay may exceed 30 consecutive days. You will receive a heavy fine for every day you overstay your visa or if you have the wrong type of visa for your stay.<br>Make sure customs officials properly inspect and stamp your passport and visa before leaving the country in order to avoid possible fines."}, "Myanmar": {"country-iso": "MM", "name": "Myanmar", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>A visa is required for tourism and business purposes. It should be obtained prior to travel at a Myanmar diplomatic mission. An eVisa option and multiple-entry business visas are available.<br><br>The Myanmar government has created a visa-on-arrival program to allow select business travellers, including Canadians, to obtain a business visa upon arrival at the Yangon International Airport. Travellers are encouraged not to rely on this option, however, as the program’s requirements and eligibility criteria remain unclear. It is strongly recommended that all travellers, including business travellers, carefully verify visa requirements and options with the nearest Embassy of the Republic of the Union of Myanmar before travelling.<br>Foreign journalists have had difficulty obtaining visas, and some have been denied entry upon arrival despite having received a visa. In the past, journalists, and tourists mistaken for journalists, have been denied entry when travelling on tourist visas, have been harassed and have had film and notes confiscated upon leaving the country.<br>Travel to parts of Myanmar is strictly controlled by government authorities. Foreigners have been deported and detained for visa offences.<br>Tourist visa: Required (valid for 28 days)<br>Business visa: Required"}, "Namibia": {"country-iso": "NA", "name": "Namibia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Required<br>Employment visa: Required<br>Ensure that your passport has sufficient visa pages for travel to Namibia and neighbouring countries for the entire duration of your trip.<br>At least 2 completely blank pages are required for entry into Namibia.<br>Make sure the visa stamp is valid for the duration of your stay (up to 90 days) and that immigration officials have given you a correctly dated entry stamp, as this will be checked upon departure.<br>Authorities are very strict regarding visa validity. Overstaying the time granted or having an incorrect or missing entry stamp could lead to detention, arrest and fines."}, "Nauru": {"country-iso": "NR", "name": "Nauru", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Canadians must obtain a visa prior to travelling to Nauru.<br>Tourist visa: Required <br>Business visa: Required<br>Student visa: Required<br>Business travellers must also prove that they have a local sponsor."}, "Nepal": {"country-iso": "NP", "name": "Nepal", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required (valid for up to 60 days)<br>Business visa: Required (only issued in Nepal)<br>Student visa: Required<br>Canadians must have a visa to visit Nepal.<br>You can purchase a tourist visa at:<br>You will need to supply a recent passport-size photo. Ensure that you have the necessary amount of funds (Canadian and U.S. dollars are accepted) with you if you wish to obtain a visa upon arrival. Check with the closest Nepalese embassy or consulate for the latest visa fees.<br>Visa overstays<br>Overstaying your visa is an offence and immigration authorities can detain you until you pay a fine. In addition to fines and detention, overstays can result in a 7-year ban on re-entry."}, "Netherlands": {"country-iso": "NL", "name": "Netherlands", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days"}, "New Caledonia": {"country-iso": "NC", "name": "New Caledonia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Long-stay or residency visa: Required for stays more than 90 days<br>Work visa: Required<br>Student visa: Required"}, "New Zealand": {"country-iso": "NZ", "name": "New Zealand", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays of up to 90 days)<br>Business visa: Required<br>Student visa: Required"}, "Nicaragua": {"country-iso": "NI", "name": "Nicaragua", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: not required for stays of up to 90 days*<br>Business visa: not required*<br>Student visa: not required*<br>* All Canadian travellers must obtain a tourist card on arrival. It’s available at the port of entry for a US$10, payable in cash.<br>The tourist card allows travel within the C-4 countries."}, "Niger": {"country-iso": "NE", "name": "Niger", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>Prior to your travel, Canadians must obtain a visa to visit Niger.<br>Tourist visa: Required <br>Business visa: Required<br>Student visa: Required"}, "Nigeria": {"country-iso": "NG", "name": "Nigeria", "advisory-text": "Avoid non-essential travel (with regional advisories)", "visa-info": "<br>Canadians must have a visa to visit Nigeria.<br>Tourist/visitor/transit visa: Required<br>Business visa: Required<br>Employment visa: Required<br>Temporary work permit: Required<br>Student visa: Required"}, "Niue": {"country-iso": "NU", "name": "Niue", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 30 days<br>Business visa: Not required for stays up to 30 days"}, "North Korea": {"country-iso": "KP", "name": "North Korea", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must have a visa to enter North Korea. You can obtain a visa from a North Korean mission in a third country after approval from the government in Pyongyang. The process for obtaining visas can be extremely slow and arduous.<br>Canadians arriving without a valid Canadian passport and visa may be detained, arrested, fined or denied entry.<br>Professional journalists must apply for special permission to visit North Korea and may not enter the country on a tourist visa, even if they are travelling for personal reasons.<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required"}, "Northern Marianas": {"country-iso": "MP", "name": "Northern Marianas", "advisory-text": "Exercise normal security precautions", "visa-info": ""}, "Norway": {"country-iso": "NO", "name": "Norway", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Business visa: not required<br>Work visa: employment authorization must be obtained outside of Norway, prior to arrival. <br>Student visa: not required for stays up to 90 days<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Oman": {"country-iso": "OM", "name": "Oman", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must have a visa to visit Oman. You can obtain and pay for a visa upon arrival at Muscat International Airport. You can also obtain a visa on-line. Obtaining your visa before arriving would allow you to avoid delays.<br>Visa Eligibility Wizard – Royal Omani Police"}, "Pakistan": {"country-iso": "PK", "name": "Pakistan", "advisory-text": "Avoid non-essential travel", "visa-info": "<br>Canadians must be in possession of a visa to visit Pakistan.<br>Work visa: Required<br>Tourism visa: Required<br>Business visa: Required<br>Student visa: Required<br>Do not overstay the duration of your visa. The status or nature of the visa cannot be changed while in Pakistan."}, "Palau": {"country-iso": "PW", "name": "Palau", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Visas are issued upon arrival at the airport.<br><br>Stays beyond 30 days must be approved by Palau’s Chief of Immigration and cost US$50.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Panama": {"country-iso": "PA", "name": "Panama", "advisory-text": "Exercise normal security precautions (with regional advisories)", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Required <br>Student visa: Required"}, "Papua New Guinea": {"country-iso": "PG", "name": "Papua New Guinea", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required<br>You should obtain a tourist visa (valid for 60 days) prior to travelling to Papua New Guinea; however, it is possible to obtain one upon arrival at the Port Moresby Jacksons International Airport.<br>If you arrive by cruise, you may qualify for an electronic visa. Contact your carrier for details.<br>More information about visas: Papua New Guinea’s Immigration and Citizenship Service Authority"}, "Paraguay": {"country-iso": "PY", "name": "Paraguay", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: required <br>Business visa: required <br>Student visa: required<br>Canadians require a valid visa to enter Paraguay.<br>You may obtain a visa on arrival if you land at the Asunción Silvio Pettirossi International Airport. You will have to pay US$150, in cash only.  The visa will be valid until the expiration date of your passport.<br>If you are planning to enter via other points of entry, you must apply for a visa in advance at the closest Paraguayan embassy or consulate."}, "Peru": {"country-iso": "PE", "name": "Peru", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required <br>Business visa: Required <br>Student visa: Required<br>If you entered Peru with a business visa, you must obtain a certificate from the Peruvian Ministry of the Economy to prove that all Peruvian taxes on income earned during the trip have been paid prior to leaving the country. The certification is required even if no money was paid or earned and must be presented to the central Peruvian immigration office in Lima before departure."}, "Philippines": {"country-iso": "PH", "name": "Philippines", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians do not require a tourist or business visa for stays of up to 30 days. To extend your stay, apply at the Philippine Bureau of Immigration before the 30-day period expires.<br>The visa issued by immigration officials upon your arrival in the Philippines takes precedence over any visa that you may have obtained from a Philippine embassy or consulate abroad.<br>If you are leaving the Philippines using a temporary passport that was issued inside the country, consult the Philippine Bureau of Immigration to obtain the required exit stamps.<br>Tourist visa: Not required (for stays of up to 30 days)<br>Business visa: Not required (for stays of up to 30 days)<br>Student visa: Required"}, "Poland": {"country-iso": "PL", "name": "Poland", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days*<br>Business visa: Not required for stays up to 90 days*<br>Work visa: Required<br>Student visa: Required<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period.<br>To stay longer than 90 days, Canadians must apply either for a Polish visa in Canada before arriving in Poland or for a temporary residence permit while in Poland and must have a valid reason for extending their stay, such as education or employment.<br>Extending your stay in Poland - Office for Foreigners"}, "Portugal": {"country-iso": "PT", "name": "Portugal", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days (see Schengen area for details)<br>Business visa: Not required for stays up 90 days (see Schengen area for details)<br>Work visa: Required<br>Student visa: Required"}, "Puerto Rico": {"country-iso": "PR", "name": "Puerto Rico", "advisory-text": "Exercise normal security precautions", "visa-info": ""}, "Qatar": {"country-iso": "QA", "name": "Qatar", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Canadians must have a visa to visit Qatar, which they can obtain when they arrive. Visas are valid for 30 days<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required<br>Residence and work permits<br>Canadians must possess residence and work permits to work in Qatar. To receive these permits, an employer must sponsor you. Your employer then controls the issuance of exit permits, even for personal travel and emergencies.<br>If you are working in Qatar, you should request a multiple entry/exit permit from your employer. If you break your employment contract, you may have to pay large fines before authorities allow you to leave the country. In the event of a contract or employment dispute, Qatari authorities refer to the Arabic language of a contract. Transferring employment in Qatar also requires the permission of the current sponsor."}, "Republic of Congo (Brazzaville)": {"country-iso": "CG", "name": "Republic of Congo (Brazzaville)", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must obtain a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Transit visa: Required"}, "Réunion": {"country-iso": "RE", "name": "Réunion", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Visa requirements are the same as those of France.<br>Entry/exit requirements for France"}, "Romania": {"country-iso": "RO", "name": "Romania", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days within any 180-day period<br>Business visa: Not required for stays up to 90 days within any 180-day period<br>Student visa: Required<br>The 90-day, visa-free period begins upon initial entry into Romania.<br>If you plan to return to Romania within 180 days of your last visit, authorities will only allow you entry for what’s left of your 90-day, visa-free exemption. If you’ve already spent 90 days within any 180 day-period, authorities may refuse you entry."}, "Russia": {"country-iso": "RU", "name": "Russia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must be in possession of a visa to visit Russia. Visa applications must be submitted electronically, via the Embassy of the Russian Federation’s website.<br>Tourist visa: Required (for those staying in commercial accommodations); exceptions apply<br>Guest visa: Required (for those staying in private accommodations)<br>Business visa: Required <br>Student visa: Required <br>Transit visa: Required (including for Belarus); exceptions apply<br>Exit visa: Required<br>Foreign visitors must leave the Russian Federation once the visa validity period has ended. To extend a visa, a foreign national must arrange with the territorial units of the migration service authorities prior to the validity end date to commence the extension process.<br>Tourist visa<br>You need a tourist visa if you are staying at a hotel or other commercial establishment. Ensure that the hotel registers your visa when you check-in.<br>It is best if you book your travel through a travel agency, which will submit a tourist visa application on your behalf. Canadian travel agents work with Russian travel agencies or companies, which act as sponsors for tourist visas.<br>In cases of expired tourist visas or lost or stolen Canadian passports, only the visa-sponsoring travel agency is authorized to apply for a new tourist visa on your behalf. Extensions are not issued. Holders of expired visas face heavy fines or detention upon departure.<br>You need a guest visa if you intend to stay in private accommodations. The host must obtain an official invitation (priglashenie) from the local UFMS (Russian visa and passport office) and send it to you (the guest) in Canada. You must then take the invitation, the visa application and your passport to a Russian embassy or consulate to apply for the visa.<br>Business visa<br>To get a business visa, you need to be sponsored by a Russian individual or organization (host). It may take up to three months for the host to obtain approval for sponsorship from the Ministry of the Interior. Any subsequent change (replacement or extension) to the original visa must be made by the sponsor. A business visa is not a work permit.<br>Exit visa<br>You must have a valid visa to be allowed to leave Russia. If your visa expires, your sponsor must apply for an exit visa on your behalf. To avoid problems, including deportation, make sure your visa is valid beyond your intended departure date.<br>Visa exceptions<br>Contact your cruise company to find out if you need to apply for a Russian visa before your cruise starts. International cruise passengers may enter Russia at specific port cities without a visa for up to 72 hours. Your cruise ship tour guide must have all the authorizations required for your entry by the Russian authorities. While in Russia, make sure that you’re able to contact your cruise ship tour guide at any time, in case of emergency or any issue with local authorities.<br>Some Russian international airports have transit areas that allow for visa-free travel through Russia. If you plan to transit through Russia, check with your transportation carrier to see if transit visa exceptions apply to you."}, "Rwanda": {"country-iso": "RW", "name": "Rwanda", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to visit Rwanda.<br>Entry visas are available online at the Directorate General of Immigration and Emigration’s website and are valid for 30 days. 30 days visas are also be available on arrival. To enter the country at any official point of entry, you must present confirmation that the entry visa has been granted and also pay the relevant visa fee.<br>If you plan to stay longer than 30 days after entering Rwanda, you must seek an extension before the expiry of the entry visa. Applications must be made in person at the Directorate General of Immigration and Emigration in Kacyiru, Kigali. Anyone who overstays their visa is subject to a fine.<br>You can also apply for a tourist visa at the nearest Rwandan diplomatic mission or at the Directorate General of Immigration and Emigration in Kigali.<br>Tourist visa: Required <br>Work permit: required<br>Business visa: Required, valid for 90 days and may be extended once (work is not permitted but the holder of this class of visa can change their status)<br>East African Tourist Visa<br>The East African Tourist Visa allows for multiple entries to each Kenya, Uganda, and Rwanda. It is valid for 90 days and cannot be extended. You must obtain this visa from the country that is the first entry point. If you plan on beginning your trip in Rwanda, you must obtain it online.<br>Work permits<br>You must obtain a work permit issued by the Rwanda Directorate General of Immigration and Emigration if you are planning to work in the country. Requirements for a work permit include that you must have obtained a valid police clearance from the country in which you have been residing for the last six months. Obtaining a police certificate from Canada while in Rwanda can take up to six months."}, "Saint-Barthélemy": {"country-iso": "BL", "name": "Saint-Barthélemy", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days within a six-month period<br>Professional visa: Required<br>Student visa: Required"}, "Saint Kitts and Nevis": {"country-iso": "KN", "name": "Saint Kitts and Nevis", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Required"}, "Saint Lucia": {"country-iso": "LC", "name": "Saint Lucia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays up to 42 days)<br>Business visa: Not required <br>Student visa: Not required"}, "Saint Martin": {"country-iso": "MF", "name": "Saint Martin", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days<br>Long-stay or residency visa: required for stays more than 90 days<br>Professional visa: required<br>Student visa: required"}, "Saint-Pierre-et-Miquelon": {"country-iso": "PM", "name": "Saint-Pierre-et-Miquelon", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 3 months within any 6-month period<br>Long stay or residency visa: required*<br>*To stay in Saint-Pierre-et-Miquelon longer than 90 days, Canadians must be in possession of a visa. Upon arrival, the visa must be validated by the French immigration authorities.<br>You may also require a residency permit. You can obtain it from the Bureau de la Réglementation at the Préfecture of Saint-Piere-et-Miquelon."}, "Saint Vincent & the Grenadines": {"country-iso": "VC", "name": "Saint Vincent & the Grenadines", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to one month<br>Business visa: Not required for stays up to one month<br>Student visa: Not required for stays up to one month<br>Stays can be extended for up to one year at the discretion of immigration authorities."}, "Samoa": {"country-iso": "WS", "name": "Samoa", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays less than 60 days<br>Business visa: Not required for stays less than 60 days<br>Student visa: Required (temporary resident permit)<br>You may extend your stay beyond 60 days by applying at the local immigration office. For more information on visas, consult the website of the Government of Samoa."}, "San Marino": {"country-iso": "SM", "name": "San Marino", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 10 days<br>Business visa: Not required<br>Student visa: Not required<br>If you plan to stay more than 10 days, you must obtain a permit of stay from the gendarmerie of San Marino. To stay more than 90 days, or for any type of travel, other than tourism, you should contact the Permanent Mission of the Republic of San Marino to the United Nations before leaving Canada."}, "Sao Tome and Principe": {"country-iso": "ST", "name": "Sao Tome and Principe", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of less than 15 days<br>Business visa: Required<br>Student visa: A tourist visa is issued to students<br>Canadians must obtain a visa prior to arrival for stays of 15 days or longer."}, "Saudi Arabia": {"country-iso": "SA", "name": "Saudi Arabia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Canadians must obtain a visa to visit Saudi Arabia prior to their arrival. In Canada, you can obtain the visa at an agency authorized by the Royal Embassy of Saudi Arabia in Ottawa or, if you reside in a foreign country, at the nearest Saudi embassy or consulate. Overstaying your visa will result in large fines.<br>Visa applications must be sponsored by a Saudi citizen, a travel agency or an organization.<br>Women must be met by their sponsors at the port of arrival or risk being denied entry. To leave the country, women must seek permission from their sponsor as well as their husband. See Laws & Culture for more information.<br>Entry and exit permits<br>If you have a resident permit (iqama), you cannot leave the country without obtaining an exit or exit/re-entry visa (if you intend to return to Saudi Arabia) from the Saudi Ministry of Interior. You must have your sponsor’s approval to obtain these visas.<br>Prior to exit, expats who have outstanding fees for dependents (newly implemented) may be required to pay at the point of exit prior to departure if they have an exit re-entry visa, or on renewal of their exit re-entry visa.<br>Single-entry visa holders do not need an exit permit."}, "Senegal": {"country-iso": "SN", "name": "Senegal", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required (for stays of less than 90 days)<br>Business visa: Not required (for stays of less than 90 days)<br>Student visa: Not required (for stays of less than 90 days)<br>Canadians can enter Senegal without a visa for stays of less than 90 days. A traveller arriving in Senegal without a visa who wishes to extend his or her stay will have to leave the country and re-enter afterwards.<br>Canadians planning on staying in Senegal for more than 90 days must apply for a visa at the nearest Senegalese embassy or consulate. The visa allows the holder to stay in Senegal for 90 days so that steps can be taken to obtain a « carte d’identité d’étranger» (foreign national identity card) before the end of the period."}, "Serbia": {"country-iso": "RS", "name": "Serbia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days<br>If you plan to stay in Serbia longer than 90 days, contact the Embassy of Serbia or one of its consulates for information on requirements that apply to your specific situation.<br>Foreign diplomatic missions and consulates in Canada"}, "Seychelles": {"country-iso": "SC", "name": "Seychelles", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays less than 90 days)<br>Business visa: Not required<br>Student visa: Not required"}, "Sierra Leone": {"country-iso": "SL", "name": "Sierra Leone", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to visit Sierra Leone.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Singapore": {"country-iso": "SG", "name": "Singapore", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays of up to 30 days)<br>Business visa: Not required (for stays of up to 30 days)<br>Student visa: Required<br>The Singaporean Ministry of Manpower allows an exemption to the business visa (called a “work pass” in Singapore) requirement for certain activities. If you qualify for an exemption, you must notify the Singaporean Ministry of Manpower through their e-notification system.<br>The Singapore Immigration & Checkpoints Authority may extend the period ofof stay beyond the 30 days under certain circumstances.<br>More information about visa extensions – Singapore’s Immigration & Checkpoints Authority<br>More information about work pass exemptions – Singapore’s Ministry of Manpower"}, "Sint Maarten": {"country-iso": "SX", "name": "Sint Maarten", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required (for stays of up to 3 months)<br>Business visa: not required<br>Work permit: required<br>Student visa: required<br>All tourists who wish to stay longer than their allotted time can request an extension; however, the possibilities to obtain an extension may differ for those travellers requiring visas."}, "Slovakia": {"country-iso": "SK", "name": "Slovakia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days* Business visa: Not required for stays up to 90 days<br>Student visa: Not required for stays up to 90 days<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period.<br>Canadians who intend to work or plan to remain in Slovakia for more than 90 days must obtain a temporary residence permit. Failure to obtain a residence permit for stays of over 90 days could result in deportation. Deportation from Slovakia will also mean expulsion from the greater Schengen area."}, "Slovenia": {"country-iso": "SI", "name": "Slovenia", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days*<br>Business visa: not required for stays up to 90 days<br>Student visa: not required for stays up to 90 days<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Solomon Islands": {"country-iso": "SB", "name": "Solomon Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays of up to 90 days<br>Business visa: Not required for stays of up to 30 days<br>Student visa: Required"}, "Somalia": {"country-iso": "SO", "name": "Somalia", "advisory-text": "Avoid all travel", "visa-info": "<br>You need a visa to visit those areas under the authority of the Transitional Federal Government (TFG), Somaliland and Puntland.<br>To visit areas under the authority of the TFG: you should obtain, in advance, a visa from the Embassy of Somali Republic in Kenya.<br>To visit Somaliland and Puntland direct your visa inquiries to the person/organization you will be visiting, as there is no office in Kenya to issue these visas."}, "South Africa": {"country-iso": "ZA", "name": "South Africa", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians do not need a tourist visa to enter South Africa. However, upon arrival, immigration officials will issue a temporary residents visa (TRV) for up to 90 days. Check the expiry date of your TRV to ensure you don’t overstay.<br>If you overstay without authority, you may be forced to pay a fine upon departure and/or can be refused entry for up to 5 years.<br>Serious offenders may be arrested before departure and detained until their court appearance. In such cases, visitors may face a very substantial fine and be deported at their own expense.<br>Tourist visa: Not required for stays up to 90 days<br>Business visa: Not required for stays up to 90 days<br>Student permit: Required<br>Employment permit: Required<br>More about South African visas - South African Department of Home Affairs<br>Changing or extending your visa<br>Some foreigners travelling to South Africa have not gone through the correct channels to obtain, change or extend their relevant visas. This has resulted in arrest and detention due to fraudulently issued visas.<br>While in South Africa, you must go through regional or district offices of the South African Department of Home Affairs for information on visa requirements and issuance.<br>Regional travel<br>If you leave and re-enter South Africa, even for a short time, you will not automatically be given an additional 90-day visitor’s visa. An immigration official can deny you re-entry into South Africa. The immigration officer can also allow you to enter for a limited time only.<br>If you wish to extend your stay, contact the South African Department of Home Affairs 60 days before your visitor’s visa expires.<br>Contact the South African Department of Home Affairs<br>Work or study<br>If you intend to work or study in South Africa, you must apply for the relevant visas prior to your arrival; otherwise, you risk being refused entry and may be returned to your point of origin. You cannot change the type of visa once in South Africa."}, "South Korea": {"country-iso": "KR", "name": "South Korea", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays less than 180 days)<br>Business visa: Not required (for stays less than 180 days)<br>Student visa: Required<br>Working visa: Required (must be obtained outside South Korea)<br>You can’t change your visa status once you’re in South Korea.<br>If you wish to extend the length of your visa, contact the Korea Immigration Service as soon as possible to apply for an extension. Authorities strictly enforce immigration laws and regulations.<br>More information about visas - Korea Immigration Service"}, "South Sudan": {"country-iso": "SS", "name": "South Sudan", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must be in possession of a visa, which should be obtained prior to departure.  Visas are not granted automatically to prospective travellers.<br>You should contact the Embassy of South Sudan in Washington, D.C., to obtain a visa in advance of travelling. Alternatively, you may apply for a visa in person en route to South Sudan at the Embassy of South Sudan in Addis Ababa, Ethiopia, or in Nairobi, Kenya.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Transit visa: Required"}, "Spain": {"country-iso": "ES", "name": "Spain", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days in any 180-day period<br>Business visa: Not required<br>Student visa: Required"}, "Sri Lanka": {"country-iso": "LK", "name": "Sri Lanka", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a valid visa to visit Sri Lanka.<br>For stays of up to 30 days, you can apply online for a tourist visa. You can obtain all other visas at a Sri Lankan government office in Canada or abroad.<br>Visas may be extended at Sri Lanka’s Department of Immigration and Emigration in Colombo.<br>Tourist visa: Required <br>Business visa: Required <br>Student visa: Required <br>Work visa: Required<br>You cannot convert a visa status once in Sri Lanka. Non-compliance with visa restrictions may result in deportation.<br>Apply for the Electronic Travel Authority - Sri Lankan Department of Immigration and Emigration"}, "Sudan": {"country-iso": "SD", "name": "Sudan", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: required<br>Business visa: required<br>Student visa: required<br>Transit visa: required<br>Allow at least 2 months between your visa application and the intended date of travel. Visas are not granted automatically to prospective travellers."}, "Suriname": {"country-iso": "SR", "name": "Suriname", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Business visa: Required <br>Student visa: Required"}, "Sweden": {"country-iso": "SE", "name": "Sweden", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days in any 180-day period<br>Business visa: Not required<br>Student resident permit: Not required for stays up to 90 days<br>Work permit: Required"}, "Switzerland": {"country-iso": "CH", "name": "Switzerland", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days*<br>Business visa: Not required for stays up to 90 days*<br>Student visa: Not required for stays up to 90 days*<br>* The 90-day period begins upon initial entry into any country of the Schengen area. Stays are cumulative and include visits to any Schengen area country within any 180-day period."}, "Syria": {"country-iso": "SY", "name": "Syria", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must be in possession of a visa to visit Syria.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Non-Arab nationals cannot obtain a visa at border points of entry. They must obtain a visa from the nearest Embassy of the Syrian Arab Republic or one of its consulates prior to departure."}, "Taiwan": {"country-iso": "TW", "name": "Taiwan", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Canadian passport holders do not require tourist or business visas for stays of up to 90 days. Once in Taiwan, they may extend their stay for an additional 90 days by placing a request with the Taiwanese Bureau of Consular Affairs. Canadians planning to stay in Taiwan for more than 180 days should obtain a visa before they arrive.<br>Tourist visa: Not required for stays of up to 90 days<br>Business visa: Not required for stays of up to 90 days<br>Student visa: Required<br>Working visa: Required"}, "Tajikistan": {"country-iso": "TJ", "name": "Tajikistan", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>You must have a visa to visit Tajikistan.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>You may obtain a visa valid for a 45-day visit within 90 days of issuance from the Tajikistan Visa Electronic Application Center.<br>Tajikistan Visa Electronic Application Center"}, "Tanzania": {"country-iso": "TZ", "name": "Tanzania", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Work/volunteer visa: Required<br>Canadians need a visa to visit Tanzania. At main ports of entry, you can get a visa on arrival for a maximum of 3 months. When you arrive, ensure that immigration officials validate your visa by stamping your passport or writing any required information in it. Some visas are valid for a period shorter than three months. If you are a frequent visitor or business traveller, apply for a multiple-entry visa before the start of your trip.<br>Verify that you abide by the terms and expiry date indicated on your visa. You could receive a substantial fine if you overstay the period allowed by your visitor visa or residence permit.<br>More information about entry visas, including fees – Ministry of Home Affairs, Tanzania<br>Working and volunteering in Tanzania<br>You cannot perform any type of work, including volunteer work, on a tourist visa. When planning to travel to Tanzania to do volunteer work, contact the High Commission for the United Republic of Tanzania for information on specific requirements.<br>Work permits must be verified by Tanzanian immigration officials within 30 days of issuance. You can get this done at any Tanzanian Immigration office or online the Immigration Department's online verification system.<br>Immigration Service Department’s verification system – Ministry of Home Affairs, Tanzania<br>List of foreign diplomatic missions and consulates in Canada."}, "Thailand": {"country-iso": "TH", "name": "Thailand", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays of up to 30 days <br>Business visa: Required <br>Student visa: Required <br>Working visa: Required<br>If you are travelling to Thailand for tourism with a regular Canadian passport, you can obtain a 30-day visa upon arrival. Immigration officials may ask you to show a return or onward ticket.<br>Canadians who have obtained a multiple entry tourist visa can stay for up to 60 days. The visa is valid for 6 months and must be obtained prior to travelling.<br>If you wish to stay longer than 60 days, or to work or study in Thailand, obtain the appropriate visa from a Thai embassy or consulate."}, "Timor-Leste (East Timor)": {"country-iso": "TL", "name": "Timor-Leste (East Timor)", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>You can obtain a visa on arrival at Dili’s international airport and the Port of Dili, based on the purpose and length of the intended stay. You must pay an entry fee of US$30 for a visit of up to 30 days.<br>You can apply to extend your visa past the 30-day limit at the Immigration Service in Dili. Extensions are US$35 for 30 days or US$75 for up to 60 days.<br>If you plan to enter by land, you need to apply in advance for a Visa Application Authorization. You can do so online or in person at an Embassy or Consulate of Timor-Leste. Once at the border, you can obtain a single or multiple entry visa valid for a stay up to 90 days, if you meet all of the requirements and pay the US$30 fee.<br>Carry the exact amount for the entry fee in cash. There are no currency exchange facilities at Dili’s international airport or at border crossings.<br>You must have a letter confirming your place of employment to obtain a work permit.<br>Tourist visa: Required<br>Business visa: Required"}, "Togo": {"country-iso": "TG", "name": "Togo", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to visit Togo.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Tokelau": {"country-iso": "TK", "name": "Tokelau", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Canadians do not need a visa but do require a permit issued by the Tokelau Apia Liaison Office in Apia, Samoa.<br>Contact the Tokelau Apia Liaison Office"}, "Tonga": {"country-iso": "TO", "name": "Tonga", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visas are issued upon arrival. All other visas must be obtained before arrival.<br>Tourist visa: Required for stays of up to 30 days<br>Business visa: Required for stays of up to 30 days<br>Student visa: Required<br>Tourist visa: Required for stays of up to 30 days<br>Business visa: Required for stays of up to 30 days<br>Student visa: Required"}, "Trinidad and Tobago": {"country-iso": "TT", "name": "Trinidad and Tobago", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required (for less than 90 days)<br>Business visa: Not required (for less than 30 days)<br>Student visa: Required<br>Tourists receive a stamp indicating the period they are allowed to stay in the country, which is usually 90 days.<br>More information about visas – Trinidad and Tobago Immigration Division"}, "Tunisia": {"country-iso": "TN", "name": "Tunisia", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Not required<br>Canadians do not require a visa to visit Tunisia for fewer than 90 days. If you intend to stay in Tunisia longer, contact the Embassy of the Republic of Tunisia in Ottawa for information about visa, work permit or temporary resident status regulations prior to your departure.<br>In Tunisia, you must report to a police station or the Ministry of the Interior."}, "Turkey": {"country-iso": "TR", "name": "Turkey", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Work visa: Required<br>Tourism visa: Required Business visa: Required<br>Student visa: Required<br>Canadians travelling to Turkey for tourism or trade should purchase an e-visa prior to entering the country. Canadians can also obtain a visa on arrival, however, an e-Visa saves time that you would otherwise spend on visa applications at Turkish missions or at the ports of entry into Turkey (if you are eligible). If you are planning on studying or working in Turkey, you must obtain a visa at a Turkish embassy or consulate before arriving in Turkey.<br>To renew a 90-day visa, you must leave the country for at least 90 days before being allowed to re-enter. If you wish to remain in Turkey for longer than 90 consecutive days, you must obtain a residence permit from the Provincial Directorate of Migration Management in the province in which you reside. When your e-Visa expires, you are not allowed to apply for a new e-Visa without departing from Turkey. If you overstay your visa, you might be fined, deported or banned from future travel to Turkey for a specific period of time.<br>More information on the e-visa application system - Republic of Turkey"}, "Turkmenistan": {"country-iso": "TM", "name": "Turkmenistan", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to visit Turkmenistan.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required"}, "Turks and Caicos Islands": {"country-iso": "TC", "name": "Turks and Caicos Islands", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: not required for stays up to 90 days<br>Business visa: required<br>Student visa: required<br>Work permit: required"}, "Tuvalu": {"country-iso": "TV", "name": "Tuvalu", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>You can obtain a visa on arrival to Tuvalu."}, "Uganda": {"country-iso": "UG", "name": "Uganda", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa to enter Uganda.<br>While you can obtain a visa on arrival, you should first attempt to get a visa online. Apply as far in advance of your trip as possible, as delays could occur. You may need proof that you first attempted to apply online, before being granted a visa on arrival.<br>Some travellers without an e-visa have been refused entry, even though they technically qualified for visa on arrival.<br>Apply for an electronic visa - Uganda’s e-immigration system<br>Tourist visa: Required<br>Business visa: Required<br>Work permit: Required<br>Transit visa: Required<br>Canadians intending to work in Uganda should insist that the employer ascertain what type of permit will be required from Uganda’s Directorate of Citizenship and Immigration Control."}, "Ukraine": {"country-iso": "UA", "name": "Ukraine", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>Tourist visa: Not required for stays up to 90 days within a 180-day period<br>Business visa: Not required for stays up to 90 days within a 180-day period<br>Student visa: Not required for stays up to 90 days within a 180-day period<br>Work permit: Required<br>If you intend to stay in Ukraine for more than 90 days, you must obtain a visa prior to entering the country. For further details on visas and work permits, please contact the Embassy of Ukraine to Canada.<br>You must have an invitation from a Ukrainian company or individual if travelling to Ukraine for any other purpose than tourism. Before you travel, contact the nearest Ukrainian embassy for more information about the invitation process."}, "United Arab Emirates": {"country-iso": "AE", "name": "United Arab Emirates", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Required<br>Student visa: Required<br>If you’re entering the UAE as a tourist, you must obtain an entry stamp at the port of entry. This entry stamp is free and valid for 30 days. It’s renewable for a further 30 days."}, "United Kingdom": {"country-iso": "GB", "name": "United Kingdom", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians needing any type of visa should consult UK Visas and Immigration to ensure that they apply for the proper visa and have the appropriate documents for the purpose of their visit (for example, marriage, employment, study), as well as to find out if they will be required to pay a health-care surcharge. Canadians planning to work or volunteer in the United Kingdom for any period of time are required to have a work permit.<br>Tourist visa: Not required (for stays of six months or less)<br>Business visa or work permit: Required*<br>Student visa: Required<br>*A work permit or visa is required even if planning to do unpaid, volunteer or part-time or temporary work."}, "United States": {"country-iso": "US", "name": "United States", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>In most circumstances, Canadian citizens do not require visitor, business, transit or other visas to enter the United States from Canada but there are some exceptions.<br>Canadians Requiring Visas - U.S. Embassy & Consulates in Canada"}, "Uruguay": {"country-iso": "UY", "name": "Uruguay", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required<br>Business visa: Not required<br>Student visa: Required<br>Canadians can stay in Uruguay without a tourist or business visa for 90 days. Once in the country, it is possible to ask immigration authorities for an extension.<br>You can get a student visa in Uruguay, but students must get proof of acceptance from the educational institution before arrival in the country."}, "Uzbekistan": {"country-iso": "UZ", "name": "Uzbekistan", "advisory-text": "Exercise a high degree of caution (with regional advisories)", "visa-info": "<br>You must obtain a visa before arriving in Uzbekistan for stays longer than 30 days.<br>You must obtain a visa before arriving in Uzbekistan for stays longer than 30 days.<br>Tourist visa: Not required (for stays of up to 30 days)<br>Business visa: Not required (for stays of up to 30 days)<br>Student visa: Not required (for stays of up to 30 days)<br>Each type of visa has different application requirements.<br>Overland travel<br>When travelling by rail or road in Uzbekistan, it is sometimes necessary to cross into neighbouring countries. To avoid complications, ensure you have a multi-entry visa for Uzbekistan and any visa required for entry into these countries.<br>Registration<br>You must register with the Office of Visas and Registration if you intend to stay for more than 3 days. Hotel staff normally registers guests when they check-in."}, "Vanuatu": {"country-iso": "VU", "name": "Vanuatu", "advisory-text": "Exercise normal security precautions", "visa-info": "<br>Tourist visa: Not required (for stays less than 30 days)<br>Business visa: Required<br>Student visa: Required"}, "Venezuela": {"country-iso": "VE", "name": "Venezuela", "advisory-text": "Avoid all travel", "visa-info": "<br>Tourist visa: not required (for stays of up to 90 days)<br>Business visa: required<br>Work visa: required<br>Student visa: required<br>Canadians travelling by land or sea may require a visa from a Venezuelan embassy or consulate before their arrival."}, "Vietnam": {"country-iso": "VN", "name": "Vietnam", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Work visa: Required<br>Canadians must be in possession of a visa to enter Vietnam. You should obtain your visa prior to arrival. You can request an extension from:<br>Vietnamese visas in expired Canadian passports are not valid. The visa needs to be transferred to the new passport.<br>Overstaying your Vietnamese visa without authority or having the wrong type of visa is a serious matter and you may be delayed from onward travel until a fine is paid. Check the visa validity and conditions carefully.<br>For visits of multiple entries or longer than 30 days, you must get a visa from the nearest Vietnamese embassy before travelling to Vietnam.<br>A visa may be issued on arrival in emergency situations. Contact the Embassy of the Socialist Republic of Vietnam in Canada for more information on this and other visa requirements.<br>Foreign diplomatic missions and consulates in Canada<br>Electronic visa authorization<br>Holders of a valid Canadian passport are eligible to apply online for a single-entry electronic tourist visa (e-visa), valid for a maximum of 30 days (some restrictions apply).<br>Apply for an e-visa - Immigration Department of Vietnam<br>Visa exemptions<br>Canadian nationals who are spouses or children of Vietnamese nationals can apply for a visa exemption certificate. The certificate is valid for 5 years and allows multiple entries into Vietnam, each for a 6-months stay. Applications can be made at the nearest Vietnamese embassy or the Immigration Department in Vietnam."}, "Virgin Islands (U.S.)": {"country-iso": "VI", "name": "Virgin Islands (U.S.)", "advisory-text": "Exercise normal security precautions", "visa-info": ""}, "Yemen": {"country-iso": "YE", "name": "Yemen", "advisory-text": "Avoid all travel", "visa-info": "<br>Canadians must be in possession of a visa to visit Yemen. Yemeni authorities do not issue visas at ports of entry. You must obtain your visa well in advance at the closest Yemeni diplomatic mission prior to travelling. Expect heavy penalties if you overstay the duration of your visa."}, "Zambia": {"country-iso": "ZM", "name": "Zambia", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must also be in possession of a valid visa. Persons overstaying their visa may be subject to heavy fines, arrest, imprisonment or deportation.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>You can obtain a single- or double-entry tourist visa on arrival in Zambia, payable in U.S. dollars. For more than two entries, you must obtain a visa from a Zambian High Commission, prior to arrival.<br>You must obtain a business and an employment visa prior to arrival in Zambia if you intend to engage in volunteer activities.<br>You must obtain an employment visa if you intend to work in Zambia.<br>Check with the Department of Immigration for more details on Zambian visas and employments.<br>You must carry the original or a certified copy of your passport and immigration permit at all times. Certified copies may be obtained from the office that issued the permit or any local police station."}, "Zimbabwe": {"country-iso": "ZW", "name": "Zimbabwe", "advisory-text": "Exercise a high degree of caution", "visa-info": "<br>Canadians must be in possession of a visa.<br>Tourist visa: Required<br>Business visa: Required<br>Student visa: Required<br>Work permit: Required<br>Residential visa: Required<br>You can obtain a single-entry visa, valid for 30 days, at a port of entry into Zimbabwe or at a Zimbabwean embassy. You can apply for 2 consecutive 30-day extensions (90 days) at any Zimbabwean Department of Immigration office.<br>Zimbabwe Department of Immigration<br>Business visas<br>Travellers on a Zimbabwe business visa or work permit cannot extend the visa from within Zimbabwe. You will need to exit the country and re-enter as a visitor, or apply for a new business visa or work permit and wait for its delivery before attempting to re-enter.<br>Working or living in Zimbabwe<br>If you plan on working or living in Zimbabwe, you must contact the Embassy of Zimbabwe in Ottawa before arriving, as it is very difficult to arrange a work permit or residential visa after arriving in Zimbabwe. Volunteering and missionary activities are considered work and Canadian citizens require a business visa is required to engage in these activities.<br>List of foreign diplomatic missions and consulates in Canada<br>Journalists<br>Foreign media organizations must obtain prior accreditation for their journalists visiting or working in Zimbabwe. Journalists attempting to enter the country without proper advance accreditation may be denied admission or deported. Journalists working in Zimbabwe without accreditation risk arrest and prosecution.<br>If you are seeking registration to enter Zimbabwe as a journalist, contact the nearest Zimbabwean diplomatic office well ahead of your planned departure.<br>List of foreign diplomatic missions and consulates in Canada<br>"}}