[{"country_iso": "AF", "name": "Afghanistan", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "AL", "name": "Albania", "advisory": "Petty crime, such as pickpocketing and theft, does occur, especially in public areas, tourist areas and on public transport. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery. Violent crime, such as armed robbery, though unlikely, can occur. ", "visa_info": "Visa not required"}, {"country_iso": "DZ", "name": "Algeria", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "AD", "name": "Andorra", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "AO", "name": "Angola", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "AG", "name": "Antigua and Barbuda", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "AR", "name": "Argentina", "advisory": "Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "AM", "name": "Armenia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "AU", "name": "Australia", "advisory": "While Australia is generally safe, there have been incidents of pickpocketing, apartment break-ins or vehicle break-ins. Hence, you must exercise precautions on personal safety and over your belongings at all times. Vehicle break-ins are particularly common in tourist spots in Western Australia, for which care must be taken not to leave belongings unattended in your rental/vehicles, to avoid, among others, the loss of your passport, wallet, bag, other valuable items, and incurring fees payable for a damaged rental vehicle.", "visa_info": "Electronic Travel Authority"}, {"country_iso": "AT", "name": "Austria", "advisory": "Petty crime, such as pickpocketing and theft, does occur, especially in public areas, tourist areas, and larger cities. Teams may work together to distract travellers. Thefts are known to take place on trains and public transport when travellers are distracted or sleeping. Be aware of your surroundings and take care of your belongings. ", "visa_info": "Visa not required"}, {"country_iso": "AZ", "name": "Azerbaijan", "advisory": null, "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "BS", "name": "Bahamas", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance. ", "visa_info": "Visa not required"}, {"country_iso": "BH", "name": "Bahrain", "advisory": "Bahrain is generally safe and stable.  Low level crimes like robbery and burglary are not widespread.  Nevertheless we advise all Singaporeans to be careful.    ", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "BD", "name": "Bangladesh", "advisory": "Terrorism: Attacks on individuals and groups, including foreigners and religious minorities, reported in 2015 to 2017, including the 1 July 2016 attack in Dhaka on mostly foreigners, has subsided. There have been no reported attacks since then. Singaporeans should nonetheless remain vigilant and where possible, avoid public gatherings and crowded places. ", "visa_info": "Visa on arrival"}, {"country_iso": "BB", "name": "Barbados", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "BY", "name": "Belarus", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "BE", "name": "Belgium", "advisory": "Demonstrations: Demonstrations in major European cities occasionally take place.  They tend to occur on politically significant holidays and during international summits. Should demonstrations take place, most are peaceful, but the situation can turn confrontational and escalate into violence quickly. Travellers are thus encouraged to avoid areas around protests and demonstrations. If you encounter a demonstration, exercise caution, leave the area as soon as possible, and check the local media for updates on the situation and traffic.", "visa_info": "Visa not required"}, {"country_iso": "BZ", "name": "Belize", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "BJ", "name": "Benin", "advisory": null, "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "BT", "name": "Bhutan", "advisory": "The crime rate in Bhutan is low. Violent crime is uncommon, but there are occasional burglaries, thefts and petty crime. Travellers should still remain vigilant. The Tourism Council of Bhutan warns against foreigners booking their travel with unregistered tour operators. Use only licensed tour operators. ", "visa_info": "Visa required"}, {"country_iso": "BO", "name": "Bolivia", "advisory": "Political demonstrations and protests are common and occur at short notice. Avoid large public gatherings. Head to a safe place immediately. Monitor the local news and make alternative plans in advance. ", "visa_info": "Visa on arrival"}, {"country_iso": "BA", "name": "Bosnia and Herzegovina", "advisory": "Petty crime, such as pickpocketing and theft, is common in tourist areas. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "BW", "name": "Botswana", "advisory": "Malaria can occur throughout Botswana and is prevalent in the north of the country, especially during the rainy season (November to March). ", "visa_info": "Visa not required"}, {"country_iso": "BR", "name": "Brazil", "advisory": "While Brazil is generally safe to travel to, and safety and security situation varies widely from state to state, there have been reports of deteriorating security situation in some states, including Rio de Janeiro and Ceará.  Notably, in view of recent incidents, we strongly advise Singaporeans to avoid visiting “favelas” or shanty towns in Rio de Janeiro, or its immediate vicinity, even with a tour agency.  Singaporeans should also avoid travel to several cities of Ceará, including the capital city of Fortaleza, and to check the local media for regular updates on the situation in the state. Those intending to rent a car should be wary that mobile navigation applications do not normally contain safety information, such as areas which are prone to crime.  There have been reports of tourists entering these areas by mistake while using mobile navigation applications which have resulted in serious injuries or fatality. ", "visa_info": "Visa not required"}, {"country_iso": "BN", "name": "Brunei", "advisory": "Brunei's Ministry of Energy website.", "visa_info": "Visa not required"}, {"country_iso": "BG", "name": "Bulgaria", "advisory": "Petty crime, such as pickpocketing, does occur. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery. If you are driving, lock your vehicle and keep your belongings out of sight. Thieves have been known to puncture tires and steal items when they ‘offer assistance’ to foreigners. Break-ins at hotel rooms have occurred; ensure all windows and doors are locked before leaving each day. ", "visa_info": "Visa not required"}, {"country_iso": "BF", "name": "Burkina Faso", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "BI", "name": "Burundi", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "KH", "name": "Cambodia", "advisory": "Petty thefts such as bag snatching are common in Phnom Penh, Siem Reap and Sihanoukville.  Thieves, sometimes on motorcycles, grab bags and other valuables (including mobile phones and passports) from pedestrians, motorcycle and tuk-tuk passengers. Hotspots for petty thefts include the riverfront and BKK areas of Phnom Penh, and on the beaches in Sihanoukville. Do take the necessary precautions to protect yourself and your belongings. Take care particularly at night when travelling alone. If possible, avoid late-night movement and dimly lit areas. ", "visa_info": "Visa not required"}, {"country_iso": "CM", "name": "Cameroon", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "CA", "name": "Canada", "advisory": "Driving: Snow and ice make road conditions especially treacherous in winter. Seek advice on safe driving in icy road conditions. Snow chains or tyres are advisable and may be required in certain provinces. If you are driving to a remote area, pack extra water, food, and blankets. Do not drive if weather conditions are poor. Drivers are strongly encouraged to purchase a comprehensive insurance plan. ", "visa_info": "Visa not required"}, {"country_iso": "CV", "name": "Cape Verde", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "CF", "name": "Central African Republic", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "TD", "name": "Chad", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "CL", "name": "Chile", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance. ", "visa_info": "Visa not required"}, {"country_iso": "CN", "name": "China", "advisory": "Lost passports: Singaporeans who lost their passports while travelling in China should report the loss to a neighbourhood police post or the relevant Chinese authority (it is usually the local Entry-Exit Administration Bureau). Please request for a copy of the Loss of Passport Report. ", "visa_info": "Visa not required"}, {"country_iso": "CO", "name": "Colombia", "advisory": "Anti-government demonstrations have been taking place across Colombia and clashes between protesters and security forces have occurred, resulting in casualties. Demonstrations can happen without notice and can turn violent.", "visa_info": "Visa not required"}, {"country_iso": "KM", "name": "Comoros", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "CG", "name": "Republic of the Congo", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "CD", "name": "Democratic Republic of the Congo", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "CR", "name": "Costa Rica", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. Do not walk alone after dark. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "CI", "name": "Côte d'Ivoire", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "HR", "name": "Croatia", "advisory": "Petty crime, such as pickpocketing, is common in tourist areas. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "CU", "name": "Cuba", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. Do not walk alone after dark. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "CY", "name": "Cyprus", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "CZ", "name": "Czech Republic", "advisory": "While the crime rate is generally low, petty crime, such as pickpocketing and street theft, does occur. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery. Beware of imposters who impersonate police officers and use fake IDs: if in doubt, offer to accompany them to the nearest police station or call 112 to verify their identity.", "visa_info": "Visa not required"}, {"country_iso": "DK", "name": "Denmark", "advisory": "Petty crime, such as pickpocketing and theft, does occur, especially in public areas, tourist spots, and around Copenhagen. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "DJ", "name": "Djibouti", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "DM", "name": "Dominica", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "DO", "name": "Dominican Republic", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash, wearing jewellery, and drawing cash from ATMs on the street. If robbed, it is safer to hand over your cash and valuables without resistance. ", "visa_info": "Visa not required"}, {"country_iso": "EC", "name": "Ecuador", "advisory": "Ecuador declared a 60-day state of emergency on 4 October 2019 after nationwide protests in response to the government’s announcement to withdraw fuel subsidies. The authorities are working towards restoring order and have arrested hundreds of protestors. Some roads remain blocked by protestors. ", "visa_info": "Visa not required"}, {"country_iso": "EG", "name": "Egypt", "advisory": "Terrorist Attacks:   While attacks occur periodically in parts of the country, most of the attacks have taken place in the North Sinai region. However, over the last two years, places of worship and civilians, including tourists, were targeted.  On 9 April 2017 (Palm Sunday) twin explosions in the Mar Girgis Church in Tanta and St Mark’s Cathedral in Alexandria claimed the lives of 44 people.  On 28 December 2018, a road side bomb blast killed 3 tourists, their Egyptian tour guide, and injured 11 others, while their tour bus was travelling in the Giza district of Cairo. On 19 May 2019, a road side improvised explosive devise hit a tour bus travelling towards the Giza Pyramids complex, near the Grand Egyptian Museum. 17 people were injured. Most recently, on 4 August 2019, a car laden with explosives detonated in the area near the National Cancer Institute in Cairo, a short distance from downtown Cairo. 19 people died and 30 others were injured.", "visa_info": "Visa on arrival"}, {"country_iso": "SV", "name": "El Salvador", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash, wearing jewellery, and using ATMs on the street. Use reliable taxi companies. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "GQ", "name": "Equatorial Guinea", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "ER", "name": "Eritrea", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "EE", "name": "Estonia", "advisory": "Petty crime, such as pickpocketing and theft, does occur. Thieves often target tourists in bars, nightclubs, and hotels. Be aware of your surroundings and take care of your belongings. ", "visa_info": "Visa not required"}, {"country_iso": "SZ", "name": "Eswatini", "advisory": "When travelling in private cars, keep your bags and valuables in the boot and out of sight to avoid “smash and grab” robbery attempts when the car slows down or stops. ", "visa_info": "Visa not required"}, {"country_iso": "ET", "name": "Ethiopia", "advisory": "Civil unrest can escalate quickly and turn violent. Be aware that security forces may not be able to respond to incidents adequately. Exercise caution, avoid protest areas, monitor developments through the local news, and heed the instructions of the local authorities.", "visa_info": "eVisa"}, {"country_iso": "FJ", "name": "Fiji", "advisory": "Do not leave your belongings unattended and be aware of your surroundings. Stay vigilant, travel in groups, and avoid going out at night alone. Know your risk appetite and ensure that you purchase comprehensive travel insurance that will cover your chosen activity. Travellers should note that medical facilities on the islands are limited and that medical evacuation can be expensive.", "visa_info": "Visa not required"}, {"country_iso": "FI", "name": "Finland", "advisory": "Petty crime, such as pickpocketing and theft, does occur. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "FR", "name": "France", "advisory": "The current threat level is “Heightened Security/Risk of Attack” (Tier 2). ", "visa_info": "Visa not required"}, {"country_iso": "GA", "name": "Gabon", "advisory": null, "visa_info": "eVisa"}, {"country_iso": "GM", "name": "Gambia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "GE", "name": "Georgia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "DE", "name": "Germany", "advisory": "Singaporeans are advised to exercise normal travel precautions and vigilance in crowded areas.", "visa_info": "Visa not required"}, {"country_iso": "GH", "name": "Ghana", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "GR", "name": "Greece", "advisory": "Petty crime, including pickpocketing, snatch thefts, and bag slashing, is prevalent, especially in tourist areas and on public transport. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery. Do not walk alone in isolated areas, especially at night. ", "visa_info": "Visa not required"}, {"country_iso": "GD", "name": "Grenada", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "GT", "name": "Guatemala", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash, wearing jewellery, and using ATMs on the street. Use reliable taxi companies. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "GN", "name": "Guinea", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "GW", "name": "Guinea-Bissau", "advisory": null, "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "GY", "name": "Guyana", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "HT", "name": "Haiti", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery, and where possible should travel in larger groups or with reliable local guides. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "HN", "name": "Honduras", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. Travel in groups and during the day where possible. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "HU", "name": "Hungary", "advisory": "Petty crime, such as pickpocketing and theft, does occur, especially in public areas, tourist areas, and large cities. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "IS", "name": "Iceland", "advisory": "Driving in Iceland: Foreign driving licenses are valid for visitors in Iceland on a temporary basis. There is no need for an International Driving Permit. Drivers and passengers are required by law to wear seatbelts. Headlights are required to be on at all times, all year round. In general, the speed limits are as follow:", "visa_info": "Visa not required"}, {"country_iso": "IN", "name": "India", "advisory": "Crime and motor accidents:  The rate of crime and motor accidents in India are high.  Travellers should pay close attention to their personal security at all times and monitor the local news on information regarding security risks.  Precautions that travellers can take include:", "visa_info": "e-Visa"}, {"country_iso": "ID", "name": "Indonesia", "advisory": "Like in Singapore, be aware that crimes can happen at any time, anywhere, in Indonesia.  Be alert to possible petty crimes including but not limited to pick-pocketing and bag-snatching, credit card and ATM fraud, scams and confidence tricks, spiking of drinks, and sexual assaults.   You should take the necessary precautions for your personal safety and belongings, including to remain alert to your surroundings and to avoid travelling to unfamiliar places.", "visa_info": "Visa not required"}, {"country_iso": "IR", "name": "Iran", "advisory": "Cities and historical places in Iran are generally safe. Public disturbance and the risk of terrorism have been reported in the frontier areas, for example, near the Iran-Iraq and Iran-Pakistan borders. Demonstrations and political gatherings may occur suddenly in major Iranian cities. Travellers should avoid large public gatherings, monitor the local news and follow the advice of the local authorities. If there are signs of unrest, leave the area and head to a safe place immediately.", "visa_info": "Visa on arrival"}, {"country_iso": "IQ", "name": "Iraq", "advisory": "", "visa_info": "Visa required"}, {"country_iso": "IE", "name": "Ireland", "advisory": "Driving in Ireland: You can drive on a current and valid driving licence or an international driving permit from your own country for up to a year. If your stay in Ireland will be more than 12 months, you must apply for an Irish driving licence and go through the full driver licencing procedure to drive in Ireland. This allows foreign drivers to be up-to-date with the local traffic rules and become familiar with the traffic terrain. The procedure to obtain an Irish driving licence is on the National Driver Licence Service website at ", "visa_info": "Visa not required"}, {"country_iso": "IL", "name": "Israel", "advisory": "While tourist areas in Israel are generally safe, there have been instances of petty crime such as theft. Be aware of your surroundings and watch your belongings at all times.", "visa_info": "Visa not required"}, {"country_iso": "IT", "name": "Italy", "advisory": "Petty Crime: Foreigners are targets for pickpockets and thieves, especially in tourist areas and larger cities. Teams may work together to distract travellers. Thefts are also known to take place on trains and public transport when travellers are distracted or sleeping. Be aware of your surroundings and take care of your belongings. ", "visa_info": "Visa not required"}, {"country_iso": "JM", "name": "Jamaica", "advisory": "The Government of Jamaica has extended the States of Public Emergency (SOEs) in the parish of St Andrew South until 5 October 2019 and in the parishes of St James, Westmoreland and Hanover until 28 October 2019. During the SOEs, the security forces are authorised to search, curtail operating hours of businesses, restrict access to places and detain persons without a warrant. Singaporeans travelling to the affected areas are advised to eRegister with MFA, be vigilant, monitor local news and follow the instructions of local authorities.", "visa_info": "Visa not required"}, {"country_iso": "JP", "name": "Japan", "advisory": "While the crime rate for petty crimes in Japan is generally low, travellers should remain vigilant and ensure that valuables such as passports and cash are not left unattended.  There have been occasional reports of foreigners being targeted for credit card fraud and extortion in Tokyo’s entertainment and nightlife districts. Travellers are advised to avoid touts. Travellers should note that the Japan Police may not provide a copy of the police report of the incident. Instead, a report number (with no content) will be issued to acknowledge that a report has been lodged at the police station. Hence, it may be useful to take note of the Police Station where the report is filed.", "visa_info": "Visa not required"}, {"country_iso": "JO", "name": "Jordan", "advisory": "Jordan is generally safe though there have been some instances of petty crime and a heightened risk of terrorism. The security situation in areas bordering Syria and Iraq can quickly become volatile. Monitor the local news and avoid large public gatherings.", "visa_info": "Visa on arrival"}, {"country_iso": "KZ", "name": "Kazakhstan", "advisory": "The country is generally safe, although petty crime does occur. Be aware of your surroundings and keep valuables in a safe place out of public view. Avoid walking alone, particularly at night. Where possible, pre-arrange transport with a reputable provider and have a way of identifying your driver.", "visa_info": "Visa not required"}, {"country_iso": "KE", "name": "Kenya", "advisory": "The crime rate is high in most areas of Kenya, especially in major cities like Nairobi. Violent crime, including assault, kidnapping and armed robbery, does occur, including during daylight hours. Petty crime, such as pickpocketing and bag snatching, is also common. Avoid carrying large amounts of cash or wearing jewellery. Avoid travelling alone, especially after dark. Be aware of your surroundings and take care of your belongings.", "visa_info": "Visa not required"}, {"country_iso": "KI", "name": "Kiribati", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "KP", "name": "North Korea", "advisory": "Notwithstanding recent developments, including the US-DPRK Summit held in Singapore in June 2018, the situation on the Korean Peninsula remains uncertain. Those who intend to travel to North Korea are advised to monitor developments in the country closely.", "visa_info": "Visa required"}, {"country_iso": "KR", "name": "South Korea", "advisory": "While there may be occasional periods of tension arising from North Korea’s actions, the situation in the country remains calm. At times of increased tensions, keep abreast of the news and monitor developments closely. Remain vigilant and take the necessary precautions for your personal safety. You may also download the free “Emergency Ready App”, released by the South Korean government for more information on local emergency services, hospitals and emergency shelter locations. ", "visa_info": "Visa not required"}, {"country_iso": "KW", "name": "Kuwait", "advisory": "Singaporeans travelling to Kuwait are advised to take the necessary precautions and exercise personal responsibility at all times. All Singaporeans travelling overseas are encouraged to take up comprehensive travel insurance. Please check with the insurers for clarifications on the terms and conditions of the insurance coverage. Singaporeans are strongly encouraged to eRegister with the Ministry of Foreign Affairs at https://eregister.mfa.gov.sg/ and to stay in touch with your family and friends so that they know you are safe.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "KG", "name": "Kyrgyzstan", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "LA", "name": "Laos", "advisory": "Singaporeans visiting Laos are reminded to remain vigilant and take precautions against petty crimes, including pickpocketing and snatch theft. Visitors should also exercise caution when considering off-road wilderness travel in rural areas due to the risk of unexploded ordnance.  ", "visa_info": "Visa not required"}, {"country_iso": "LV", "name": "Latvia", "advisory": "Petty crime, such as pickpocketing, bag-snatching and street theft, does occur, especially in Riga. Pickpocketing is prevalent at airports and train stations and near the main market area. Be aware of your surroundings and take care of your belongings.", "visa_info": "Visa not required"}, {"country_iso": "LB", "name": "Lebanon", "advisory": "Terrorist attacks have occurred in the past. There is also a threat of kidnapping in Lebanon. Be alert and follow the advice of the local authorities.", "visa_info": "Free Visa on arrival"}, {"country_iso": "LS", "name": "Lesotho", "advisory": "Singaporeans who plan to drive in Lesotho should take note of the road conditions.  Some rural areas could be accessed only by heavy duty four-wheel-drive vehicles.  If you are visiting during the winter months, you should make the necessary preparations to drive on icy roads and to be prepared for road closures due to snow.", "visa_info": "Visa not required"}, {"country_iso": "LR", "name": "Liberia", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "LY", "name": "Libya", "advisory": "The security situation in Libya remains dangerous and unpredictable.  Tripoli International Airport remains closed.  While Benghazi International Airport has re-opened, international flights do not operate regularly. The airport may close on short notice.", "visa_info": "Visa required"}, {"country_iso": "LI", "name": "Liechtenstein", "advisory": "The crime rate is low, but petty crime, including pickpocketing, does still occur. Exercise caution and do not leave your personal belongings unattended.", "visa_info": "Visa not required"}, {"country_iso": "LT", "name": "Lithuania", "advisory": "The crime rate is low, but petty crime, including pickpocketing, does still occur. Exercise caution and do not leave your personal belongings unattended. Car and bicycle theft may also be a concern in certain areas.", "visa_info": "Visa not required"}, {"country_iso": "LU", "name": "Luxembourg", "advisory": "Demonstrations: Demonstrations in major European cities occasionally take place.  They tend to occur on politically significant holidays and during international summits. Should demonstrations take place, most are peaceful, but the situation can turn confrontational and escalate into violence quickly. Travellers are thus encouraged to avoid areas around protests and demonstrations. If you encounter a demonstration, exercise caution, leave the area as soon as possible, and check the local media for updates on the situation and traffic.", "visa_info": "Visa not required"}, {"country_iso": "MG", "name": "Madagascar", "advisory": "Violent crime is common in Madagascar, including home invasions, kidnappings and robbery. Such incidents may be gang-related. It is not uncommon for firearms to be used. National parks and beaches are commonly targeted by armed gangs. Stay vigilant, and engage the services of reliable park guides certified by the local government.", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "MW", "name": "Malawi", "advisory": null, "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "MY", "name": "Malaysia", "advisory": "Take general precautions to ensure your personal security in Malaysia such as:", "visa_info": "Visa not required"}, {"country_iso": "MV", "name": "Maldives", "advisory": "Drug-related and gang-related crime does occur in the Maldives. Petty crime, such as pickpocketing and theft, can also be common especially in public areas such as the beach. Be aware of your surroundings and take care of your belongings.", "visa_info": "Free visa on arrival"}, {"country_iso": "ML", "name": "Mali", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "MT", "name": "Malta", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "MH", "name": "Marshall Islands", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "MR", "name": "Mauritania", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "MU", "name": "Mauritius", "advisory": "Petty crime, including pickpocketing and theft, occurs quite frequently. Avoid carrying large amounts of cash or wearing jewellery. Be aware of your surroundings and take care of your belongings, especially in crowded tourist areas such as Port Louis and Flic en Flac.", "visa_info": "Visa not required"}, {"country_iso": "MX", "name": "Mexico", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "FM", "name": "Micronesia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "MD", "name": "Moldova", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "MC", "name": "Monaco", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "MN", "name": "Mongolia", "advisory": "Be careful of petty crimes, particularly in crowded areas, and those frequented by foreigners and tourists. Mobile telephone network coverage may be limited in some areas in Mongolia. Ensure that you leave a copy of your travel itinerary and contact details of your local guide or travelling companion(s) with your family members. ", "visa_info": "Visa not required"}, {"country_iso": "ME", "name": "Montenegro", "advisory": "Petty crime directed at foreigners does occur. Avoid carrying large amounts of cash or wearing jewellery. Travel in groups. ", "visa_info": "Visa not required"}, {"country_iso": "MA", "name": "Morocco", "advisory": "Travellers should exercise caution against petty crime, particularly in tourist areas. Keep valuables in a safe place out of public view. Avoid travelling alone, especially in quiet areas and after dark.", "visa_info": "Visa not required"}, {"country_iso": "MZ", "name": "Mozambique", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "MM", "name": "Myanmar", "advisory": "There have been reports of a deteriorating security situation arising from the situation in Rakhine State.  In September 2017, the Myanmar Government issued a statement notifying citizens of possible bomb attacks by terrorists against innocent civilians in Nay Pyi Taw, Yangon, Mandalay and other big cities. There was also a demonstration in support of the military that took place on 29 October 2017.", "visa_info": "Visa not required"}, {"country_iso": "NA", "name": "Namibia", "advisory": "", "visa_info": "Visa not required"}, {"country_iso": "NR", "name": "Nauru", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "NP", "name": "Nepal", "advisory": "Nepal is in a major earthquake zone and remains at risk from further earthquakes and aftershocks. You should familiarise yourself with safety procedures in the event of an earthquake.  The monsoon season normally runs from June to September. Flooding and landslides often occur during this time. Road travel anywhere can be hazardous, particularly in rural areas.  Never trek alone. Use a reputable agency, remain on established routes and walk with at least one other person.  ", "visa_info": "Visa on arrival"}, {"country_iso": "NL", "name": "Netherlands", "advisory": "Demonstrations: Demonstrations in major European cities occasionally take place.  They tend to occur on politically significant holidays and during international summits. Should demonstrations take place, most are peaceful, but the situation can turn confrontational and escalate into violence quickly. Travellers are thus encouraged to avoid areas around protests and demonstrations. If you encounter a demonstration, exercise caution, leave the area as soon as possible, and check the local media for updates on the situation and traffic.", "visa_info": "Visa not required"}, {"country_iso": "NZ", "name": "New Zealand", "advisory": "Crime:   Crime levels are generally low, but street crime occurs in major towns and cities.  Theft occurs from hotel rooms, tourist sites, recreational areas, and especially in unattended vehicles.  Ensure that your personal belongings, passports and other travel documents are secure at all times.", "visa_info": "Electronic Travel Authority"}, {"country_iso": "NI", "name": "Nicaragua", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash, or wearing jewellery and avoid travelling alone. Use only official taxis. Engage only reputable tour operators and local guides.", "visa_info": "Visa not required"}, {"country_iso": "NG", "name": "Niger", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "NG", "name": "Nigeria", "advisory": "Violent crime is common, including murder, kidnapping, and assault. The threat of domestic terrorism is high. Indiscriminate shootings, bombings, and kidnappings do occur. Terrorists may target hotels frequented by foreign guests. Travellers are strongly encouraged to engage professional security services. ", "visa_info": "Visa required"}, {"country_iso": "MK", "name": "North Macedonia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "NO", "name": "Norway", "advisory": "Driving: Snow and ice make road conditions dangerous in winter. Headlights must be switched on at all times, even during the day. Snow tires are required between November and April each year. If you are driving to a remote area, pack extra water, food, and blankets. Do not drive if weather conditions are poor. Drivers are strongly encouraged to purchase a comprehensive insurance plan and to seek advice on safe driving when road conditions are icy. ", "visa_info": "Visa not required"}, {"country_iso": "OM", "name": "Oman", "advisory": "no conversion", "visa_info": "eVisa"}, {"country_iso": "PK", "name": "Pakistan", "advisory": "The threat of terrorist attacks is high, and may take place in areas frequented by foreigners. Avoid crowded places including government and military institutions, markets, places of worship, and shopping malls.", "visa_info": "Electronic Travel Authorization"}, {"country_iso": "PW", "name": "Palau", "advisory": null, "visa_info": "Free visa on arrival"}, {"country_iso": "PA", "name": "Panama", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash, or wearing jewellery and avoid travelling alone. Use only official taxis. Engage only reputable tour operators and local guides.", "visa_info": "Visa not required"}, {"country_iso": "PG", "name": "Papua New Guinea", "advisory": "Do not leave your belongings unattended and be aware of your surroundings. Stay vigilant, travel in groups, and avoid going out at night alone. Know your risk appetite and ensure that you purchase comprehensive travel insurance that will cover your chosen activity. Travellers should note that medical facilities on the islands are limited and that medical evacuation can be expensive. ", "visa_info": "eVisa / Free visa on arrival"}, {"country_iso": "PY", "name": "Paraguay", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "PE", "name": "Peru", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "PH", "name": "Philippines", "advisory": "Driving in the Philippines: Foreigners may use their valid foreign driver’s license in the Philippines within 90 days of arrival.  Conversion of foreign driver’s license to Philippine driver’s license is also allowed.", "visa_info": "Visa not required"}, {"country_iso": "PL", "name": "Poland", "advisory": "Petty crime, such as pick-pocketing and theft, does occur, especially on public transport and in tourist areas. Robbery is common at the main rail stations and on trains, especially overnight sleeper trains. Be vigilant especially while boarding and leaving trains. Secure your belongings if you are on an overnight train. ", "visa_info": "Visa not required"}, {"country_iso": "PT", "name": "Portugal", "advisory": "Terrorism: Terrorist attacks have occurred in several cities in Europe. Singaporeans should remain vigilant to possible threats.", "visa_info": "Visa not required"}, {"country_iso": "QA", "name": "Qatar", "advisory": "We advise Singaporeans to maintain the usual vigilance in public, be aware of local events and take appropriate steps for personal safety at all times.  Although crime levels are low, female visitors should take extra care when travelling alone at night.", "visa_info": "Visa not required"}, {"country_iso": "RO", "name": "Romania", "advisory": "Petty crime, such as pickpocketing and theft, is common, especially in urban centres and crowded areas. Theft is prevalent in hotels, transport stations and train services. Be vigilant especially while boarding and leaving trains.", "visa_info": "Visa not required"}, {"country_iso": "RU", "name": "Russia", "advisory": "", "visa_info": "Visa required"}, {"country_iso": "RW", "name": "Rwanda", "advisory": "Travellers are advised to exercise a high degree of caution in Rwanda due to the prevalence of crime and violence. Grenade attacks and fatal incidents of violence have occurred. Avoid protests and demonstrations as they may turn violent. If there is evidence of unrest, head to a safe place immediately.", "visa_info": "Visa not required"}, {"country_iso": "KN", "name": "Saint Kitts and Nevis", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "LC", "name": "Saint Lucia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "VC", "name": "Saint Vincent and the Grenadines", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "WS", "name": "Samoa", "advisory": "Do not leave your belongings unattended and be aware of your surroundings. Stay vigilant, travel in groups, and avoid going out at night alone. Know your risk appetite and ensure that you purchase comprehensive travel insurance that will cover your chosen activity. Travellers should note that medical facilities on the islands are limited and that medical evacuation can be expensive. ", "visa_info": "Free Entry permit on arrival"}, {"country_iso": "SM", "name": "San Marino", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "ST", "name": "São Tomé and Príncipe", "advisory": null, "visa_info": "eVisa"}, {"country_iso": "SA", "name": "Saudi Arabia", "advisory": "As reckless driving is quite common in some parts of Saudi Arabia, do exercise extra caution if driving in Saudi Arabia and put on the seatbelt when travelling in any vehicle in Saudi Arabia. ", "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "SN", "name": "Senegal", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "RS", "name": "Serbia", "advisory": "Travellers are advised to exercise a high degree of caution in the areas bordering Macedonia due to the migrant situation and in the areas bordering Kosovo due to possible political tensions and unrest. Obey all warning signs and stay on the main roads when in the border regions due to the presence of unexploded landmines and ordnance. ", "visa_info": "Visa not required"}, {"country_iso": "SC", "name": "Seychelles", "advisory": null, "visa_info": "Free Visitor's permit on arrival"}, {"country_iso": "SL", "name": "Sierra Leone", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "SK", "name": "Slovakia", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "SI", "name": "Slovenia", "advisory": "Petty crime, such as pick-pocketing, occurs in Slovenia. Be aware of your surroundings and take care of your belongings.", "visa_info": "Visa not required"}, {"country_iso": "SB", "name": "Solomon Islands", "advisory": "Due to the current measles outbreak in several Pacific countries, the Solomon Islands has implemented travel requirements to prevent an outbreak in the country. Singaporeans travelling to the Solomon Islands should take note of the requirements outlined in the Measles Travel Advisory which was issued by the Solomon Islands’ Ministry of Health And Medical Services on 13 December 2019 including having to complete a Traveller’s Public Health Declaration Card upon arrival. ", "visa_info": "Free Visitor's permit on arrival"}, {"country_iso": "SO", "name": "Somalia", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "ZA", "name": "South Africa", "advisory": "If you have been to a region with Yellow Fever, you will be asked to produce your Yellow Fever Vaccination Certificate for entry into South Africa.", "visa_info": "Visa not required"}, {"country_iso": "SS", "name": "South Sudan", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "ES", "name": "Spain", "advisory": "Petty crime is common especially in large cities and tourist areas. Thieves may attempt to distract travellers by asking them questions or showing them a large map. Be aware of your surroundings and take care of your belongings. Avoid carrying large amounts of cash or wearing jewellery. ", "visa_info": "Visa not required"}, {"country_iso": "LK", "name": "Sri Lanka", "advisory": "Violent crime occurs in areas frequented by tourists. Foreigners may be targets of drink spiking, sexual assault, and theft. Be aware of your surroundings and take care of your belongings. Avoid walking alone at night. ", "visa_info": "Free Visa on Arrival"}, {"country_iso": "SD", "name": "Sudan", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "SR", "name": "Suriname", "advisory": null, "visa_info": "E-tourist card"}, {"country_iso": "SE", "name": "Sweden", "advisory": "Crime: The crime rate in Sweden is generally low, though there are instances of violent crimes. Pickpocketing occurs in major cities where tourists are targeted for passports and cash. Be alert and take measures to protect your belongings.", "visa_info": "Visa not required"}, {"country_iso": "CH", "name": "Switzerland", "advisory": "Petty crime: In the major cities such as Geneva, Zurich and Bern, petty crimes like theft, purse snatchings and pick-pocketing most commonly occur in crowded areas, transport hubs (train and bus stations), airports, tourist attractions, and some public parks, especially during peak tourist periods (e.g. during summer months of June to September and the Christmas holidays in December) and when there are major conferences or exhibitions. Thieves may operate in pairs or as a group, with one creating a diversion while the other steals unguarded items. ", "visa_info": "Visa not required"}, {"country_iso": "SY", "name": "Syria", "advisory": "", "visa_info": "Visa required"}, {"country_iso": "TJ", "name": "Tajikistan", "advisory": null, "visa_info": "eVisa / Visa on arrival"}, {"country_iso": "TZ", "name": "Tanzania", "advisory": "Travellers are advised to exercise a high degree of caution in Tanzania due to the high levels of crime and threat of terrorism. ", "visa_info": "Visa not required"}, {"country_iso": "TH", "name": "Thailand", "advisory": "and purchase comprehensive insurance with third party coverage", "visa_info": "Visa not required"}, {"country_iso": "TL", "name": "Timor-Leste", "advisory": "Monitor the news and avoid large public gatherings where possible. Follow the advice of the local authorities.", "visa_info": "Visa on arrival"}, {"country_iso": "TG", "name": "Togo", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "TO", "name": "Tonga", "advisory": "Do not leave your belongings unattended and be aware of your surroundings. Stay vigilant, travel in groups, and avoid going out at night alone. Know your risk appetite and ensure that you purchase comprehensive travel insurance that will cover your chosen activity. Travellers should note that medical facilities on the islands are limited and that medical evacuation can be expensive. ", "visa_info": "Free visa on arrival"}, {"country_iso": "TT", "name": "Trinidad and Tobago", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery.", "visa_info": "Visa not required"}, {"country_iso": "TN", "name": "Tunisia", "advisory": "", "visa_info": "Visa not required"}, {"country_iso": "TR", "name": "Turkey", "advisory": "Natural Disasters: Many parts of Turkey are subject to earthquakes and tremors. In the event of such occurrences, please follow the instructions given by the local authorities. It would also be good to familiarize yourself with the general safety procedures in the event of an earthquake.", "visa_info": "Visa not required"}, {"country_iso": "TM", "name": "Turkmenistan", "advisory": null, "visa_info": "Visa required"}, {"country_iso": "TV", "name": "Tuvalu", "advisory": null, "visa_info": "Visa on arrival"}, {"country_iso": "UG", "name": "Uganda", "advisory": "Travellers are advised to exercise a high degree of caution in Uganda due to the threat of civil unrest and terrorism and high levels of crime. Avoid travelling to the high-risk and volatile areas bordering the Democratic Republic of Congo, Karamoja region, and South Sudan. ", "visa_info": "Visa not required"}, {"country_iso": "UA", "name": "Ukraine", "advisory": "Travellers are advised to exercise a high degree of caution in Ukraine due to the unpredictable security situation across the country and threat of terrorist attacks.", "visa_info": "eVisa"}, {"country_iso": "AE", "name": "United Arab Emirates", "advisory": "The UAE is generally safe and has one of the lowest crime rates in the world. In Dubai, the largest city in the UAE, the incidence of serious crime is reported by the local police at about 1 per 100,000 people, compared with the international average of 5 per 100,000. Violent crimes and crimes against property are rare, but do occur. Travellers should therefore ensure their personal items and travel documents are secure at all times.", "visa_info": "Free visa on arrival"}, {"country_iso": "GB", "name": "United Kingdom", "advisory": "The UK faces a serious and challenging threat from terrorism, international groups, domestic extremists and Northern Ireland-related groups.", "visa_info": "Visa not required"}, {"country_iso": "US", "name": "United States", "advisory": "Crime: To prevent petty theft and pickpocketing, ensure that your travel documents and personal belongings are secure at all times.  Be reminded not to leave bags or valuables unattended or in plain view in parked cars (especially rental vehicles).", "visa_info": "Visa Waiver Program"}, {"country_iso": "UY", "name": "Uruguay", "advisory": "Be aware of your surroundings. Avoid carrying large amounts of cash or wearing jewellery. If robbed, it is safer to hand over your cash and valuables without resistance.", "visa_info": "Visa not required"}, {"country_iso": "UZ", "name": "Uzbekistan", "advisory": "The regions bordering Afghanistan, Tajikistan and Kyrgyz Republic may not be safe due to the possibility of security incidents, and landmines in some border areas. Land border crossings can also close at short notice.", "visa_info": "Visa not required"}, {"country_iso": "VU", "name": "Vanuatu", "advisory": "Do not leave your belongings unattended and be aware of your surroundings. Stay vigilant, travel in groups, and avoid going out at night alone. Know your risk appetite and ensure that you purchase comprehensive travel insurance that will cover your chosen activity. Travellers should note that medical facilities on the islands are limited and that medical evacuation can be expensive. ", "visa_info": "Visa not required"}, {"country_iso": "VA", "name": "Vatican City", "advisory": null, "visa_info": "Visa not required"}, {"country_iso": "VE", "name": "Venezuela", "advisory": "Travellers are advised to exercise a high degree of caution in Venezuela due to the significant level of violent crime, the unstable political and economic conditions and decline in basic living conditions, including shortages of food staples, water and medication. ", "visa_info": "Visa required"}, {"country_iso": "VN", "name": "Vietnam", "advisory": "Transport: Typically, foreign travellers use taxis.  For taxis, the more reputable companies are ABC, Mai Linh and CP in Hanoi, as well as Vinasun and Mai Linh in HCMC. If possible, you may wish to seek your hotel’s assistance to flag a taxi from a reputable company on your behalf.  Do remember the four digit alphanumeric number which is displayed on a disc at the front and rear of the taxis (not the number plates) so that you may follow-up with the taxi companies, if there is a need to do so. Travellers arriving at the airports should proceed to the taxi queue directly to take a taxi, and insist that the driver switch on the meter before moving off.  Avoid going along with “taxi agents” standing outside the arrival halls who will approach unsuspecting tourists to bring them to illegal or fake taxis waiting at the carparks or outside of the taxi stand.  Grab is also popular in Vietnam.  However, when calling a Grab ride from the airport, be sure to verify the vehicle number against that indicated on the app and avoid going with anyone who approaches you claiming to be your driver.", "visa_info": "Visa not required"}, {"country_iso": "YE", "name": "Yemen", "advisory": "", "visa_info": "Visa required"}, {"country_iso": "ZM", "name": "Zambia", "advisory": "Travellers are advised to exercise a high degree of caution in Zambia due to the high levels of crime. Take precautions and avoid driving off main roads in the area bordering Angola, the Democratic Republic of Congo, Mozambique and Zimbabwe due to possible landmines and unexploded ordinance, and unstable security situation. ", "visa_info": "Visa not required"}, {"country_iso": "ZW", "name": "Zimbabwe", "advisory": "Travelling on roads and highways is generally safe. When driving, Singaporeans should stick to major roads, check routes in advance and not rely solely on GPS (which tends to select the shortest route including unpaved and unlit tracks), avoid stopping on highways, be prepared for breakdowns, and pay attention to natural hazards such as animals, fog and flash floods especially at night.", "visa_info": "Visa not required"}, {"country_iso": "CK", "name": "Cook Islands", "advisory": "Do not leave your belongings unattended and be aware of your surroundings. Stay vigilant, travel in groups, and avoid going out at night alone. Know your risk appetite and ensure that you purchase comprehensive travel insurance that will cover your chosen activity. Travellers should note that medical facilities on the islands are limited and that medical evacuation can be expensive.", "visa_info": null}, {"country_iso": "HK", "name": "Hong Kong", "advisory": "Hong Kong’s crime rate is generally low but pickpocketing and other street crimes can occur.   Singaporeans are advised to take extra care of their personal belongings including travel document, money and valuables in crowded areas. ", "visa_info": null}, {"country_iso": "MO", "name": "Macao", "advisory": "Macao’s crime rate is generally low but pickpocketing and other street crime can occur.   Singaporeans are advised to take extra care of personal belongings including travel document, money and valuables in crowded areas, and while travelling on public transportation. The Macao Tourism Crisis Management Office maintains a tourism hotline (+853 2833 3000) for visitors to Macao who encounters emergency situations. ", "visa_info": null}, {"country_iso": "MK", "name": "Macedonia", "advisory": "Petty crime is common, particularly in Skopje’s main downtown zone, shopping malls and entertainment zones.", "visa_info": null}, {"country_iso": "TW", "name": "Taiwan", "advisory": "The crime rate in Taiwan is low.  Nonetheless, petty crime and scams involving foreigners do occur.  Avoid confrontation and contact the police if necessary.  To drive in Taiwan you need an international driving permit.  Travellers are advised to familiarise themselves with local traffic rules and road conditions. Public demonstrations in Taiwan are generally peaceful.  Travellers should nonetheless avoid areas where demonstrations are taking place,  ", "visa_info": null}]